{
  "last_updated": "2025-12-06T12:50:45.910296+00:00",
  "total_articles": 60,
  "articles": [
    {
      "id": "9334492bce53b873",
      "title": "Ng-News 25/47: Angular 21",
      "description": "Angular 21 is out. 3 new features stand out. @angular/aria, Vitest as stable testing framework and the absolute highlight: Signal Forms. Signal Forms With Signal Forms we have now finally one unique forms module, which is the successor of both Reactive and Template-Driven ones. Of course the old ones don't get deprecated. As the name implies almost everything in Signals Forms is a Signal. Be it the field, the status, the value, the error, and so on. import { Component, signal } from '@angular/co",
      "url": "https://dev.to/this-is-angular/ng-news-2547-angular-21-50m0",
      "source": "This is Angular (Dev.to)",
      "author": "ng-news",
      "published": "2025-12-01T10:02:32+00:00",
      "niche": "angular",
      "score": 57,
      "keywords": []
    },
    {
      "id": "cf847bf5dac12f3f",
      "title": "Why Angular ARIA in v21 is pretty neat",
      "description": "Dies ist Beitrag 7 von 7 der Serie “Accessibility in Angular” Web Accessibility (A11y) in Angular – Introduction Accessibility Testing Tools for Angular Accessible Angular Routes ARIA roles and attributes in Angular Building Accessible Forms with Angular Enhancing A11y with Angular CDK Why Angular ARIA in v21 is pretty neat Angular ARIA is a collection [&#8230;] The post Why Angular ARIA in v21 is pretty neat appeared first on ANGULARarchitects.",
      "url": "https://www.angulararchitects.io/blog/angular-aria/",
      "source": "Angular Architects",
      "author": "Alexander Thalhammer",
      "published": "2025-12-01T21:00:46+00:00",
      "niche": "angular",
      "score": 45,
      "keywords": []
    },
    {
      "id": "ae1b802cada56280",
      "title": "What’s new in Angular 21?",
      "description": "Angular 21, released at the end of 2025, brings several new features: Signal Forms as a reactive form API, Zone-less as the new standard model for change detection, vitest as a modern test environment, a set of ARIA directives for accessible components, and an enhanced MCP server for AI-supported development. This article provides an overview [&#8230;] The post What’s new in Angular 21? appeared first on ANGULARarchitects.",
      "url": "https://www.angulararchitects.io/blog/whats-new-in-angular-21-signal-forms-zone-less-vitest-angular-aria-cli-with-mcp-server/",
      "source": "Angular Architects",
      "author": "Manfred Steyer",
      "published": "2025-12-02T09:45:22+00:00",
      "niche": "angular",
      "score": 45,
      "keywords": []
    },
    {
      "id": "bedfffc3936d9d04",
      "title": "Announcing Angular v21",
      "description": "Authors: Jens Kuehlers, Mark “Techson” ThompsonWhat an exciting time to be a developer! With all the exciting developments in AI in Web development, it feels like we’re going on a new adventure every day. This is perfectly in line with the theme of our v21 Release Event that gives a high level overview of the best of what Angular v21 has to offer.With the release of v21, Angular is an even greater partner for your daily adventures — giving you the stability of the Angular framework while enablin",
      "url": "https://blog.angular.dev/announcing-angular-v21-57946c34f14b?source=rss----447683c3d9a3---4",
      "source": "Angular Blog (Official)",
      "author": "Angular",
      "published": "2025-11-19T22:35:29+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "316bd78c657c36c0",
      "title": "Handling Time and Mock Clocks in Tests",
      "description": "In the realm of software testing, the concept of time can be a tricky one to manage, especially when dealing with asynchronous operations and timeouts. We are continually refining our approach to handling time in unit tests, particularly concerning the use of mock clocks. We’ve found that mock clocks, while useful, often lead to headaches in test code and unrealistic timing scenarios. To address these challenges, we are exploring the exciting concept of “auto-advancing” mock clocks, which aim to",
      "url": "https://blog.angular.dev/handling-time-and-mock-clocks-in-tests-5a393b32dd30?source=rss----447683c3d9a3---4",
      "source": "Angular Blog (Official)",
      "author": "Andrew Scott",
      "published": "2025-11-07T01:01:25+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "c15375530915247e",
      "title": "Angular support for generating apps in Google AI Studio is now available",
      "description": "Author: Mark (Techson) ThompsonWe’re overjoyed to announce that you can now generate Angular apps using the power of Google AI Studio.We know that developers are embracing AI and code generation as a part of their daily workflows. Whether it is generating code to prototype a new app experience for your users or getting help on your existing projects — AI is there in the process. We want to ensure that Angular is in the places where developers are building.This was a collaborative effort between ",
      "url": "https://blog.angular.dev/angular-support-for-generating-apps-in-google-ai-studio-is-now-available-3a3afde38f58?source=rss----447683c3d9a3---4",
      "source": "Angular Blog (Official)",
      "author": "Angular",
      "published": "2025-10-02T17:43:53+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "3886cf9e367805ea",
      "title": "Beyond the Horizon: How Angular is Embracing AI for Next-Gen Apps",
      "description": "Author: Simona Cotin, Sr. Engineering Manager AngularWe hope you enjoyed watching the Angular + AI Developer event on YouTube where we were able to announce the new Web Codegen Scorer tool. This post goes more into details on how the tool came about and the story for Angular and generative AI in general.As developers like you embed artificial intelligence in their workflows, what does that mean for the framework? What does that mean for the future of development? While we can’t predict the futur",
      "url": "https://blog.angular.dev/beyond-the-horizon-how-angular-is-embracing-ai-for-next-gen-apps-7a7ed706e1a3?source=rss----447683c3d9a3---4",
      "source": "Angular Blog (Official)",
      "author": "Angular",
      "published": "2025-09-16T16:01:49+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "718038e272b5c7d1",
      "title": "Angular Summer Update 2025",
      "description": "Authors: Jens Kuehlers Mark TechsonAs summer reaches its peak, the Angular team wants to share some updates from the latest minor releases.Since launching Angular v20 in May, the team has been hard at work shipping new features and improvements in v20.1 and v20.2. We are continuing our mission to boost developer productivity and help you create apps your users will love. As part of that mission, we’ve also expanded our AI offerings to enhance your development workflow.HighlightsZoneless APIs are",
      "url": "https://blog.angular.dev/angular-summer-update-2025-1987592a0b42?source=rss----447683c3d9a3---4",
      "source": "Angular Blog (Official)",
      "author": "Angular",
      "published": "2025-08-29T20:51:40+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "56527af29db0113b",
      "title": "The Angular Custom Profiling Track is now available",
      "description": "Authors: Mark Thompson Pawel KozlowskiProfiling web applications can be a complex task, often requiring developers to juggle between different tools that present data in disconnected ways. Traditionally, Chrome’s performance panel is excellent for detailed function call analysis, while Angular DevTools offers a higher-level view based on framework concepts like components, lifecycle hooks, bindings etc. Unfortunately, having two separate tools leads to a fragmented understanding of performance.T",
      "url": "https://blog.angular.dev/the-angular-custom-profiling-track-is-now-available-0f9d8d36218a?source=rss----447683c3d9a3---4",
      "source": "Angular Blog (Official)",
      "author": "Angular",
      "published": "2025-07-02T19:38:06+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "6b1ac8d3070244b9",
      "title": "Announcing Angular v20",
      "description": "The past couple of years have been transformative for Angular, as we’ve unleashed major advancements like reactivity with Signals and the power of Zoneless applications. We hope these features have helped the Angular community build the next generation of web applications with fast time-to-market and robust performance.And we are just getting started! Angular v20 is our latest release where we have spent countless hours polishing some of our in-progress features for the rock-solid developer expe",
      "url": "https://blog.angular.dev/announcing-angular-v20-b5c9c06cf301?source=rss----447683c3d9a3---4",
      "source": "Angular Blog (Official)",
      "author": "Minko Gechev",
      "published": "2025-05-28T18:33:28+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "ba401f03af1eb9aa",
      "title": "Build AI-Powered Apps With Genkit and Angular",
      "description": "There has never been a better time to start building with AI and the state-of-the-art models available to developers everywhere. Building with AI is for everyone, especially web developers. The Firebase team at Google has just launched the 1.0 version of Genkit for Node.js which means that it is ready for production and ready to help you build the next generation of AI powered applications.What is Genkit?Genkit is a framework designed to help you build AI-powered applications and features. It pr",
      "url": "https://blog.angular.dev/build-ai-powered-apps-with-genkit-and-angular-707db8918c3a?source=rss----447683c3d9a3---4",
      "source": "Angular Blog (Official)",
      "author": "Angular",
      "published": "2025-03-18T03:15:07+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "f90fe0ed517f862d",
      "title": "Seamless data fetching with httpResource",
      "description": "Photo by Jamie Street on UnsplashFantastic new APIs are coming to Angular. Two years ago, we proposed making Angular a reactive web framework powered by signals. Since then, the team has shipped a number of signal-based features in the framework: reactive primitives like signal & computed, reactive inputs including model, signal queries, bidirectional RxJS conversion utilities, and migration tooling.We have a solid foundation for reactivity in Angular. Now, we’re ready to begin the next phase of",
      "url": "https://blog.angular.dev/seamless-data-fetching-with-httpresource-71ba7c4169b9?source=rss----447683c3d9a3---4",
      "source": "Angular Blog (Official)",
      "author": "Matthieu Riegler",
      "published": "2025-03-07T15:02:52+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "176bceba64e5c319",
      "title": "Angular 19.2 Is Now Available",
      "description": "And we’re back with Angular’s latest minor release, version 19.2, bringing new APIs and experimental features to empower developers on their next great app.Expanding reactivity beyond synchronousIn Angular v19 we released the experimental resource API, continuing our reactivity story to a new chapter — asynchronous reactivity.With this release, we’re thrilled to introduce two significant updates: asynchronous reactivity with the new httpResource and resource streaming with rxResource APIs.Develo",
      "url": "https://blog.angular.dev/angular-19-2-is-now-available-673ec70aea12?source=rss----447683c3d9a3---4",
      "source": "Angular Blog (Official)",
      "author": "Angular",
      "published": "2025-03-05T16:55:07+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "03c9709376526686",
      "title": "Angular Signal Forms — Set-up and validation rules",
      "description": "Angular Signal Forms — Set-up and validation rulesSignal Forms are available with Angular 21 as an experiment, which means the API described in this tutorial is subject to change, but stable enough to give you a first overview of Angular Signal Forms.Rather than replacing template-driven forms or reactive forms, signal forms are a third option. In this brief tutorial, I will highlight how the new paradigm works and what the differences are compared to previous approaches.Creating a signal formSi",
      "url": "https://blog.angulartraining.com/angular-signal-forms-set-up-and-validation-rules-5057b5d22f2c?source=rss----8725e60f0d54---4",
      "source": "Angular Training Blog",
      "author": "Alain Chautard",
      "published": "2025-11-12T16:21:22+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "efc8e093aa93fdb0",
      "title": "How to animate transitions with Angular?",
      "description": "In Angular 20.2, CSS animations for transitions have evolved with a fairly simple API.Let’s dive into it.How to animate a new element entering the screen?Here is an example of animation for an element entering the screen:The first thing to know is that animations are 100% driven by CSS. If you’re not familiar with CSS animations, you can use the CSS animation generator mentioned in this post.Note that AI tools can also assist you in generating proper CSS animations. In the case of the example ab",
      "url": "https://blog.angulartraining.com/how-to-animate-transitions-with-angular-66bad6d0dae2?source=rss----8725e60f0d54---4",
      "source": "Angular Training Blog",
      "author": "Alain Chautard",
      "published": "2025-10-15T08:47:55+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "08300ebea075d0c1",
      "title": "Dynamic component creation with Angular",
      "description": "Recently, I’ve covered different architecture options to control a dialog component. All these options had the component in place in the DOM and used some external trigger to show or hide the component’s template.But what about creating a component and rendering it on demand? Of course, we have lazy-loading and the @defer block, but what if we want to decide which component to display at runtime, or even better, can replace that component on-demand with Typescript code?Enter ViewContainerRefA vi",
      "url": "https://blog.angulartraining.com/dynamic-component-creation-with-angular-f81bae0109ab?source=rss----8725e60f0d54---4",
      "source": "Angular Training Blog",
      "author": "Alain Chautard",
      "published": "2025-09-17T09:17:35+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "a12f96d55b88d597",
      "title": "Component architecture with inputs, model(), and viewChild()",
      "description": "I get asked a lot about best practices in terms of Angular architecture. As a result, in this post, I want to showcase three different ways to achieve the same kind of component communication in Angular, highlighting the pros and cons of each approach.The example we’ll be working on is the following, where two components (a main component and a dialog component) communicate to open and close a dialog:First approach: Inputs and outputsIn this first attempt, my dialog component is entirely driven ",
      "url": "https://blog.angulartraining.com/component-architecture-with-inputs-model-and-viewchild-a236a48b461f?source=rss----8725e60f0d54---4",
      "source": "Angular Training Blog",
      "author": "Alain Chautard",
      "published": "2025-08-20T17:45:46+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "7526558beec60ed2",
      "title": "How to use the new Signal Graph in the Angular Dev Tools?",
      "description": "Angular 20.1 introduced a new experimental feature that displays a dynamic Signal graph of all Signal dependencies for a given component.In this brief tutorial, we'll explore how to access the graph and what type of information it displays.What are the requirements for using Signal Graph?Your application needs to be upgraded to Angular 20.1 or later and use the latest version of Chrome or Firefox.How to open the Signal Graph?With your Angular application running in development mode, open Chrome ",
      "url": "https://blog.angulartraining.com/how-to-use-the-new-signal-graph-in-the-angular-dev-tools-b5b8a0ace6dd?source=rss----8725e60f0d54---4",
      "source": "Angular Training Blog",
      "author": "Alain Chautard",
      "published": "2025-07-31T10:53:15+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "1ab6b3d6eba6d883",
      "title": "What does Zoneless Angular mean?",
      "description": "With the release of Angular 20, the buzz around zoneless Angular applications has increased quite a bit. That’s because Zoneless is no longer an experimental feature, as it has been promoted to developer preview, the final step before becoming stable.A world of Zoneless Angular code, according to AISo, what is Zoneless? I’ve explained before that Angular relies on a library called Zone.js to perform change detection. The idea is that any event in the browser (such as a click, a Promise that reso",
      "url": "https://blog.angulartraining.com/what-does-zoneless-angular-mean-0a3a9d2a047d?source=rss----8725e60f0d54---4",
      "source": "Angular Training Blog",
      "author": "Alain Chautard",
      "published": "2025-06-11T21:42:32+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "4bf62cab12465d33",
      "title": "The Angular Compiler: From Your Code to Browser Code",
      "description": "If you’ve ever wondered what Angular does with your component code and what actually ends up in the browser, this article is for you!First, if you want to look at the resulting code after the compiler does its work, you can run ng serve, then open dist/project-name/browser/main-xxxxx.js, where xxxxx is a unique hash generated by the compiler, such as main-5ABRQQ7A.js.This hash is present for cache-busting purposes. When you deploy a new app version, your main.js file gets a new unique name, forc",
      "url": "https://blog.angulartraining.com/the-angular-compiler-from-your-code-to-browser-code-9b20ac2cbac6?source=rss----8725e60f0d54---4",
      "source": "Angular Training Blog",
      "author": "Alain Chautard",
      "published": "2025-05-07T19:29:08+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "c5e5549b10854de2",
      "title": "Signals + HTTP = httpResource [Tutorial]",
      "description": "Angular 19.2 brought an experimental new API called httpResource. I published a tutorial about rxResource a few months ago, and httpResource is a new, more polished layer on top of that.Let’s start with the basics. Signals are slowly making their way across all APIs of the Angular framework, which begs the question: How do we use the Angular HttpClient with Signals, since the HttpClient returns an Observable?A simple answer would be to use the toSignal function:signal = toSignal(this.http.get(\"h",
      "url": "https://blog.angulartraining.com/signals-http-httpresource-tutorial-bf8792e9bda0?source=rss----8725e60f0d54---4",
      "source": "Angular Training Blog",
      "author": "Alain Chautard",
      "published": "2025-04-16T22:50:55+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "feb7f857d5ac0d1c",
      "title": "Custom styling in Angular Material 19+",
      "description": "I’ve written about the Angular CDK before and how to create custom themes using the Angular Material Theme Generator.With Angular Material v19, custom styling has become much more manageable.If you navigate to the documentation of any component, you’ll notice a new tab called “styling”, as shown here for the button component:What’s nice about that new approach is that it’s based on mixin overrides for different types of components. That’s great if your goal is to change something for all instanc",
      "url": "https://blog.angulartraining.com/custom-styling-in-angular-material-19-9d15846af0b0?source=rss----8725e60f0d54---4",
      "source": "Angular Training Blog",
      "author": "Alain Chautard",
      "published": "2025-04-03T02:10:35+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "abd52d19e2f733ed",
      "title": "Complex Angular forms with validation",
      "description": "Sometimes forms in Angular can be a pain, and some of us have been struggling with them since the beta phases of Angular2. First there was only the template driven forms approach, and then later on the Angular core team introduced Reactive forms. Both solutions still exist today, but the community sold Reactive forms as a best practice and they basically told us to stay away from template driven forms. The reasoning behind this was: Reactive forms are easier to unit-test. Less chance of 2-way da",
      "url": "https://blog.brecht.io/complex-angular-forms-with-validation/",
      "source": "Brecht Blog",
      "author": "brechtbilliet",
      "published": "2022-09-19T00:00:00+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "83c2dd9cadc2a93f",
      "title": "Conditional api urls in Angular with injection tokens",
      "description": "Using env.js files When we deploy our Angular application, chances are big that we will let our data-access layer connect to another api url than the one we connect to in development. This means that this api url should be configurable at some point. There are multiple ways of working with environment variables in Angular code-bases. I like to choose for a simple env.js file that can easily be replaced by the continuous integration (read this article). This way the env.js file is never really pa",
      "url": "https://blog.brecht.io/conditional-api-urls-in-angular-with-injection-tokens/",
      "source": "Brecht Blog",
      "author": "brechtbilliet",
      "published": "2022-09-08T00:00:00+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "514ba90f4953c2c7",
      "title": "Routed Angular dialogs",
      "description": "This article should be a rather short one. It’s about how we can create dialogs in Angular. Using dialogs in Angular can be tackled in complex ways but can be easy as well. When I started out with Angular I created this article. This is already 6 years ago at the time of writing this, and I believe there are better solutions now. Come to think of it… There already were.",
      "url": "https://blog.brecht.io/routed-angular-dialogs/",
      "source": "Brecht Blog",
      "author": "brechtbilliet",
      "published": "2022-08-31T00:00:00+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "0521292d3920889d",
      "title": "Angular interview questions for catching senior talent",
      "description": "Companies ask me to take care of technical interviews from time to time. Having done quite a lot of these interviews, I learned a lot from them. By helping out a lot of different clients, I also have been on the other side of the table more than a few times too. This means I have learned some patterns on how to create a positive impression towards my interviewer, and I know how to estimate the candidate as well. I don’t like to ask for technical assessments because I value the time of the candid",
      "url": "https://blog.brecht.io/angular-interview-questions-for-seniors/",
      "source": "Brecht Blog",
      "author": "brechtbilliet",
      "published": "2022-08-12T00:00:00+00:00",
      "niche": "angular",
      "score": 32,
      "keywords": []
    },
    {
      "id": "8b5c4b3269ed8b17",
      "title": "Angular - Custom MatPaginator Styling",
      "description": "One of my more popular articles that I’ve published is Angular: MatPaginator Custom Styling, which shows how to transform Angular Material’s paginator (on a mat-table) using a custom directive to make it look more appealing. I decided to update this article because since then, two major things have changed. It was originally written for Angular v14, and since then we’ve received the major Angular Material MDC components, which caused quite a few issues for people updating their projects, along w",
      "url": "https://dev.to/this-is-angular/angular-custom-matpaginator-styling-en6",
      "source": "This is Angular (Dev.to)",
      "author": "Eduard Krivanek",
      "published": "2025-11-24T17:04:37+00:00",
      "niche": "angular",
      "score": 27,
      "keywords": []
    },
    {
      "id": "43b5cde536112b76",
      "title": "Ng-News 25/45: Analog v2, Debouncing in SignalForms, Testing & Time",
      "description": "Analog.js 2.0 brings Angular even closer to the Vite ecosystem. And we also get debouncing in Signal Forms and fresh testing guidance from Andrew Scott. ⚙️ Analog.js 2.0 Analog.js was created by Brandon Roberts as a meta-framework for Angular and was released in version 2.0. A meta-framework extends a frontend framework with backend capabilities, like running data-fetching and processing on the server. It also brings convention-based routing that follows the filesystem, plus several higher-level",
      "url": "https://dev.to/this-is-angular/ng-news-2545-analog-v2-debouncing-in-signalforms-testing-time-3j77",
      "source": "This is Angular (Dev.to)",
      "author": "ng-news",
      "published": "2025-11-16T20:53:12+00:00",
      "niche": "angular",
      "score": 27,
      "keywords": []
    },
    {
      "id": "a5adc2c23e51a304",
      "title": "Recreating LinkedIn’s Crossclimb Game with Angular - Part 2",
      "description": "In the previous article we wrote the main component for our app: the Word component. Now, it's time to implement some game logic! The models Create a models/game.ts file which will store our models. First, we have a GameInfo interface: this is what could be eventually be store on a server (we won't have one, but we'll pretend that we do). It stores the 5 middle words, each with its own hint, the 2 edge words (top and bottom) and a common hint. /** What comes from the server */ export interface G",
      "url": "https://dev.to/this-is-angular/recreating-linkedins-crossclimb-game-with-angular-part-2-4a1n",
      "source": "This is Angular (Dev.to)",
      "author": "Michele Stieven",
      "published": "2025-11-13T00:29:30+00:00",
      "niche": "angular",
      "score": 27,
      "keywords": []
    },
    {
      "id": "5c6b88fb76ba8f5f",
      "title": "Ng-News 25/44: Resource Composition & Community Content",
      "description": "A new PR introduces Resource Composition — a major step toward creating derived resources cleanly and safely. Plus: new Signal Forms docs, rxResource insights, zoneless error handling, and performance talk. 🧩 Resource Composition An interesting PR popped up that introduces a feature called Resource Composition. If we have a resource and want to create a derived resource, we can technically do this via a computed. Given the following resource: type User = { id: number; firstname: string; lastname",
      "url": "https://dev.to/this-is-angular/ng-news-2544-resource-composition-community-content-52d9",
      "source": "This is Angular (Dev.to)",
      "author": "ng-news",
      "published": "2025-11-12T09:30:25+00:00",
      "niche": "angular",
      "score": 27,
      "keywords": []
    },
    {
      "id": "e59b3146f932d3f1",
      "title": "Recreating LinkedIn’s Crossclimb Game with Angular - Part 1",
      "description": "In this short series, we’ll use Angular to recreate the popular LinkedIn game Crossclimb, a fun word puzzle that’s perfect for showing off the power of Signals in modern Angular. This project is not only a great coding exercise, but also an enjoyable way to explore reactive state management using Signals. So, fire up your terminal, create a new Angular app, and let’s build together! 🚀 How the game works If you’ve never played Crossclimb before, here’s a quick rundown: The goal is to guess seven ",
      "url": "https://dev.to/this-is-angular/recreating-linkedins-crossclimb-game-with-angular-part-1-4cke",
      "source": "This is Angular (Dev.to)",
      "author": "Michele Stieven",
      "published": "2025-11-12T01:45:38+00:00",
      "niche": "angular",
      "score": 27,
      "keywords": []
    },
    {
      "id": "9c8ec47c47fbefaf",
      "title": "Angular Addicts #43: Vitest, Signal Forms, Animations & more",
      "description": "👋Hey fellow Angular Addict This is the 43rd issue of the Angular Addicts Newsletter, a monthly collection of carefully selected Angular resources that caught my attention. (Here are the 42nd, 41st and 40th) 💎Angular Gems of October, 2025 📰 Dynamic Forms: Building a Form Generator with Signal Forms By Manfred Steyer 📰 Angular v21 Goes Zoneless by Default: What Changes & Why It’s Faster By Enea Jahollari 📰 Angular's Testing Revolution: Vitest, Fake Timers & Testronaut By Rainer Hahnekamp 📰 Custom ",
      "url": "https://dev.to/this-is-angular/angular-addicts-43-vitest-signal-forms-animations-more-3lcd",
      "source": "This is Angular (Dev.to)",
      "author": "Gergely Szerovay",
      "published": "2025-11-11T07:34:56+00:00",
      "niche": "angular",
      "score": 27,
      "keywords": []
    },
    {
      "id": "98197b3636d4f4d0",
      "title": "Angular Authentication with Cookies in 10 minutes",
      "description": "Hi folks! Long time no see! In this short article, I’ll show you just how simple Cookie Authentication can be in Angular, all in five easy steps! Personally, I find Cookies to be the ideal choice for most applications. They keep the front-end clean and transparent, while leaving the heavy lifting where it belongs: on the server. That said, this isn’t always the best fit for every scenario. Depending on your needs, you might opt for a hybrid setup, a fully token-based approach (like JWTs), or eve",
      "url": "https://dev.to/this-is-angular/angular-authentication-with-cookies-in-10-minutes-41m8",
      "source": "This is Angular (Dev.to)",
      "author": "Michele Stieven",
      "published": "2025-11-04T03:27:18+00:00",
      "niche": "angular",
      "score": 27,
      "keywords": []
    },
    {
      "id": "df22aa891babff55",
      "title": "Is This the Future of E2E Testing? How AI Automates Browser Tests from Plain English Requirements",
      "description": "End-to-end testing has always been the gold standard for verifying that your application actually works the way users experience it. But let's be honest: writing and maintaining E2E tests is often a thankless job. Flaky selectors, timing issues, brittle test code that breaks with every UI change, the pain points are real and numerous. What if instead of writing test code, you could simply describe what you want to test in plain language, and have an AI assistant execute those tests for you, then",
      "url": "https://dev.to/this-is-angular/is-this-the-future-of-e2e-testing-how-ai-automates-browser-tests-from-plain-english-requirements-1d0",
      "source": "This is Angular (Dev.to)",
      "author": "Gergely Szerovay",
      "published": "2025-10-30T10:16:16+00:00",
      "niche": "angular",
      "score": 27,
      "keywords": []
    },
    {
      "id": "e42cb3b29a94dff9",
      "title": "Ng-News 25/43: Vitest - Angular's New Testing Framework",
      "description": "Angular 21 goes with Vitest. A clear decision after years of uncertainty - and new discussions emerge around content projection. ⚡️ Angular Chooses Vitest The decision about the future testing framework has finally been made: it’s going to be Vitest. Starting with Angular 21, Vitest becomes the default testing framework. So when you run ng new, Vitest will be selected by default – not Jasmine. The best thing about this decision is not Vitest itself. For more than two years, we didn’t really know",
      "url": "https://dev.to/this-is-angular/ng-news-2543-vitest-angulars-new-testing-framework-1d5a",
      "source": "This is Angular (Dev.to)",
      "author": "ng-news",
      "published": "2025-10-29T18:27:02+00:00",
      "niche": "angular",
      "score": 27,
      "keywords": []
    },
    {
      "id": "fd74cb437d82f542",
      "title": "Unit Testing Angular Components Made Simple",
      "description": "Photo by Christopher Gower on UnsplashContinue reading on Angular Training »",
      "url": "https://blog.angulartraining.com/unit-testing-angular-components-made-simple-012450ef8a81?source=rss----8725e60f0d54---4",
      "source": "Angular Training Blog",
      "author": "Mohammad Rajpura",
      "published": "2025-03-13T03:32:20+00:00",
      "niche": "angular",
      "score": 26,
      "keywords": []
    },
    {
      "id": "55012e9bd5ff944f",
      "title": "Simple Angular dialogs with the Angular CDK",
      "description": "The goal of this article",
      "url": "https://blog.brecht.io/simple-angular-dialogs-with-the-cdk/",
      "source": "Brecht Blog",
      "author": "brechtbilliet",
      "published": "2022-09-27T00:00:00+00:00",
      "niche": "angular",
      "score": 26,
      "keywords": []
    },
    {
      "id": "336bdbf60685ab3b",
      "title": "Reactive dumb components",
      "description": "Reactive dumb components",
      "url": "https://blog.brecht.io/reactive-dumb-components/",
      "source": "Brecht Blog",
      "author": "brechtbilliet",
      "published": "2021-05-17T00:00:00+00:00",
      "niche": "angular",
      "score": 26,
      "keywords": []
    },
    {
      "id": "18592af880cfe635",
      "title": "Managing state in Angular",
      "description": "About this article",
      "url": "https://blog.brecht.io/managing-state-in-angular/",
      "source": "Brecht Blog",
      "author": "brechtbilliet",
      "published": "2019-07-29T00:00:00+00:00",
      "niche": "angular",
      "score": 26,
      "keywords": []
    },
    {
      "id": "b1f9edfabebd29d2",
      "title": "Angular Authentication Guards",
      "description": "What are Authentication Guards? Authentication Guards are used to protect routes and control access based on user authentication status. They intercept route navigation request and ensures that only authorized users can access certain parts of an application. This feature is used for authentication, authorization and role based access control(RBAC). Implementing Authentication Guards:- CanActivate Guard determines [&#8230;] The post Angular Authentication Guards first appeared on TO THE NEW Blog",
      "url": "https://www.tothenew.com/blog/angular-authentication-guards/",
      "source": "TO THE NEW Angular",
      "author": "Jagriti",
      "published": "2024-04-29T09:57:18+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "c454929c882ff741",
      "title": "Enhancing JavaScript Coding with AI: Using Visual Studio Code",
      "description": "In the rapidly evolving software development landscape, technologies like Artificial Intelligence (AI) are revolutionizing traditional workflows, making them more efficient and productive. For JavaScript programmers, integrating AI tools into their preferred development environment, such as Visual Studio Code (VS Code), can significantly enhance the coding experience. In this blog post, we&#8217;ll explore how JavaScript developers [&#8230;] The post Enhancing JavaScript Coding with AI: Using Vi",
      "url": "https://www.tothenew.com/blog/enhancing-javascript-coding-with-ai-using-visual-studio-code/",
      "source": "TO THE NEW Angular",
      "author": "Mahendra Kumar Agrawal",
      "published": "2024-04-28T04:59:14+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "7b64d9cf478aafd5",
      "title": "Is Currying in JavaScript, A Chain of Functions?",
      "description": "In this article, we are going to discuss &#8220;Is Currying in JavaScript a Chain of Functions?&#8220;. Here, we will see how currying works like a chain of functions and how it will be useful for developers. We will also see the conversion of an existing function into the current version. Let&#8217;s start our topic, i.e., [&#8230;] The post Is Currying in JavaScript, A Chain of Functions? first appeared on TO THE NEW Blog.",
      "url": "https://www.tothenew.com/blog/is-currying-in-javascript-a-chain-of-functions/",
      "source": "TO THE NEW Angular",
      "author": "Akash Yadav",
      "published": "2024-04-18T05:18:21+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "3adb3628f5885e7b",
      "title": "When to use Promises and Observables in Angular",
      "description": "One of the most confusing scenarios is whether I should use a promise or an observable. &#160; Have you ever worked with both Promises and Observable? Or maybe you’ve heard of them but don’t know which one to use at what time? To avoid this confusion, we need to understand their differences to pick the [&#8230;] The post When to use Promises and Observables in Angular first appeared on TO THE NEW Blog.",
      "url": "https://www.tothenew.com/blog/when-to-use-promises-and-observables-in-angular/",
      "source": "TO THE NEW Angular",
      "author": "Guddu Kumar",
      "published": "2024-04-16T06:27:23+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "d3f328cc9a205b7e",
      "title": "JavaScript Frameworks: Choosing the Right One for Your Projects",
      "description": "Choosing the right JavaScript framework or library for your web development projects can be crucial. React, Angular, and Vue.js are three of the most popular choices in this domain, each with its own strengths and use cases. Let&#8217;s delve into a comparison of React, Angular, and Vue.js to help you understand their differences and make [&#8230;] The post JavaScript Frameworks: Choosing the Right One for Your Projects first appeared on TO THE NEW Blog.",
      "url": "https://www.tothenew.com/blog/javascript-frameworks-choosing-the-right-one-for-your-projects/",
      "source": "TO THE NEW Angular",
      "author": "Mahendra Kumar Agrawal",
      "published": "2024-04-16T05:46:59+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "176eb80db2f4c6c2",
      "title": "JavaScript Programming using ChatGPT",
      "description": "JavaScript programming takes a lot of development time because it&#8217;s always changing, and its unique features make learning and managing code a challenge. But ChatGPT can help you become more productive. Here are the different ways to use ChatGPT for JavaScript development. 1. Understand the given code. Due to the changing nature of JavaScript, it [&#8230;] The post JavaScript Programming using ChatGPT first appeared on TO THE NEW Blog.",
      "url": "https://www.tothenew.com/blog/javascript-programming-using-chatgpt/",
      "source": "TO THE NEW Angular",
      "author": "Mahendra Kumar Agrawal",
      "published": "2024-03-24T13:12:41+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "fd75ec8ed032c481",
      "title": "Node Version Using .nvmrc",
      "description": "Introduction When we are working with multiple Node.js and React.js projects, managing different Node versions will be very challenging. There is a tool that is simple and powerful that saves us from version-related problems which is the .nvmrc file. This tool ensures that every React.js and node.js project uses the right node version. Here we [&#8230;] The post Node Version Using .nvmrc first appeared on TO THE NEW Blog.",
      "url": "https://www.tothenew.com/blog/node-version-using-nvmrc/",
      "source": "TO THE NEW Angular",
      "author": "Najmuddin Kaishar",
      "published": "2024-03-06T04:00:08+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "c156972268ba45d1",
      "title": "Concept of Angular FormArray",
      "description": "In the world of web development, creating forms is a common task. Forms allow users to interact with a website by inputting data, submitting requests, and more. Angular, a popular JavaScript framework, provides a robust solution for building dynamic forms with the FormArray feature. FormArray allows developers to handle dynamic form controls seamlessly, catering to scenarios [&#8230;] The post Concept of Angular FormArray first appeared on TO THE NEW Blog.",
      "url": "https://www.tothenew.com/blog/concept-of-angular-formarray/",
      "source": "TO THE NEW Angular",
      "author": "Mahendra Kumar Agrawal",
      "published": "2024-02-28T13:01:53+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "09d3f50c96430113",
      "title": "Exploring Angular 17: Unlocking Performance with Deferrable Views",
      "description": "In the fast-paced world of web development, delivering seamless user experiences and lightning-fast performance is paramount. Enter @defer, a hidden gem in Angular’s arsenal that empowers you to achieve both with its on-demand loading magic. Imagine a feature-rich application brimming with functionality. Each component adds value, but some might not be relevant to every user [&#8230;] The post Exploring Angular 17: Unlocking Performance with Deferrable Views first appeared on TO THE NEW Blog.",
      "url": "https://www.tothenew.com/blog/exploring-angular-17-unlocking-performance-with-deferrable-views/",
      "source": "TO THE NEW Angular",
      "author": "Kashif Ali Khan",
      "published": "2024-02-27T13:00:43+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "219aadb414e6e1fd",
      "title": "Unleashing the Power of Standalone Components in Angular",
      "description": "A standalone component in Angular is a new way to define and organize components in Angular applications. It breaks away from the traditional approach of using NgModules and offers several advantages in terms of simplicity, maintainability, and performance. What is a standalone component? An independent, self-contained unit of code that encapsulates logic, data, and UI [&#8230;] The post Unleashing the Power of Standalone Components in Angular first appeared on TO THE NEW Blog.",
      "url": "https://www.tothenew.com/blog/unleashing-the-power-of-standalone-components-in-angular/",
      "source": "TO THE NEW Angular",
      "author": "Kashif Ali Khan",
      "published": "2024-01-13T08:32:54+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "7807125e51c88e29",
      "title": "An AI Assistant for your Angular Application: Tool Calling in the Frontend with Hashbrown",
      "description": "AI-based assistants improve the user experience and reduce support costs. However, their implementation involves a lot of repetitive technical tasks, such as connecting to different LLMs or implementing tool calling. Hashbrown takes this work off our hands. The open-source project, supported by two well-known experts in the Angular community, supports all relevant model providers, including [&#8230;] The post An AI Assistant for your Angular Application: Tool Calling in the Frontend with Hashbro",
      "url": "https://www.angulararchitects.io/blog/an-ai-assistant-for-your-angular-application-tool-calling-in-the-frontend-with-hashbrown/",
      "source": "Angular Architects",
      "author": "Manfred Steyer",
      "published": "2025-11-22T16:17:57+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "042e4899bcdf4e8a",
      "title": "Dynamic Forms: Building a Form Generator with Signal Forms",
      "description": "Dies ist Beitrag 2 von 2 der Serie “Signal Forms” All About Angular&#8217;s New Signal Forms Dynamic Forms: Building a Form Generator with Signal Forms Dynamic Forms built by a form generator have quite a history in Angular. Such form generators enable us to build a form at runtime using metadata, such as field names [&#8230;] The post Dynamic Forms: Building a Form Generator with Signal Forms appeared first on ANGULARarchitects.",
      "url": "https://www.angulararchitects.io/blog/dynamic-forms-building-a-form-generator-with-signal-forms/",
      "source": "Angular Architects",
      "author": "Manfred Steyer",
      "published": "2025-10-05T17:23:52+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "7c2d9c4c6732de19",
      "title": "Investigating Code Quality: Crime Scene++",
      "description": "Code analysis is more complex than ever. We could argue this is due to the advent of tools like Claude Code, Cursor, and their peers. That makes it even more important to grasp a codebase quickly. To help with that, I’ve added new tools and metrics to Detective to surface anti-patterns and identify hotspots faster. [&#8230;] The post Investigating Code Quality: Crime Scene++ appeared first on ANGULARarchitects.",
      "url": "https://www.angulararchitects.io/blog/crime-scene/",
      "source": "Angular Architects",
      "author": "Murat Sari",
      "published": "2025-09-30T09:29:00+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "cff97623f663f023",
      "title": "All About Angular’s New Signal Forms",
      "description": "Dies ist Beitrag 1 von 1 der Serie “Signal Forms” All About Angular&#8217;s New Signal Forms Dynamic Forms: Building a Form Generator with Signal Forms The long-awaited Signal Forms bridge a crucial gap between Angular's new reactive side and user interaction. While currently experimental and intended to gather initial feedback, they offer a window into [&#8230;] The post All About Angular&#8217;s New Signal Forms appeared first on ANGULARarchitects.",
      "url": "https://www.angulararchitects.io/blog/all-about-angulars-new-signal-forms/",
      "source": "Angular Architects",
      "author": "Manfred Steyer",
      "published": "2025-09-22T20:41:49+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "568ae21744f07d56",
      "title": "Full-Cycle Reactivity in Angular: Signal Forms, Signal Store, Resources, & Mutation API",
      "description": "Dies ist Beitrag 7 von 7 der Serie “NGRX Signal Store” The new NGRX Signal Store for Angular: 3 + 1 Flavors Smarter, Not Harder: Simplifying your Application With NGRX Signal Store and Custom Features NGRX Signal Store Deep Dive: Flexible and Type-Safe Custom Extensions The NGRX Signal Store and Your Architecture Using Angular&#8217;s Resource [&#8230;] The post Full-Cycle Reactivity in Angular: Signal Forms, Signal Store, Resources, &#038; Mutation API appeared first on ANGULARarchitects.",
      "url": "https://www.angulararchitects.io/blog/full-cycle-reativity-in-angular-signal-forms-signal-store-resources-mutation-api/",
      "source": "Angular Architects",
      "author": "Manfred Steyer",
      "published": "2025-09-08T18:57:38+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "93f7081ae1bd3d3f",
      "title": "Cross-Repo Conformance with Nx Polygraph",
      "description": "While tech giants like Google and Facebook rely on monorepos, the reality for many companies is different: Business software is often developed in multiple project- or product-related repos. The relatively new Nx Polygraph takes this into account by visualizing dependencies between repos and enforcing common policies. In this article, I'll provide an overview of Polygraph [&#8230;] The post Cross-Repo Conformance with Nx Polygraph appeared first on ANGULARarchitects.",
      "url": "https://www.angulararchitects.io/blog/cross-repo-conformance-with-nx-polygraph/",
      "source": "Angular Architects",
      "author": "Manfred Steyer",
      "published": "2025-08-10T21:57:51+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "7e5fe2204781b697",
      "title": "Interview: How AI Is Transforming Angular Development (Transcript)",
      "description": "Recently, I interviewed Daniel Sogl, who specializes in AI for software developers and has spoken about this very topic at various conferences. We discussed how our work will be influenced by AI in the short, mid, and long term: What tools are currently in your AI toolbox? The front-runner is clearly GitHub Copilot – mainly [&#8230;] The post Interview: How AI Is Transforming Angular Development (Transcript) appeared first on ANGULARarchitects.",
      "url": "https://www.angulararchitects.io/blog/interview-how-ai-is-transforming-angular-development-a-conversation-with-daniel/",
      "source": "Angular Architects",
      "author": "Manfred Steyer",
      "published": "2025-08-06T21:07:28+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "3d0a5db3a4d2a886",
      "title": "Native Federation Just Got Better: Performance, DX, and Simplicity",
      "description": "Dies ist Beitrag 6 von 6 der Serie “Micro Frontends with Modern Angular” Micro Frontends with Modern Angular &#8211; Part 1: Standalone and esbuild Micro Frontends with Modern Angular &#8211; Part 2: Multi-Version and Multi-Framework Solutions with Angular Elements and Web Components Combining Native Federation and Module Federation SSR and Hydration with Native Federation for [&#8230;] The post Native Federation Just Got Better: Performance, DX, and Simplicity appeared first on ANGULARarchitect",
      "url": "https://www.angulararchitects.io/blog/native-federation-just-got-better-performance-dx-and-simplicity/",
      "source": "Angular Architects",
      "author": "Manfred Steyer",
      "published": "2025-07-15T11:40:00+00:00",
      "niche": "angular",
      "score": 21,
      "keywords": []
    },
    {
      "id": "11b2507337b7c890",
      "title": "Breaking out of the comfort zone",
      "description": "The people that are used to read my articles will quickly realise that this is not the type of articles I generally write. Since I’m passionate about this subject, I’m going to write about it anyway. Bear with me, you might take away something from it. If not, at least you gave it a shot, right? I’m writing a book as we speak about my life and career as a software professional, not sure if I’ll ever publish it, but consider this a very slimmed down version of some chapters of that book.",
      "url": "https://blog.brecht.io/breaking-out-of-the-comfort-zone/",
      "source": "Brecht Blog",
      "author": "brechtbilliet",
      "published": "2022-09-09T00:00:00+00:00",
      "niche": "angular",
      "score": 14,
      "keywords": []
    },
    {
      "id": "0108627ce36cf6ab",
      "title": "Why and how I created a SPA router for Qwik",
      "description": "The why",
      "url": "https://blog.brecht.io/why-and-how-i-created-a-spa-router-for-qwik/",
      "source": "Brecht Blog",
      "author": "brechtbilliet",
      "published": "2022-08-03T00:00:00+00:00",
      "niche": "angular",
      "score": 8,
      "keywords": []
    },
    {
      "id": "54652111b81ef13f",
      "title": "How covid affected StrongBrew",
      "description": "Covid",
      "url": "https://blog.brecht.io/how-covid-affected-strongbrew/",
      "source": "Brecht Blog",
      "author": "brechtbilliet",
      "published": "2020-11-03T00:00:00+00:00",
      "niche": "angular",
      "score": 8,
      "keywords": []
    }
  ]
}