{
  "last_updated": "2025-11-25T02:04:04.608913+00:00",
  "total_articles": 194,
  "articles": [
    {
      "id": "d8205bbbe027bc08",
      "title": "Spring AI: Mapping LLM Responses to Java Objects",
      "description": "The post Spring AI: Mapping LLM Responses to Java Objects appeared first on Thorben Janssen. Working with large language models often starts simple. You send a question and get a text response. That works fine if you show the answer to a user, but it becomes a problem when you want to process it in your business logic. Plain text is unstructured. Parsing it is an error-prone task, especially when... The post Spring AI: Mapping LLM Responses to Java Objects appeared first on Thorben Janssen.",
      "url": "https://thorben-janssen.com/spring-ai-mapping-llm-responses/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2025-11-19T09:42:05+00:00",
      "niche": "spring",
      "score": 68,
      "keywords": []
    },
    {
      "id": "86a740f98d3c0106",
      "title": "Arconia for Spring Boot Dev Services and Observability",
      "description": "This article explains how to use the Arconia framework to enhance the developer experience with Spring Boot. This project is a recent initiative under active development. However, it caught my attention because of one feature I love in Quarkus and found missing in Spring Boot. I am referring to a solution called Dev Services, which [&#8230;] The post Arconia for Spring Boot Dev Services and Observability appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/11/21/arconia-for-spring-boot-dev-services-and-observability/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-11-21T09:32:46+00:00",
      "niche": "spring",
      "score": 68,
      "keywords": []
    },
    {
      "id": "1b96f13326939ffa",
      "title": "Spring REST Docs 4.0.0",
      "description": "On behalf of the team and everyone who has contributed, I'm happy to announce that Spring REST Docs 4.0.0 has been released and is now available from Maven Central. Please see the release notes for more details and upgrade instructions. Thanks to all those who have contributed with issue reports and pull requests. What's new in 4.0 The highlights of the 4.0 release include: Upgrade to Spring Framework 7 Upgrade to Jackson 3 Comprehensive null safety through JSpecify Antora-based reference docume",
      "url": "https://spring.io/blog/2025/11/19/spring-restdocs-4",
      "source": "Spring Blog (Official)",
      "author": "wilkinsona",
      "published": "2025-11-19T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "ba83557fb8270967",
      "title": "Spring Batch 6.0.0 GA is out!",
      "description": "Dear Spring Batch community, On behalf of the team and everyone who has contributed, I am pleased to announce the release of Spring Batch 6.0.0 GA! Spring Batch 6.0 is a major release that builds upon the foundations in Spring Framework 7.0, and will be available through Spring Boot 4.0 to provide a robust and efficient batch processing framework. This general availability release includes all the features and improvements introduced in the previous release candidates, along with additional enha",
      "url": "https://spring.io/blog/2025/11/19/spring-batch-6-0-0-ga",
      "source": "Spring Blog (Official)",
      "author": "fmbenhassine",
      "published": "2025-11-19T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "19ff63a54b17f2e8",
      "title": "Spring AMQP 4.0.0 Available",
      "description": "On behalf of the team and everyone who contributed, I am pleased to announce the General Availability for 4.0.0 of Spring AMQP. Some notable feature and changes in this new generation: The spring-rabbitmq-client module for AMQP 1.0 protocol with RabbitMQ; Jackson 3 Support; Nullability via JSpecify; Migration to Spring Core Retry. See the Release Notes and What's New for more information. Cheers, Artem Project Page | GitHub Issues | Contributing | Help",
      "url": "https://spring.io/blog/2025/11/19/spring-amqp-4-0-0-available",
      "source": "Spring Blog (Official)",
      "author": "artembilan",
      "published": "2025-11-19T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "7e1f6d331b751ea3",
      "title": "Spring Integration 7.0.0 Available",
      "description": "On behalf of the team and everyone who contributed, I am pleased to announce the General Availability of the Spring Integration 7.0.0 generation. In addition, the 6.5.4 and 6.4.9 versions with bug fixes and dependency upgrades have been released. Some notable changes in 7.0.0: Nullability via JSpecify; Jackson 3 Support; Migration to Spring Core Retry; Channel Adapters for AMQP 1.0 based on Spring AMQP 4.0; The directory to scan in the FileReadingMessageSource can now be configured as an express",
      "url": "https://spring.io/blog/2025/11/19/spring-integration-7-0-0-released",
      "source": "Spring Blog (Official)",
      "author": "artembilan",
      "published": "2025-11-19T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "02282506f8fca996",
      "title": "Spring Boot 3.4.12 available now",
      "description": "On behalf of the team and everyone who has contributed, I'm happy to announce that Spring Boot 3.4.12 has been released and is now available from Maven Central. This release includes 45 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests. How can you help? If you're interested in helping out, check out the \"ideal for contribution\" tag in the issue repository. If you have general questions, please ask on sta",
      "url": "https://spring.io/blog/2025/11/20/spring-boot-3-4-12-available-now",
      "source": "Spring Blog (Official)",
      "author": "mhalbritter",
      "published": "2025-11-20T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "96249a0ed353a548",
      "title": "Spring Framework 6.2.14 Available Now",
      "description": "On behalf of the team and everyone who has contributed, I am pleased to announce that Spring Framework 6.2.14 is available now. Spring Framework 6.2.14 ships with 9 fixes and documentation improvements. This version will be shipped today with Spring Boot 3.4.12 and 3.5.8. Project Page | GitHub | Issues | Documentation",
      "url": "https://spring.io/blog/2025/11/20/spring-framework-6-2-14-available-now",
      "source": "Spring Blog (Official)",
      "author": "bclozel",
      "published": "2025-11-20T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "34eaf1b7a46dd297",
      "title": "Spring Framework 7.0.1 Available Now",
      "description": "On behalf of the team and everyone who has contributed, I am pleased to announce that Spring Framework 7.0.1 is available now. Spring Framework 7.0.1 ships with 15 fixes and documentation improvements. This version will be shipped today with Spring Boot 4.0.0. Project Page | GitHub | Issues | Documentation",
      "url": "https://spring.io/blog/2025/11/20/spring-framework-7-0-1-available-now",
      "source": "Spring Blog (Official)",
      "author": "bclozel",
      "published": "2025-11-20T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "1da1b3bc64dc2b5d",
      "title": "Spring Boot 3.5.8 available now",
      "description": "On behalf of the team and everyone who has contributed, I'm happy to announce that Spring Boot 3.5.8 has been released and is now available from Maven Central. This release includes 57 bug fixes, documentation improvements, and dependency upgrades. Thanks to all those who have contributed with issue reports and pull requests. How can you help? If you're interested in helping out, check out the \"ideal for contribution\" tag in the issue repository. If you have general questions, please ask on stac",
      "url": "https://spring.io/blog/2025/11/20/spring-boot-3-5-8-available-now",
      "source": "Spring Blog (Official)",
      "author": "wilkinsona",
      "published": "2025-11-20T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "64943a387114a851",
      "title": "A Bootiful Podcast: The legendary Sébastien Deleuze on all that's new and nice in Spring Framework 7",
      "description": "Hi, Spring fans! Happy Spring Boot 4.0 release day! Make sure to get the bits on the Spring Initializr (you know - start.spring.io)! This release is packed with new features, a lot of which comes from Spring Framework 7. To help break it down for us this week, we’re joined by none other than the legendary Spring Framework contributor Sébastien Deleuze!",
      "url": "https://spring.io/blog/2025/11/20/a-bootiful-podcast-sebastien-deleuze",
      "source": "Spring Blog (Official)",
      "author": "joshlong",
      "published": "2025-11-20T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "f342502e1abaf104",
      "title": "Spring Boot 4.0.0 available now",
      "description": "On behalf of the team and everyone who has contributed, I'm extremely happy to announce that Spring Boot 4.0.0 has been released and is now available from Maven Central. This release is the beginning of a new Spring Boot generation providing solid foundations for coming years. Building on top of Spring Framework 7, there are a number of exciting new features in this release, including: A complete modularization of the Spring Boot codebase providing smaller and more focused jars. Portfolio-wide i",
      "url": "https://spring.io/blog/2025/11/20/spring-boot-4-0-0-available-now",
      "source": "Spring Blog (Official)",
      "author": "philwebb",
      "published": "2025-11-20T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "40da85011444ea7d",
      "title": "Spring Modulith 2.0 GA, 1.4.5, and 1.3.11 released",
      "description": "On behalf of the communit I am happy to announce the availablity of Spring Modulith 2.0. The release is an important milestone incorporating all learnings we've made in Spring Modulith's first generation. We ship the following major features: Overhaul event publication lifecycle #796 (Neo4j #1337, MongoDB #1336, JDBC #1321, JPA #1375, #1389) Support for application-module-specific Flyway migrations #1067, #1440 Allow serialized execution of event externalization #1370 Support for Jackson 3 in ev",
      "url": "https://spring.io/blog/2025/11/21/spring-modulith-2-0-ga-1-4-5-and-1-3-11-released",
      "source": "Spring Blog (Official)",
      "author": "odrotbohm",
      "published": "2025-11-21T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "abde2065301f9ce0",
      "title": "Towards Spring Tools 5 - Ready for Boot 4 and Framework 7",
      "description": "In the light of the new major releases of the Spring Framework and Spring Boot, the next major release of the Spring Tools is also around the corner. The GA is scheduled for December 10th and RCs will start to show up from now onwards. Support for what is new in Spring Spring Tools 5 contains support for various new features of Spring Framework 7 and Spring Boot 4, ranging from extensive support for the new API versioning feature, support for functional bean definitions via the new bean registra",
      "url": "https://spring.io/blog/2025/11/24/towards-spring-tools-5-part1",
      "source": "Spring Blog (Official)",
      "author": "martinlippert",
      "published": "2025-11-24T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "7776d22cc97d9a37",
      "title": "How to Bind Custom Validation Message in Spring",
      "description": "Validation is an essential aspect of any application that handles user input. Spring Boot provides a validation framework that integrates seamlessly with Jakarta Bean Validation (JSR-380) and Hibernate Validator. While Spring Boot provides default error messages, customising them allows us to create user-friendly, context-specific feedback. In this article, we explore how to bind custom validation &#8230;",
      "url": "https://www.javacodegeeks.com/how-to-bind-custom-validation-message-in-spring.html",
      "source": "Java Code Geeks",
      "author": "Omozegie Aziegbe",
      "published": "2025-11-19T10:16:52+00:00",
      "niche": "spring",
      "score": 57,
      "keywords": []
    },
    {
      "id": "51b89dc82f2e2a2a",
      "title": "Spring Boot 4: Leaner, Safer Apps and a New Kotlin Baseline",
      "description": "Spring Boot 4.0 has officially landed. At JetBrains, we’ve been tracking the updates since the first milestones to ensure that IntelliJ IDEA delivers a smooth and reliable development experience. While many of the core capabilities come directly from Spring Framework 7, Spring Boot remains the adoption enabler that brings everything together: sensible defaults, consistent configuration, [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/11/spring-boot-4/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Andrey Belyaev",
      "published": "2025-11-20T20:11:35+00:00",
      "niche": "spring",
      "score": 57,
      "keywords": []
    },
    {
      "id": "49e40610caadd5d4",
      "title": "Spring Framework 7 and Spring Boot 4 Deliver API Versioning, Resilience, and Null-Safe Annotations",
      "description": "Broadcom released Spring Framework 7.0 and Spring Boot 4.0, introducing first-class REST API versioning, JSpecify annotations for standardized null safety across the Spring portfolio, built-in resilience features such as retry and concurrency throttling, Jackson 3 for JSON processing, and modular autoconfiguration. The baselines are JDK 17 (while embracing JDK 25), Jakarta EE 11, and Kotlin 2.2. By Karsten Silz",
      "url": "https://www.infoq.com/news/2025/11/spring-7-spring-boot-4/?utm_campaign=infoq_content&utm_source=infoq&utm_medium=feed&utm_term=Java",
      "source": "InfoQ Java",
      "author": "Karsten Silz",
      "published": "2025-11-21T05:00:00+00:00",
      "niche": "spring",
      "score": 57,
      "keywords": []
    },
    {
      "id": "f62b9617b9e2e0f0",
      "title": "Understanding Configuration Order in Spring Boot",
      "description": "Spring Boot simplifies application setup by providing a structured and opinionated configuration model. As applications evolve across different environments, it becomes important to understand how Spring Boot decides which configuration value should take precedence. Multiple configuration sources may define the same property, but Spring Boot resolves these conflicts through a predefined ordering strategy. This article &#8230;",
      "url": "https://www.javacodegeeks.com/understanding-configuration-order-in-spring-boot.html",
      "source": "Java Code Geeks",
      "author": "Omozegie Aziegbe",
      "published": "2025-11-21T11:24:36+00:00",
      "niche": "spring",
      "score": 57,
      "keywords": []
    },
    {
      "id": "be0d00f75393915f",
      "title": "You can now get Microsoft Office plus Windows 11 Pro for life for only $40",
      "description": "TL;DR: Right now, you can get Microsoft Office and Windows 11 Pro for life for only $40 (reg. $418.99). This year, Microsoft raised the price for Microsoft 365 and ended support for Windows 10, but there&#8217;s a way out of your subscription, and upgrading your operating system just got a lot cheaper. The Ultimate Microsoft Bundle &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/you-can-now-get-microsoft-office-plus-windows-11-pro-for-life-for-only-40.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2025-11-22T11:30:30+00:00",
      "niche": "spring",
      "score": 57,
      "keywords": []
    },
    {
      "id": "6d0f2722fde043ce",
      "title": "Spring News Roundup: GA Releases of Boot, Security, GraphQL, Integration, Modulith, Batch",
      "description": "Following the much anticipated release of Spring Framework 7.0, there was a flurry of activity in the Spring ecosystem during the week of November 17th, 2025, highlighting additional GA releases of Spring Boot, Spring Security, Spring for GraphQL, Spring Integration, Spring Modulith, Spring REST Docs and Spring Batch. By Michael Redlich",
      "url": "https://www.infoq.com/news/2025/11/spring-news-roundup-nov17-2025/?utm_campaign=infoq_content&utm_source=infoq&utm_medium=feed&utm_term=Java",
      "source": "InfoQ Java",
      "author": "Michael Redlich",
      "published": "2025-11-24T02:30:00+00:00",
      "niche": "spring",
      "score": 57,
      "keywords": []
    },
    {
      "id": "a94479215c940d0e",
      "title": "Designing Intelligent Agents with Spring AI",
      "description": "Spring AI is a powerful framework that seamlessly integrates AI capabilities into Spring Boot applications. It abstracts complex AI workflows and enables developers to design intelligent agents capable of reasoning, task automation, workflow orchestration, and parallelization. Its modular architecture makes it suitable for building Chain, Routing, Orchestrator, and Evaluator-Optimizer agents. Let us explore how building &#8230;",
      "url": "https://www.javacodegeeks.com/designing-intelligent-agents-with-spring-ai.html",
      "source": "Java Code Geeks",
      "author": "Yatin Batra",
      "published": "2025-11-24T16:09:00+00:00",
      "niche": "spring",
      "score": 57,
      "keywords": []
    },
    {
      "id": "5b2dfd00ae0d550c",
      "title": "Creating an MCP Client With Spring AI",
      "description": "MCP servers extend the functionality of a large language model (LLM). Inference engines allow you to define the MCP servers, but often you will need to write an MCP client yourself. In this blog, you will learn how to do so using Spring AI. Enjoy! Introduction In a previous post, you learnt how to create an MCP server using Spring Boot and Spring AI. The MCP server provides four tools:",
      "url": "https://feeds.dzone.com/link/18931/17216039/creating-an-mcp-client-with-spring-ai",
      "source": "DZone Microservices",
      "author": "Gunter Rotsaert",
      "published": "2025-11-24T17:30:00+00:00",
      "niche": "spring",
      "score": 57,
      "keywords": []
    },
    {
      "id": "277685f495e18be4",
      "title": "Building a Retrieval-Augmented Generation (RAG) System in Java With Spring AI, Vertex AI, and BigQuery",
      "description": "Retrieval-augmented generation (RAG) is quickly becoming one of the most powerful design patterns for AI applications. It bridges the gap between general-purpose large language models (LLMs) and your specific enterprise data. In this article, we’ll walk through how to build a complete RAG pipeline in Java using Spring Boot, Vertex AI’s Gemini embeddings, Apache PDFBox, and BigQuery Vector Search. You will see how to do the following, wrapped in a Spring Boot app with a simple web UI:",
      "url": "https://feeds.dzone.com/link/18931/17216081/rag-system-java-spring-ai-vertex-bigquery",
      "source": "DZone Microservices",
      "author": "Mohammed Fazalullah Qudrath",
      "published": "2025-11-24T18:30:00+00:00",
      "niche": "spring",
      "score": 57,
      "keywords": []
    },
    {
      "id": "2910866997010ebb",
      "title": "Resolving JUnit Error: Test Class Should Have Exactly One Public Zero-Argument Constructor",
      "description": "Understand the JUnit error: Test class should have exactly one public zero-argument constructor. The post Resolving JUnit Error: Test Class Should Have Exactly One Public Zero-Argument Constructor first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/928056185/0/baeldung~Resolving-JUnit-Error-Test-Class-Should-Have-Exactly-One-Public-ZeroArgument-Constructor",
      "source": "Baeldung",
      "author": "Samuel Njoki",
      "published": "2025-11-18T07:39:58+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "5860fcb773f98d46",
      "title": "Select a Random Key from a HashMap in Java",
      "description": "Learn several methods for accessing random elements from a HashMap in Java and their advantages and disadvantages. The post Select a Random Key from a HashMap in Java first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/928056188/0/baeldung~Select-a-Random-Key-from-a-HashMap-in-Java",
      "source": "Baeldung",
      "author": "Eugene Kovko",
      "published": "2025-11-18T07:34:48+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "e9e51b7b8efde1a6",
      "title": "Quarkus with Buildpacks and OpenShift Builds",
      "description": "In this article, you will learn how to build Quarkus application images using Cloud Native Buildpacks and OpenShift Builds. Some time ago, I published a blog post about building with OpenShift Builds based on the Shipwright project. At that time, Cloud Native Buildpacks were not supported at the OpenShift Builds level. It was only supported [&#8230;] The post Quarkus with Buildpacks and OpenShift Builds appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/11/19/quarkus-with-buildpacks-and-openshift-builds/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-11-19T08:50:04+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "dbbbb3e255cf5ab0",
      "title": "Converting Blob to String and String to Blob in Java",
      "description": "Learn how to convert between Blob and String in Java when dealing with persistence of binary large objects in relational databases. The post Converting Blob to String and String to Blob in Java first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/928247720/0/baeldung~Converting-Blob-to-String-and-String-to-Blob-in-Java",
      "source": "Baeldung",
      "author": "Deepak Vohra",
      "published": "2025-11-20T00:44:56+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "be7ab581a4162042",
      "title": "Retrying RestTemplate HTTP Requests in Java When the Host Is Offline",
      "description": "Explore multiple approaches to retry RestTemplate HTTP requests when the host is offline. The post Retrying RestTemplate HTTP Requests in Java When the Host Is Offline first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/928247723/0/baeldung~Retrying-RestTemplate-HTTP-Requests-in-Java-When-the-Host-Is-Offline",
      "source": "Baeldung",
      "author": "Sagar Verma",
      "published": "2025-11-20T00:39:51+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "f27625d5310bbbd9",
      "title": "Configuring Testcontainers to Work with Podman",
      "description": "Explore a clear path to adopting Podman with Testcontainers in your Java projects while avoiding the common pitfalls many developers encounter. The post Configuring Testcontainers to Work with Podman first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/928247729/0/baeldung~Configuring-Testcontainers-to-Work-with-Podman",
      "source": "Baeldung",
      "author": "Thiago dos Santos Hora",
      "published": "2025-11-20T00:36:08+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "6c190537bc7d958d",
      "title": "SecureRandom Generator on Linux – Blocking or Not Blocking?",
      "description": "Learn how the SecureRandom algorithms use the randomness sources of the Linux operating system. The post SecureRandom Generator on Linux – Blocking or Not Blocking? first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/928396763/0/baeldung~SecureRandom-Generator-on-Linux-Blocking-or-Not-Blocking",
      "source": "Baeldung",
      "author": "Marcin Buczkowski",
      "published": "2025-11-20T15:36:09+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "c5e74504806ec6c5",
      "title": "Find Out What Keystore the JVM Is Using",
      "description": "Explore three alternative approaches to figure out which keystore the JVM is using. The post Find Out What Keystore the JVM Is Using first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/928546622/0/baeldung~Find-Out-What-Keystore-the-JVM-Is-Using",
      "source": "Baeldung",
      "author": "John Caleb",
      "published": "2025-11-21T03:12:29+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "9a6ea043ceb40602",
      "title": "Introduction to the Chicory Native JVM WebAssembly Runtime",
      "description": "Learn about Chicory by understanding type mapping, setting up a simple project on the JVM, compiling a basic WebAssembly module, and troubleshooting. The post Introduction to the Chicory Native JVM WebAssembly Runtime first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/928546625/0/baeldung~Introduction-to-the-Chicory-Native-JVM-WebAssembly-Runtime",
      "source": "Baeldung",
      "author": "Francesco Galgani",
      "published": "2025-11-21T03:09:05+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "32e9382ba43ef9c4",
      "title": "Book Review – Just Use Postgres!",
      "description": "Introduction My friend, Denis Magda, wrote a wonderful book called Just Use Postgres!, and I&#8217;m glad that I got the chance to read it. Audience This book is useful for any software developer who&#8217;s either using PostgreSQL or plans on using it because it covers a lot of features that are very useful for modern applications. No matter your level of seniority, you are definitely going to learn from Denis&#8217; book. Content Just Use Postgres! has 402 pages, 3 parts, and 11 chapters. The ",
      "url": "https://vladmihalcea.com/book-review-just-use-postgres/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-11-24T09:00:34+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "d2aacff00db8c65a",
      "title": "MCP with Quarkus LangChain4j",
      "description": "This article shows how to use Quarkus LangChain4j support for MCP (Model Context Protocol) on both the server and client sides. You will learn how to serve tools and prompts on the server side and discover them in the Quarkus MCP client-side application. The Model Context Protocol is a standard for managing contextual interactions with [&#8230;] The post MCP with Quarkus LangChain4j appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/11/24/mcp-with-quarkus-langchain4j/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-11-24T07:45:15+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "2ba78b00d132760f",
      "title": "How to Make IntelliJ IDEA Insert a New Line at Every End of File",
      "description": "Learn how to manage newlines in IntelliJ IDEA to keep code clean and consistent. The post How to Make IntelliJ IDEA Insert a New Line at Every End of File first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/929134124/0/baeldung~How-to-Make-IntelliJ-IDEA-Insert-a-New-Line-at-Every-End-of-File",
      "source": "Baeldung",
      "author": "Anees Asghar",
      "published": "2025-11-24T15:46:54+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "74a183ce3dddd34d",
      "title": "Running Tomcat Server on Two Different Ports",
      "description": "Explore different approaches to running a Tomcat server on other ports. The post Running Tomcat Server on Two Different Ports first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/928056575/0/baeldung~Running-Tomcat-Server-on-Two-Different-Ports",
      "source": "Baeldung",
      "author": "Rajat Garg",
      "published": "2025-11-18T07:43:31+00:00",
      "niche": "spring",
      "score": 46,
      "keywords": []
    },
    {
      "id": "3a2cd7eb753b87de",
      "title": "How to Set a Specific Bit of a Number in Java",
      "description": "Learn how to set a single bit or multiple bits of an interger in Java. The post How to Set a Specific Bit of a Number in Java first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/928056191/0/baeldung~How-to-Set-a-Specific-Bit-of-a-Number-in-Java",
      "source": "Baeldung",
      "author": "Burak Gökmen",
      "published": "2025-11-18T07:30:31+00:00",
      "niche": "spring",
      "score": 46,
      "keywords": []
    },
    {
      "id": "dd3331f7ef8f51d0",
      "title": "Java Weekly, Issue 621",
      "description": "Spring 7 is out. Lots and lots of releases and reading material in this one :) The post Java Weekly, Issue 621 first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/928387226/0/baeldung~Java-Weekly-Issue",
      "source": "Baeldung",
      "author": "baeldung",
      "published": "2025-11-20T12:37:12+00:00",
      "niche": "spring",
      "score": 46,
      "keywords": []
    },
    {
      "id": "ca014ed5a0db1712",
      "title": "Key Encapsulation Mechanism API in Java",
      "description": "Learn about the Key Encapsulation Mechanism (KEM) API introduced in JDK 21. The post Key Encapsulation Mechanism API in Java first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/928397657/0/baeldung~Key-Encapsulation-Mechanism-API-in-Java",
      "source": "Baeldung",
      "author": "Hamid Reza Sharifi",
      "published": "2025-11-20T15:45:06+00:00",
      "niche": "spring",
      "score": 46,
      "keywords": []
    },
    {
      "id": "1e4d8709af14c098",
      "title": "A Guide to Engine Test Kit in Junit 5",
      "description": "Discover how to use JUnit 5s Engine Test Kit in your applications. The post A Guide to Engine Test Kit in Junit 5 first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/928974746/0/baeldung~A-Guide-to-Engine-Test-Kit-in-Junit",
      "source": "Baeldung",
      "author": "Sam Gardner",
      "published": "2025-11-22T19:24:02+00:00",
      "niche": "spring",
      "score": 46,
      "keywords": []
    },
    {
      "id": "6f80e7c1791f1abd",
      "title": "Java Platform Module System: Migration Strategies for Legacy Applications",
      "description": "The Java Platform Module System (JPMS), introduced in Java 9, represents one of the most significant changes to the platform. For organizations running legacy monoliths, JPMS offers a path toward better maintainability, security, and scalability through explicit modular boundaries and strong encapsulation. However, migration requires careful planning and strategy. This article provides practical guidance for &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/java-platform-module-system-migration-strategies-for-legacy-applications.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2025-11-18T06:45:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "8a38dcf7fa566443",
      "title": "Build security into every layer you code",
      "description": "TL;DR: Get lifetime access to InfoSec4TC Projects Hub &#8211; Learn Cybersecurity &#38; GRC for $49.99 (MSRP $99). In the modern software stack, security isn&#8217;t a &#8220;nice-to-have&#8221; &#8211; it&#8217;s a shared responsibility across every layer. For Java developers, architects, and technical leads, understanding the fundamentals of cybersecurity and governance risk management has become a critical skill &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/build-security-into-every-layer-you-code.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2025-11-18T11:30:30+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "9022889ea6d532bf",
      "title": "Sending POST Data to Websites with Jsoup in Java",
      "description": "Posting data to websites—such as submitting login forms, sending API requests, or interacting with web systems—is a common requirement in automation and backend integration. While Java developers often use HttpClient or OkHttp, Jsoup offers a simple and lightweight way to perform HTTP POST operations and parse responses. Let us delve into understanding how to post &#8230;",
      "url": "https://www.javacodegeeks.com/sending-post-data-to-websites-with-jsoup-in-java.html",
      "source": "Java Code Geeks",
      "author": "Yatin Batra",
      "published": "2025-11-18T10:36:34+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "8843a00a3673d747",
      "title": "Platform Engineering: Rethinking Developer Experience in the Age of Complexity",
      "description": "The complexity of modern software development has reached a tipping point. Platform engineering has risen to prominence because of how complex modern software development is, with traditional tech stacks consisting of fractured tools that require both expertise and manual labor to use effectively. The industry&#8217;s response—platform engineering—represents not merely another DevOps iteration but a fundamental &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/platform-engineering-rethinking-developer-experience-in-the-age-of-complexity.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2025-11-18T17:00:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "9ceaecb70606f06b",
      "title": "Understanding the Constructor and initialize() Method in OpenJFX",
      "description": "When developing JavaFX applications using OpenJFX, a common question is whether to place initialization code inside the constructor of a controller class or inside the initialize() method. Both approaches have their merits and understanding the differences between them can help you write more effective, maintainable JavaFX code. Let us delve into understanding the differences between &#8230;",
      "url": "https://www.javacodegeeks.com/understanding-the-constructor-and-initialize-method-in-openjfx.html",
      "source": "Java Code Geeks",
      "author": "Yatin Batra",
      "published": "2025-11-18T15:37:52+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "b59504191f94a19a",
      "title": "NVIDIA GPU Operator Explained: Simplifying GPU Workloads on Kubernetes",
      "description": "While GPUs have long been a staple in industries like gaming, video editing, CAD, and 3D rendering, their role has evolved dramatically over the years. Originally designed to handle graphics-intensive tasks, GPUs have proven to be powerful tools for a wide range of computationally demanding applications. Today, their ability to perform massive parallel processing has made them indispensable in modern fields such as data science, artificial intelligence and machine learning (AI/ML), robotics, cry",
      "url": "https://feeds.dzone.com/link/18931/17211673/nvidia-gpu-operator-explained-simplifying-gpu-work",
      "source": "DZone Microservices",
      "author": "Sagar Parmar",
      "published": "2025-11-18T16:00:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "bc6196b83f19f513",
      "title": "IntelliJ Aqua Retrospective: Lessons from JetBrains’ Dedicated Test Automation IDE",
      "description": "In the evolving landscape of software quality assurance, JetBrains introduced Aqua as a groundbreaking solution designed specifically for test automation engineers. Released in 2022, JetBrains Aqua is a new standalone IDE that was designed to support test automation, representing the company&#8217;s commitment to addressing the unique needs of QA professionals. This comprehensive review explores Aqua&#8217;s &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/intellij-aqua-retrospective-lessons-from-jetbrains-dedicated-test-automation-ide.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2025-11-19T07:04:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "c1530d3b9af694ce",
      "title": "[FREE EBOOKS] Linux, Train Your Own GPT & Four More Best Selling Titles",
      "description": "Hello fellow geeks, Fresh offers await you on our Information Technology Research Library, please have a look! Linux: The Comprehensive Guide ($48.99 Value) FREE for a Limited Time This guide begins with Linux fundamentals, including an overview of its history, distributions, and installation methods. Readers learn to install Linux on various hardware configurations while understanding &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/free-ebooks-linux-train-your-own-gpt-four-more-best-selling-titles-2.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2025-11-19T11:30:30+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "0526d648eff19cdf",
      "title": "How to Rasterize PDFs in Java: A Comprehensive Guide",
      "description": "PDF rasterization is a critical process in modern document management, transforming vector-based PDF content into pixel-based images embedded within PDF files. This technique has become increasingly important for organizations handling sensitive documents, preparing files for printing, and ensuring consistent rendering across different platforms. At a high level, rasterization refers to the process of converting any &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/how-to-rasterize-pdfs-in-java-a-comprehensive-guide.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2025-11-19T17:10:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "90a6180ce1d150d2",
      "title": "Beyond APIs: The Rise of the Model Context Protocol (MCP)",
      "description": "In recent years, application development has experienced a quiet but fundamental shift. Traditional APIs, once the backbone of interoperability between systems, are now sharing the stage with the Model Context Protocol (MCP). While both aim to connect applications, services, and data, they operate on very different principles. Understanding these differences is crucial as organisations increasingly &#8230;",
      "url": "https://www.javacodegeeks.com/beyond-apis-the-rise-of-the-model-context-protocol-mcp.html",
      "source": "Java Code Geeks",
      "author": "Omozegie Aziegbe",
      "published": "2025-11-19T16:13:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "592cbdefe1885fe8",
      "title": "Why Your Architecture Team Is Slow (And It's Not the Technology)",
      "description": "Last Tuesday, I watched a senior architect spend forty-five minutes presenting a technically flawless case for migrating from REST to GraphQL. Beautiful diagrams. Solid reasoning. Compelling data. The team nodded along. And then nothing happened because this was the seventh architectural discussion that the team had scheduled in three weeks. Not seven decisions. Seven discussions.",
      "url": "https://feeds.dzone.com/link/18931/17213052/why-your-architecture-team-is-slow",
      "source": "DZone Microservices",
      "author": "Dinesh Elumalai",
      "published": "2025-11-19T16:00:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "450701f39afafac7",
      "title": "Scoped Values: The Modern Alternative to ThreadLocal That Java Developers Have Been Waiting For",
      "description": "If you&#8217;ve been writing multithreaded Java applications, you&#8217;ve probably encountered ThreadLocal variables. They&#8217;ve been around since Java 1.2—over 25 years!—helping developers share data within threads without passing it through every method parameter. But times change, and so does Java. With the advent of virtual threads and Project Loom, the old ThreadLocal approach shows its age. &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/scoped-values-the-modern-alternative-to-threadlocal-that-java-developers-have-been-waiting-for.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2025-11-20T08:04:31+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "85ccc026519c83bb",
      "title": "[DEALS] Apple MacBook Air (2017) 13″ i5 1.8GHz 8GB RAM 128GB SSD Silver (Refurbished) (80% off) & Other Deals Up To 98% Off – Offers End Soon!",
      "description": "Hello fellow geeks, Fresh offers await you on our Deals store, please have a look! Apple MacBook Air (2017) 13&#8243; i5 1.8GHz 8GB RAM 128GB SSD Silver (Refurbished) (80% off) Ending soon // by Java Code Geeks Delivers 12 Hours of Fast CPU, Huge 128GB Storage, &#38; Wi-Fi Connectivity Microsoft Visual Studio Professional 2022 (97% &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/deals-apple-macbook-air-2017-13-i5-1-8ghz-8gb-ram-128gb-ssd-silver-refurbished-80-off-other-deals-up-to-98-off-offers-end-soon.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2025-11-20T11:30:30+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "e027990648e9a5d2",
      "title": "Apache Spark Join DataFrames Java Example",
      "description": "In modern data engineering pipelines, applications often need to combine multiple datasets that share the same schema. Apache Spark provides a powerful and scalable way to work with structured data through its Dataset and DataFrame APIs. In Java-based big-data ecosystems, concatenating two DataFrames with the same column structure is typically done using union() or unionByName(). &#8230;",
      "url": "https://www.javacodegeeks.com/apache-spark-join-dataframes-java-example.html",
      "source": "Java Code Geeks",
      "author": "Yatin Batra",
      "published": "2025-11-20T10:46:59+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "73f60314d09fc22a",
      "title": "Building Smarter Systems: Architecting AI Agents for Real-World Tasks",
      "description": "In modern software architecture, “AI agent” can mean an autonomous, intelligent component, not necessarily a machine-learning model. In this guide, we focus on building smart, event-driven, and rule-based agents that react to events, apply rules, and coordinate tasks without any machine learning. The goal is to design systems that are resilient, scalable, and maintainable, using tried-and-true patterns instead of AI complexity. Event-Driven Agents: Core Principles Event-driven architecture (EDA)",
      "url": "https://feeds.dzone.com/link/18931/17213678/building-smarter-systems-architecting-ai-agents-fo-1",
      "source": "DZone Microservices",
      "author": "Vinod Veeramachaneni",
      "published": "2025-11-20T13:00:04+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "e3883677f44feacf",
      "title": "Feign HTTP GET Request Body Example",
      "description": "Feign is a declarative HTTP client in the Spring ecosystem that simplifies calling external APIs. While Feign makes it easy to define REST clients, one common issue we face is attempting to send a GET request with a request body, a pattern that is technically allowed by HTTP but not widely supported by servers. In &#8230;",
      "url": "https://www.javacodegeeks.com/feign-http-get-request-body-example.html",
      "source": "Java Code Geeks",
      "author": "Omozegie Aziegbe",
      "published": "2025-11-20T16:33:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "38d82275ec03419c",
      "title": "Automatic Modules: Bridging Legacy and Modular Java",
      "description": "When Java 9 dropped in 2017, it brought with it one of the most ambitious changes in Java&#8217;s history: the Java Platform Module System (JPMS), affectionately known as Project Jigsaw. After two decades of classpath chaos, Java finally had a real module system. But there was a problem—a massive one. What about the billions of &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/automatic-modules-bridging-legacy-and-modular-java.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2025-11-20T16:20:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "7d554f69b2b66be7",
      "title": "How I Cut Kubernetes Debugging Time by 80% With One Bash Script",
      "description": "Here's the truth about Kubernetes troubleshooting: 80% of your time goes into finding WHAT broke and WHERE it broke. Only 20% goes into actually fixing it. For months, I lived this reality, managing eight Kubernetes clusters. Every issue followed the same pattern: 30 minutes of kubectl detective work, five minutes to fix the actual problem. I was spending hours hunting for needles in haystacks. Then one weekend, I flipped that ratio. Every Monday at 8 AM, our team's Teams chat explodes. \"Hey, th",
      "url": "https://feeds.dzone.com/link/18931/17213899/cut-kubernetes-debugging-time",
      "source": "DZone Microservices",
      "author": "Shamsher Khan",
      "published": "2025-11-20T17:00:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "597db577bb7d405d",
      "title": "Kubernetes CSI Drivers",
      "description": "In the Kubernetes ecosystem, storage has many facets. The most obvious ones are StorageClass, PersistentVolume, and PersistentVolumeClaim. We have all used them to get storage mounted to pods, but that is just the surface of how storage really gets plugged into Kubernetes pods. Beneath the PVs and PVCs lies a complex standard consisting of multiple components, and every component is crucial for it to work. In this article, I am going to dive deep into how this standard works, what each component",
      "url": "https://feeds.dzone.com/link/18931/17213798/kubernetes-csi-drivers",
      "source": "DZone Microservices",
      "author": "Ramesh Sinha",
      "published": "2025-11-20T15:00:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "c9ccdbd03103ea32",
      "title": "IntelliJ IDEA 2025.2.5 Is Out!",
      "description": "We’ve just released IntelliJ IDEA 2025.2.5. You can update to this version from inside the IDE, using the Toolbox App, or using snaps if you are a Ubuntu user. You can also download it from our website. Here are the most notable updates: To find out more details about the issues resolved, please refer to [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/11/intellij-idea-2025-2-5/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Julia Shashkova",
      "published": "2025-11-20T19:45:59+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "a624dab9975247f1",
      "title": "Adoption and Decline of Programming Languages—What Drives Programming Trends?",
      "description": "1. Introduction Every year, the world of programming languages is in motion. Some languages rocket into wide adoption, while others quietly drift into obscurity. But what really drives these shifts? It’s tempting to think it’s just about speed, syntax, or libraries. In reality, it’s a combination of industry trends, education, community strength, and sometimes, pure &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/adoption-and-decline-of-programming-languages-what-drives-programming-trends.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2025-11-21T06:07:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "265ffe00db4d189e",
      "title": "Data Privacy as Strategic Opportunity in a Cookieless Future",
      "description": "The Wake-Up Call We Needed Let&#8217;s be honest—the digital marketing world is going through its biggest identity crisis in a decade. Third-party cookies, those invisible trackers that followed users across the internet, are finally meeting their end. Chrome and Firefox are shutting them down, regulations like GDPR and CCPA are tightening the screws, and consumers? &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/data-privacy-as-strategic-opportunity-in-a-cookieless-future.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2025-11-21T16:34:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "ffd22c0912f377b6",
      "title": "[FREE EBOOKS] Unlocking Data with Generative AI and RAG, Linux & Four More Best Selling Titles",
      "description": "Hello fellow geeks, Fresh offers await you on our Information Technology Research Library, please have a look! Unlocking Data with Generative AI and RAG: Enhance generative AI systems by integrating internal data with large language models using RAG ($31.99 Value) FREE for a Limited Time Generative AI is helping organizations tap into their data in &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/free-ebooks-unlocking-data-with-generative-ai-and-rag-linux-four-more-best-selling-titles.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2025-11-22T11:30:30+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "1b29e64f12202844",
      "title": "[DEALS] SwifDoo PDF Pro: Perpetual Lifetime License for Windows (72% off) & Other Deals Up To 98% Off – Offers End Soon!",
      "description": "Hello fellow geeks, Fresh offers await you on our Deals store, please have a look! SwifDoo PDF Pro: Perpetual Lifetime License for Windows (72% off) Ending soon // by Java Code Geeks Transform your PDF Experience with SwifDoo PDF Pro: Enjoy Effortless Editing, Seamless Conversions &#38; Instant Translations All in One Powerful Tool Cleaner Kit &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/deals-swifdoo-pdf-pro-perpetual-lifetime-license-for-windows-72-off-other-deals-up-to-98-off-offers-end-soon.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2025-11-23T11:30:30+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "12fb17ae74e3fc3d",
      "title": "Delta Lake Introduction",
      "description": "Delta Lake is an open-source storage layer that brings reliability, performance, and ACID (Atomicity, Consistency, Isolation, Durability) transactions to data lakes. Built on top of Apache Spark and compatible with cloud storage systems such as Amazon S3, Azure Data Lake Storage, and Google Cloud Storage, Delta Lake enables scalable and robust data pipelines by addressing &#8230;",
      "url": "https://www.javacodegeeks.com/delta-lake-introduction.html",
      "source": "Java Code Geeks",
      "author": "Yatin Batra",
      "published": "2025-11-24T09:21:27+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "64094a9101b6b893",
      "title": "Quantum Computing: Beyond the Code",
      "description": "The quantum revolution isn&#8217;t coming—it&#8217;s already here. In 2025, we&#8217;re witnessing quantum computers transition from theoretical marvels to practical tools that are reshaping entire industries. This isn&#8217;t just about faster calculations; it&#8217;s about solving problems that were previously impossible. Understanding Quantum Supremacy: The Breakthrough Moment Quantum supremacy—the point where quantum computers solve problems that classical &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/quantum-computing-beyond-the-code.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2025-11-24T07:16:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "b530e2f8bd8fa585",
      "title": "The Evolution of User Experience Design",
      "description": "User Experience (UX) has transformed from a niche specialty into the cornerstone of digital product success. What began as basic usability testing has evolved into a sophisticated discipline drawing from cognitive science, behavioral psychology, and human-centered design. In 2025, understanding UX&#8217;s theoretical foundations isn&#8217;t just for designers—it&#8217;s essential for anyone making technology adoption decisions. From &#8230;",
      "url": "https://www.javacodegeeks.com/2025/11/the-evolution-of-user-experience-design.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2025-11-24T16:35:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "6c09e90def99ff2c",
      "title": "Java 26 Warns of Deep Reflection - Inside Java Newscast #101",
      "description": "Java 26 will issue run-time warnings when a final field is mutated through reflection. This prepares for a future change that will make such final field mutations illegal by default to improve Java's integrity, specifically the keyword final. This will have beneficial effects on maintainability, security, and performance. While the recommendation is to move away from final field mutation, the new permanent command-line option --enable-final-field-mutation allows it for selected modules. To ease ",
      "url": "https://inside.java/2025/11/20/newscast-101/",
      "source": "Inside.java (Oracle)",
      "author": "[\"NicolaiParlog\"]",
      "published": "2025-11-20T00:00:00+00:00",
      "niche": "spring",
      "score": 37,
      "keywords": []
    },
    {
      "id": "a5d46711ef14816c",
      "title": "Symbolic Modeling and Transformation of Java Code #JVMLS",
      "description": "This session explores code reflection in Project Babylon, demonstrating how Java code can be symbolically modeled as Java code models. It covers the underlying approach, highlights key advantages, and discusses potential limitations.",
      "url": "https://inside.java/2025/11/22/jvmls-symbolic-modelling-java-transformation/",
      "source": "Inside.java (Oracle)",
      "author": "[\"PaulSandoz\"]",
      "published": "2025-11-22T00:00:00+00:00",
      "niche": "spring",
      "score": 37,
      "keywords": []
    },
    {
      "id": "ca041d34138b25c2",
      "title": "DesignGurus.io or Bugfree.ai? Which is Better Place to Prepare for System Design Interview in 2026?",
      "description": "Hello guys, preparing for coding interviews in 2026 is much more competitive than ever. The tech market is flooded with more qualified candidates and jobs are shrinking. With thousands of candidates applying for roles at top tech companies like Google, Meta, Amazon, and Netflix, or big investment banks like J P Morgan, Goldman Sachs, and UBS, your preparation strategy matters a lot. While there are many resources to prepare for System Design and DSA for coding interviews, like ByteByteGo, AlgoMo",
      "url": "http://javarevisited.blogspot.com/2025/11/designgurusio-or-bugfreeai-which-is.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-11-18T06:31:00-08:00",
      "niche": "spring",
      "score": 33,
      "keywords": []
    },
    {
      "id": "2cbd551772d3e342",
      "title": "15 Best Black Friday and Cyber Monday 2025 Deals for Developers and Software Engineers",
      "description": "Hello guys, if you’re a developer like me, you already know that Black Friday isn’t just about gadgets and monitors anymore — it’s the best time to invest in yourself and your career growth. Every year, I take advantage of these early tech education deals to stack up courses, tools, and lifetime plans that keep me learning and growing throughout the year. Whether you’re preparing for tech interviews, leveling up your backend skills, mastering system design, learning AI/ML, or diving into cloud c",
      "url": "http://javarevisited.blogspot.com/2025/11/15-best-black-friday-and-cyber-monday.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-11-20T06:48:00-08:00",
      "niche": "spring",
      "score": 33,
      "keywords": []
    },
    {
      "id": "ec6b708874efa6a4",
      "title": "Hands-On vs. Theory: Which Platform Wins the 2026 System Design Battle (Bugfree vs. Codemia vs. LeetCode) Review",
      "description": "Hello guys, If you are preparing for System Design interview then you may know that System design interviews have evolved. It’s no longer enough to memorize architectures or watch a few YouTube videos before your big day. With lot of layoffs done by FAANG companies like Amazon’s recent 14K people layoff means there is a lot of competitions and you are competing with the very best people out there. Because of this over-supply of best talent, companies have also become very choosy, hence you must ",
      "url": "http://javarevisited.blogspot.com/2025/11/hands-on-vs-theory-which-platform-wins.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-11-22T04:42:00-08:00",
      "niche": "spring",
      "score": 33,
      "keywords": []
    },
    {
      "id": "92945e451f417e0e",
      "title": "CodeCademy, Udacity, and ZTM Academy Black Friday + Cyber Monday SALE 2025 — 50% to 66% OFF",
      "description": "Hello guys, Black Friday is the best time of the year to level up your tech skills without burning your wallet as many platforms and resources offer awesome Black Friday deals with discounts ranging from 30 to 80% on their annual and lifetime plan. If you’ve been thinking about learning to code, upskilling for a promotion, or switching into AI/ML, data, cloud, or full-stack engineering, these three platforms, I mean Codecademy, Udacity, and Zero To Mastery (ZTM) Academy—are offering their bigges",
      "url": "http://javarevisited.blogspot.com/2025/11/codecademy-udacity-and-ztm-academy.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-11-23T05:33:00-08:00",
      "niche": "spring",
      "score": 33,
      "keywords": []
    },
    {
      "id": "0b13e14597bafc1a",
      "title": "10 Best Udemy Courses to learn System Design and Software Architecture in 2026",
      "description": "Hey folks! if you’re a software developer then you’ve probably heard the buzz about System Design interviews. They’re no longer just for senior roles; even mid-level and sometimes even freshers are getting grilled on them at top companies, around the globe. System Design and Software Architecture about designing scalable, reliable, and maintainable software — — basically, how to build the next big thing! If you want to learn System Design and Software Architecture in depth and looking for resour",
      "url": "http://javarevisited.blogspot.com/2025/11/10-best-udemy-courses-to-learn-system.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-11-24T04:12:00-08:00",
      "niche": "spring",
      "score": 33,
      "keywords": []
    },
    {
      "id": "87f5af70c3a7f925",
      "title": "JEP targeted to JDK 26: 525: Structured Concurrency (6th Preview)",
      "description": "The following JEP is targeted to JDK 26: 525: Structured Concurrency (Sixth Preview)",
      "url": "https://inside.java/2025/11/24/jep525-target-jdk26/",
      "source": "Inside.java (Oracle)",
      "author": "[\"AlanBateman\", \"ViktorKlang\", \"RonPressler\"]",
      "published": "2025-11-24T00:00:00+00:00",
      "niche": "spring",
      "score": 32,
      "keywords": []
    },
    {
      "id": "a1a5105910961394",
      "title": "The best way to clean up test data with Spring and Hibernate",
      "description": "Introduction In this article, I&#8217;m going to show you the best way to clean up test data when using Spring and Hibernate. While it&#8217;s very common to use the @DataJpaTest annotation when implementing integration tests, in this blog post, you will see why you are better off avoiding using this annotation. Why I don&#8217;t use @DataJpaTest As explained by the manual, Spring Boot provides the @DataJpaTest annotation for Spring Data JPA integration testing. Once the @DataJpaTest annotation ",
      "url": "https://vladmihalcea.com/clean-up-test-data-spring/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-11-11T08:05:24+00:00",
      "niche": "spring",
      "score": 32,
      "keywords": []
    },
    {
      "id": "3f3153205e6b75bf",
      "title": "OpenShift AI with vLLM and Spring AI",
      "description": "This article will teach you how to use OpenShift AI and vLLM to serve models used by the Spring AI application. To run the model on OpenShift AI, we will use a solution called KServe ModelCar. It can serve models directly from a&#160;container without using the S3 bucket. KServe is a standard, cloud-agnostic Model Inference [&#8230;] The post OpenShift AI with vLLM and Spring AI appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/05/12/openshift-ai-with-vllm-and-spring-ai/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-05-12T06:47:19+00:00",
      "niche": "spring",
      "score": 32,
      "keywords": []
    },
    {
      "id": "b336c7f1680f531a",
      "title": "Spring AI with Azure OpenAI",
      "description": "This article will show you how to use Spring AI features like chat client memory, multimodality, tool calling, or embedding models with the Azure OpenAI service. Azure OpenAI is supported in almost all Spring AI use cases. Moreover, it goes beyond standard OpenAI capabilities, providing advanced AI-driven text generation and incorporating additional AI safety and [&#8230;] The post Spring AI with Azure OpenAI appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/03/25/spring-ai-with-azure-openai/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-03-25T16:02:02+00:00",
      "niche": "spring",
      "score": 32,
      "keywords": []
    },
    {
      "id": "09037c3675c0329c",
      "title": "How To – Structured Logging with Spring Boot",
      "description": "Last Updated on November 14, 2024 by jt Support for Structured Logging is a new Spring Boot feature introduced with the Spring Boot 3.4.0 release. Structured Logging is fairly common to use in distributed environments where you are using some type of consolidated logging. Typically, you will use a JSON log format to allow for [&#8230;]Continue reading The post How To – Structured Logging with Spring Boot first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-structured-logging-with-spring-boot/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-11-11T17:58:27+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "b389034d1298c7dc",
      "title": "How to Convert a String to char in Java",
      "description": "Last Updated on October 28, 2024 by jt Converting a String to char is a common task in Java. Java provides several ways to achieve this. In this blog post, we’ll cover the primary methods and highlight when to use each one. String to char Using charAt() Method The most common way to convert a [&#8230;]Continue reading The post How to Convert a String to char in Java first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-convert-a-string-to-char-in-java/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-28T15:08:56+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "bfc73f15b55b0893",
      "title": "How to Use – Java if else statement",
      "description": "Last Updated on October 26, 2024 by jt The if else statement is a fundamental control structures in Java.. This structure evaluates conditions and executes code based on whether those conditions are true or false. Let’s look at how to use if, if else, and else if statements effectively. The Java if Statement An if [&#8230;]Continue reading The post How to Use – Java if else statement first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-use-java-if-else-statement/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-26T12:01:06+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "1898c7a2cfd791f1",
      "title": "How to Use the Java Substring Method",
      "description": "Last Updated on October 25, 2024 by jt The substring() method in Java is a tool for manipulating strings. It allows you to extract a portion of a string by specifying a start index, and optionally, an end index. Basic Usage of substring() The Java substring() method has two variations: In this example: Important Details [&#8230;]Continue reading The post How to Use the Java Substring Method first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-use-the-java-substring-method/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-25T13:27:36+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "e6ff7d376dd1b6b6",
      "title": "How To Convert int to String in Java",
      "description": "Last Updated on October 22, 2024 by jt Converting an int to a String is a common task in Java, especially when working with user interfaces, file output, or JSON formatting. Java provides several ways to perform this conversion, each with different use cases and characteristics. In this blog post, I will cover the most [&#8230;]Continue reading The post How To Convert int to String in Java first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-convert-int-to-string-in-java/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-22T17:16:03+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "fc6837ada1289eb3",
      "title": "How to Convert String to int in Java",
      "description": "Last Updated on October 22, 2024 by jt String to int conversions are a common task in Java, especially when dealing with user input or API calls. Java provides several ways to perform this conversion. This blog post will cover the most common methods for converting a String to an Integer and cover best practices [&#8230;]Continue reading The post How to Convert String to int in Java first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-convert-string-to-integer-in-java/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-22T13:40:16+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "92dd433b17e63923",
      "title": "How to The Jackson Object Mapper with JSON",
      "description": "Last Updated on October 22, 2024 by jt Introduction As a Java developer, a common task you&#8217;ll encounter is converting between Java objects and JSON. The Jackson library is a powerful and widely used tool for this purpose. Whether you&#8217;re building RESTful APIs, microservices, or simply handling JSON data in your application, Jackson&#8217;s ObjectMapper class [&#8230;]Continue reading The post How to The Jackson Object Mapper with JSON first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-the-jackson-object-mapper-with-json/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-20T16:40:39+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "d64890d08a5a5184",
      "title": "How To – The Java XOR Operator",
      "description": "This tutorial covers the Java XOR operator, represented by the ^ symbol, which operates on boolean and integer types. It explains how XOR functions as a logical operator for booleans, returning true for different values, and performs a bitwise operation for integers, illustrating with examples and truth tables. The post How To – The Java XOR Operator first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/the-java-xor-operator/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-18T19:20:45+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "dc447e3a43e1699d",
      "title": "How to Create Dynamic Output with the Java printf() Method",
      "description": "Last Updated on October 22, 2024 by jt The Java printf() output method is used to generate a formatted string. Data from the arguments is written and formatted placeholders. In this tutorial we will explore the functionality of the printf() method. The Java language was heavily inspired by the C programming language. As such, the [&#8230;]Continue reading The post How to Create Dynamic Output with the Java printf() Method first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/java-output-printf-method/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-16T19:16:02+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "337d41ea885f7452",
      "title": "How to Use Structured Outputs with Spring AI",
      "description": "Last Updated on October 20, 2024 by jt What are Structured Outputs? Using Structured Outputs is an important aspect when interacting with LLMs programmatically. LLMs, by their nature, generate unstructured output. The unstructured output does not work well with programming languages which need structure to understand the data. Through prompting techniques, you can direct the [&#8230;]Continue reading The post How to Use Structured Outputs with Spring AI first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/using-structured-outputs-with-spring-ai/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-14T17:50:44+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "9affd390d78c61ce",
      "title": "Getting Started with Spring Security and JWT",
      "description": "Spring Security provides a comprehensive set of security features for Java applications, covering authentication, authorization, session management, and protection against common security threats such as CSRF (Cross-Site Request Forgery).",
      "url": "https://reflectoring.io/spring-security-jwt/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-06-19T00:00:00+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "40656eefd0081fbc",
      "title": "Why I Fired Google and Gave an AI Chatbot a Shot?",
      "description": "Like many developers, I used Google and Stack Overflow to solve problems, explore new tools, and learn new skills. I wasn't happy with these tools, but they were all I got. When the first AI tools were released, I was skeptical and pretty much ignored them. However, last year I decided to bite the bullet and got the Plus subscription of ChatGPT. In this post, I’ll describe why I decided to give an AI chatbot a shot. Read More The post Why I Fired Google and Gave an AI Chatbot a Shot? appeared fi",
      "url": "https://feeds.feedblitz.com/~/924349763/0/petrikainulainen~Why-I-Fired-Google-and-Gave-an-AI-Chatbot-a-Shot/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-09-04T15:49:16+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "5c939834b9a06aa2",
      "title": "Spring AI Custom CallAdvisor & StreamAdvisor Example",
      "description": "Spring AI CallAdvisor and StreamAdvisor provide hooks to wrap around LLM invocations, both for synchronous and streaming scenarios. The post Spring AI Custom CallAdvisor & StreamAdvisor Example appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/spring-ai/spring-ai-calladvisor-streamadvisor-example/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-06-16T20:43:48+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "acee43e7d27854cd",
      "title": "Angular UI Testing using Selenium and Selenide",
      "description": "In-browser UI testing of Angular applications poses several challenges such as asynchronous operations and unpredictable loading screens with spinners or dimmers. Selenide has an implicit capability to wait for the loading screen to disappear. The post Angular UI Testing using Selenium and Selenide appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/java/angular-ui-testing-using-d-selenide/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-02-17T08:39:53+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "e7ca8e23678bbd7b",
      "title": "Spring Boot Structured Logging in JSON Format Example",
      "description": "Since version 3.4, Spring Boot will provide native support for structured logging in the most common and popular formats, such as JSON and XML. The post Spring Boot Structured Logging in JSON Format Example appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/spring-boot/structured-logging-example/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2024-11-18T12:26:13+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "85dd2b4e4a903733",
      "title": "IntelliJ IDEA 2025.3 💚 Spring 7",
      "description": "Major Spring Framework releases don’t come around often – and when they do, they tend to reshape how we build applications for years to come. Spring Framework 7 is one of those releases. It simplifies many aspects of development, cleans up some long-standing pain points, and introduces features that previously required custom annotations or boilerplate-heavy [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/11/intellij-idea-2025-3-spring-7/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Andrey Belyaev",
      "published": "2025-11-14T15:31:52+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "efa5d2b87b0e1288",
      "title": "Offloading File Transfers with Amazon S3 Presigned URLs in Spring Boot",
      "description": "When building web applications that involve file uploads or downloads, a common approach is to have the files pass through an application server.",
      "url": "https://reflectoring.io/offloading-file-transfers-with-amazon-s3-presigned-urls-in-spring-boot/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-06-15T00:00:00+05:30",
      "niche": "spring",
      "score": 24,
      "keywords": []
    },
    {
      "id": "ce15f62abbd12e67",
      "title": "Reactive APIs Offered by Apache HttpClient",
      "description": "In this article, we are going to learn about reactive APIs offered by Apache HttpClient APIs. We are going to explore how to use reactive, full-duplex HTTP/1.",
      "url": "https://reflectoring.io/apache-http-client-reactive-apis/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-05-29T00:00:00+11:00",
      "niche": "spring",
      "score": 24,
      "keywords": []
    },
    {
      "id": "b3725faf35c7a6b4",
      "title": "Book Review – Troubleshooting Java",
      "description": "Introduction My friend, Laurentiu Spilca, has been working on the second edition of his Troubleshooting Java book, and when I was asked to review it, I was more than happy to do it since the book features a lot of topics that I&#8217;m also very interested in, such as performance tuning and query optimization. Audience This book is useful for any Java developer because it teaches you how to get the best out of your IDE debugger, as well as showing you how to profile Java applications and fix ver",
      "url": "https://vladmihalcea.com/book-review-troubleshooting-java/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-10-15T08:28:01+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "ae80642099134389",
      "title": "Twelve years of blogging",
      "description": "Twelve years later! Twelve years ago today, I decided to create this blog on WordPress.com to share whatever I was finding interesting while working as a software architect. Prior to starting this blog, I didn&#8217;t have any writing experience, which you can clearly see in the first article I&#8217;ve ever published. However, practice makes perfect, and in time, I managed to learn how to express myself in writing, whether it was an article, a social media post, an answer on StackOverflow, or a",
      "url": "https://vladmihalcea.com/twelve-years-of-blogging/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-09-30T11:35:44+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "9dddbd8c7d517a3c",
      "title": "MySQL Query Optimization with Releem",
      "description": "Introduction In this article, I&#8217;m going to show you how to optimize the queries executed by a Spring application running on MySQL using Releem. For a short introduction about Releem, check out this previous article, in which I explained how to set up Releem to collect metrics from your MySQL database. Spring Petclinic application The application under test is going to be the well-known Spring Petclinic that we are going to run using the MySQL profile: After starting the application, we are",
      "url": "https://vladmihalcea.com/mysql-query-optimization-releem/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-05-12T18:46:00+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "4c1077e07b72434a",
      "title": "Foundations of AI and Machine Learning for Java Developers Course Review",
      "description": "Introduction In this article, I&#8217;m going to review the Foundations of AI and Machine Learning for Java Developers video course from my fellow Java Champion, Frank Greco. If you are new to AI and ML and want to get a great introduction to these topics, then you should definitely join watch the video lessons created by Frank Greco. And, thanks to LinkedIn Learning&#8217;s generosity, until June 20, you can enroll in this video course for free. Video Course Agenda The course provides one hour ",
      "url": "https://vladmihalcea.com/foundations-of-ai-and-ml-course-review/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-04-11T08:26:55+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "c1db60872cc56406",
      "title": "How to map the Oracle TIMESTAMP WITH TIME ZONE with JPA",
      "description": "Introduction In this article, I&#8217;m going to explain how to map the Oracle TIMESTAMP WITH TIME ZONE with JPA and Hibernate. While the DATE and TIMESTAMP column types are suitable for mapping the LocalDateTime, the TIMESTAMP WITH TIME ZONE column type allows us to map both the ZonedDateTime and OffsetDateTime. Oracle TIMESTAMP WITH TIME ZONE Traditionally, Oracle provided the DATE and TIMESTAMP column types to store timestamp values. The difference between the DATE and TIMESTAMP types is that",
      "url": "https://vladmihalcea.com/oracle-timestamp-with-time-zone-jpa/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-03-18T16:21:37+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "737f1ecd555218a0",
      "title": "MySQL Performance Tuning with Releem",
      "description": "Introduction If your application uses MySQL and you&#8217;re interested in getting the best out of it via performance tuning and monitoring, then Releem is a very nice tool that can assist you in your endeavor. I discovered Releem from Roman Agabekov&#8217;s posts on social media. Roman is the founder of this tool, and since his posts about MySQL performance tuning are very insightful, I decided to give it a try and see what it has to offer. Installing Releem Releem uses a client-server architec",
      "url": "https://vladmihalcea.com/mysql-performance-tuning-releem/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-02-10T18:04:50+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "7a9059b46a2a2d4e",
      "title": "Why you should use compact table columns",
      "description": "Introduction In this article, I&#8217;m going to explain you should use compact table columns when designing your database schema. By using compact table columns, you can cache more table records and index entries and, therefore, speed up your SQL queries. Database caching As I explained in this article, relational database systems cache the pages that are loaded from the disk in the Buffer Pool (e.g., shared buffers in PostgreSQL) so that the next time the same page is requested by an SQL query",
      "url": "https://vladmihalcea.com/compact-table-columns/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-01-14T12:10:05+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "bf1d541833a1565a",
      "title": "High-Performance Java Persistence Newsletter, Issue 69",
      "description": "Introduction Welcome to a new issue of the High-Performance Java Persistence Newsletter in which we share articles, videos, workshops, and StackOverflow answers that are very relevant to any developer who interacts with a database system using Java. Articles The pick of this week is this series of articles from Franck Pachot about Amazon Aurora Limitless, a PostgreSQL-compatible database that provides automatic sharding. While the solution lacks several features, it&#8217;s good to keep an eye o",
      "url": "https://vladmihalcea.com/high-performance-java-persistence-newsletter-issue-69/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2024-12-12T17:50:30+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "ec2e71754354783c",
      "title": "My newest keyboard: a Keychron K11 Max (Alice Layout) QMK/VIA Wireless Custom Mechanical Keyboard",
      "description": "I just got back from Malmö, Sweden, where I spoke at the amazing ØREDEV conference. I love that show! I'ves spoken there various times over the years, including waaaay back in 2013 where I had the pleasure of meeting XKCD creator Randall Munroe.",
      "url": "https://joshlong.com/jl/blogpost/my-new-keychron-ergo-keyboard.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-11-08T00:00:00+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "7b8b5e2364724498",
      "title": "Some Over Indulgent fun with ChatGPT's Image Rendering",
      "description": "ChatGPT just announced a new feature that allows you to upload a photo or other reference and then have it re-render that image in another style. And it will, quite handily, do so in the style of tons of different cartoons and comic book artists. What's interesting to me is that it won't render art in the style of still-living comic book artists, only those that have (sadly) passed on. It will however render things in the style of well-known anime studios whose body of work, and their style, in ",
      "url": "https://joshlong.com/jl/blogpost/chatgpt-studio-ghibli.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-04-04T00:00:00+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "bb5ca07ef0d734ff",
      "title": "The Framework Architect's Corner, ep. 001: Spring's `Scope` annotation and meta annotations",
      "description": "Hi, Spring fans! You know, a member of the community is working on a sort of framework-y DSL for constructing flows. One of the requirements is to be able to parameterize beans that are managed by Spring. This is a good fit for Spring's scope mechanism.",
      "url": "https://joshlong.com/jl/blogpost/2025-03-04-framework-corner-scopes-and-meta-annotations.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-03-04T00:00:00+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "492fc6332ef8720b",
      "title": "Weird Error When Installing the Synology Drive Client App on macOS Sequoia 15.3.1",
      "description": "I use the Synology NAS. It's an appliance that gives you a push-button simple RAID experience with a dedicated web-based console to administer the NAS. I love my Synology. Indeed, just a few weeks ago, I migrated the four-disk RAID 10 array from 5 TB disks to 18 TB disks. Now I have nearly 40 TB of space, striped and redundant. Dope. (Thanks, Synology!)",
      "url": "https://joshlong.com/jl/blogpost/macos-synology-drive-permissions-error.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-03-01T00:00:00+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "13dafabafdfaa1ac",
      "title": "Apple macOS Sequoia 15.4 Beta Broke Docker (and Everything Else)",
      "description": "I've just reinstalled macOS on my Apple MacBook Pro M4 Max. Why did I reinstall macOS? Because I got suckered! I've been riding the macOS system betas for years now—rarely an issue. Before you comment, I'd bet you've had more issues riding mainstream—released—Windows and Linux distro updates than I have riding macOS betas. This time, however, I regret it!",
      "url": "https://joshlong.com/jl/blogpost/apple-macos-sequoia-154-beta-broke-docker.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-02-28T00:00:00+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "3b617b77083015bb",
      "title": "Running .NET Apps on OpenShift",
      "description": "This article will guide you on running a .NET application on OpenShift using the Source-to-Image (S2I) tool. While .NET is not my primary area of expertise, I have been working with it quite extensively lately. In this article, we will examine more complex application cases, which may initially present some challenges. If you are interested [&#8230;] The post Running .NET Apps on OpenShift appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/11/17/running-net-apps-on-openshift/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-11-17T09:27:34+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "e019c2da8930a7e1",
      "title": "AI Tool Calling with Quarkus LangChain4j",
      "description": "This article will show you how to use Quarkus LangChain4j AI support with the most popular chat models for the &#8220;tool calling&#8221; feature. Tool calling (sometimes referred to as function calling) is a typical pattern in AI applications that enables a model to interact with APIs or tools, extending its capabilities. The most popular AI [&#8230;] The post AI Tool Calling with Quarkus LangChain4j appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/06/23/ai-tool-calling-with-quarkus-langchain4j/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-06-23T05:19:14+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "10af998e676b05a2",
      "title": "Getting Started with Quarkus LangChain4j and Chat Model",
      "description": "This article will teach you how to use the Quarkus LangChain4j project to build applications based on different chat models. The Quarkus AI Chat Model offers a portable and straightforward interface, enabling seamless interaction with these models. Our sample Quarkus application will switch between three popular chat models provided by OpenAI, Mistral AI, and Ollama. [&#8230;] The post Getting Started with Quarkus LangChain4j and Chat Model appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/06/18/getting-started-with-quarkus-langchain4j-and-chat-model/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-06-18T16:36:08+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "a33de48eac987814",
      "title": "Backstage Dynamic Plugins with Red Hat Developer Hub",
      "description": "This article will teach you how to create Backstage dynamic plugins and install them smoothly in Red Hat Developer Hub. One of the most significant pain points in Backstage is the installation of plugins. If you want to run Backstage on Kubernetes, for example, you have to rebuild the project and create a new image [&#8230;] The post Backstage Dynamic Plugins with Red Hat Developer Hub appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/06/13/backstage-dynamic-plugins-with-red-hat-developer-hub/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-06-13T11:38:24+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "c5fb8278081b8095",
      "title": "The Art of Argo CD ApplicationSet Generators with Kubernetes",
      "description": "This article will teach you how to use the Argo CD ApplicationSet generators to manage your Kubernetes cluster using a GitOps approach. An Argo CD ApplicationSet is a Kubernetes resource that allows us to manage and deploy multiple Argo CD Applications. It dynamically generates multiple Argo CD Applications based on a given template. As a [&#8230;] The post The Art of Argo CD ApplicationSet Generators with Kubernetes appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/03/20/the-art-of-argo-cd-applicationset-generators-with-kubernetes/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-03-20T09:40:46+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "a2e6173c15564377",
      "title": "How to Customize Enum Mappings with @EnumeratedValue",
      "description": "The post How to Customize Enum Mappings with @EnumeratedValue appeared first on Thorben Janssen. Mapping enums with Jakarta Persistence looks simple at first. But the two traditional options, @Enumerated(EnumType.STRING) and @Enumerated(EnumType.ORDINAL), depend on internal enum details that can change over time. If you store the enum value as a String, you will have to migrate your data whenever you decide to rename a value. And if you store the... The post How to Customize Enum Mappings with @",
      "url": "https://thorben-janssen.com/custom-enum-mappings-with-enumeratedvalue/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2025-11-06T17:05:28+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "cf21ff0fb4470d14",
      "title": "Hibernate Performance Tuning – 2025 Edition",
      "description": "The post Hibernate Performance Tuning &#8211; 2025 Edition appeared first on Thorben Janssen. Based on most discussions online and at conferences, there seem to be 2 kinds of projects that use Hibernate for their persistence layer: So, what&#8217;s the difference between these projects? Are the projects in the 2nd group more complex or have higher performance requirements? No, based on my consulting projects, that&#8217;s not the case. On... The post Hibernate Performance Tuning &#8211; 2025 Edi",
      "url": "https://thorben-janssen.com/hibernate-performance-tuning/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2025-01-15T09:15:54+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "e2a54fda8458da1b",
      "title": "Date and Time Mappings with Hibernate and JPA",
      "description": "The post Date and Time Mappings with Hibernate and JPA appeared first on Thorben Janssen. Databases support various data types to store date and time information. The most commonly used ones are: You can map all of them with JPA and Hibernate. But you need to decide to which Java type you want to map your database column. The Java language supports a bunch of classes to represent date and... The post Date and Time Mappings with Hibernate and JPA appeared first on Thorben Janssen.",
      "url": "https://thorben-janssen.com/hibernate-jpa-date-and-time/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-12-04T11:55:40+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "577a5c7ec21c998a",
      "title": "AI Glossary for Java Developers",
      "description": "The post AI Glossary for Java Developers appeared first on Thorben Janssen. Most Java developers encounter problems when learning how to integrate AI into their applications using SpringAI, Langchain4J, or some other library. AI introduces many new terms, acronyms, and techniques you must understand to build a good system. I ran into the same issue when I started learning about AI. In this article, I did my... The post AI Glossary for Java Developers appeared first on Thorben Janssen.",
      "url": "https://thorben-janssen.com/ai-glossary-for-java-developers/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-07-03T14:00:48+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "3c49da9852171ddc",
      "title": "How to define a repository with Jakarta Data and Hibernate",
      "description": "The post How to define a repository with Jakarta Data and Hibernate appeared first on Thorben Janssen. Repositories are a commonly used pattern for persistence layers. They abstract from the underlying data store or persistence framework and hide the technical details from your business code. Using Jakarta Data, you can easily define such a repository as an interface, and you&#8217;ll get an implementation of it based on Jakarta Persistence or Jakarta NoSQL.... The post How to define a repositor",
      "url": "https://thorben-janssen.com/jakarta-data-repository/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-06-26T06:51:10+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "37af0b4b5e585dd4",
      "title": "Getting Started with Jakarta Data and Hibernate",
      "description": "The post Getting Started with Jakarta Data and Hibernate appeared first on Thorben Janssen. Jakarta Data standardizes stateless repositories based on Jakarta Persistence and Jakarta NoSQL so that you can concentrate on your business code instead of handling the technical details of simple queries. In this article, I will briefly introduce the new specification and give you an overview of its stateless repositories. In future articles, we will dive... The post Getting Started with Jakarta Data an",
      "url": "https://thorben-janssen.com/getting-started-with-jakarta-data/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-06-19T07:50:00+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "42dc68c1b0d8b255",
      "title": "Should your tests manage transactions?",
      "description": "The post Should your tests manage transactions? appeared first on Thorben Janssen. During my Spring Data JPA workshops and talks, I often get asked if a test case should handle transactions, or not. And if it handles the transaction if it should commit it or roll it back. And as so often, the short answer is: it depends. The slightly longer answer is: it depends on the... The post Should your tests manage transactions? appeared first on Thorben Janssen.",
      "url": "https://thorben-janssen.com/should-your-tests-manage-transactions/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-06-12T08:00:00+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "05b7cbe720f0fecd",
      "title": "Databases and AI with Neo4J as an example with Michael Simons",
      "description": "The post Databases and AI with Neo4J as an example with Michael Simons appeared first on Thorben Janssen. When integrating AI into your application, you will most likely want to use a concept called RAG. This acronym stands for Retrieval Augmented Generation and is an absolute game changer. The idea is simple: By providing your own input data to your LLM, you can improve the quality of its response and let it include... The post Databases and AI with Neo4J as an example with Michael Simons appea",
      "url": "https://thorben-janssen.com/expertsession-databases-and-ai/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-06-11T08:01:47+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "861d5a54619586b6",
      "title": "Implement your primary key as a Record using an IdClass",
      "description": "The post Implement your primary key as a Record using an IdClass appeared first on Thorben Janssen. There are various reasons to implement your own primary&#160;key&#160;representation. Your primary key may consist of multiple attributes. Or you&#8217;re following domain-driven design principles and want to use a custom type to add semantic meaning to it. Implementing&#160;a record and mapping it&#160;as an IdClass seems evident in these situations.&#160;A record is efficient, easy to implement,",
      "url": "https://thorben-janssen.com/idclass-record/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-05-22T08:16:33+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "e722e3582008693e",
      "title": "Guide to JUnit 5 Functional Interfaces",
      "description": "In this article, we will get familiar with JUnit 5 functional interfaces. JUnit 5 significantly advanced from its predecessors. Features like functional interfaces can greatly simplify our work once we grasp their functionality.",
      "url": "https://reflectoring.io/junit5-functional-interfaces/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-07-12T00:00:00+11:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "d28b63165ee6fa0d",
      "title": "Creating and Publishing an NPM Package with Automated Versioning and Deployment",
      "description": "In this step-by-step guide, we&rsquo;ll create, publish, and manage an NPM package using TypeScript for better code readability and scalability. We&rsquo;ll write test cases with Jest and automate our NPM package versioning and publishing process using Changesets and GitHub Actions.",
      "url": "https://reflectoring.io/create-and-publish-npm-package/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-06-16T00:00:00+11:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "9cb2477beda6f2e2",
      "title": "Apache HttpClient Configuration",
      "description": "Configuring Apache HttpClient is essential for tailoring its behavior to meet specific requirements and optimize performance. From setting connection timeouts to defining proxy settings, configuration options allow developers to fine-tune the client&rsquo;s behavior according to the needs of their application.",
      "url": "https://reflectoring.io/apache-http-client-config/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-05-29T00:00:00+11:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "e9b1ae6851acc6d8",
      "title": "Async APIs Offered by Apache HttpClient",
      "description": "In this article, we are going to learn about the async APIs offered by Apache HttpClient. We are going to explore the different ways Apache HttpClient enables developers to send and receive data over the internet in asynchronous mode.",
      "url": "https://reflectoring.io/apache-http-client-async-apis/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-05-29T00:00:00+11:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "8a9576199b4aa560",
      "title": "Classic APIs Offered by Apache HttpClient",
      "description": "In this article, we are going to learn about the classic APIs offered by Apache HttpClient. We are going to explore the different ways Apache HttpClient helps us to send and receive data over the internet in classic (synchronous) mode.",
      "url": "https://reflectoring.io/apache-http-client-classic-apis/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-05-29T00:00:00+11:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "1f224610cc4f027c",
      "title": "Create a HTTP Client with Apache HttpClient",
      "description": "In this article series, we&rsquo;re going to explore Apache HTTPClient APIs. We&rsquo;ll get familiar with the different ways Apache HttpClient enables developers to send and receive data over the internet.",
      "url": "https://reflectoring.io/create-a-http-client-with-apache-http-client/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-05-29T00:00:00+11:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "579682b50910e7f9",
      "title": "AI Assisted Engineering With an AI Chatbot - From Idea to Working Code",
      "description": "Sometimes I know exactly what I need, but I don't know how I can get it done. In the past, I would have spent hours reading the reference documentation or tried to find tutorials which explain how I can write the code (or configuration) I need. Nowadays, I just start a new discussion with an AI chatbot and let the conversation evolve into a working code (or configuration). This blog post highlights six concrete success stories from my short AI assisted engineering journey. Read More The post AI ",
      "url": "https://feeds.feedblitz.com/~/927768650/0/petrikainulainen~AI-Assisted-Engineering-With-an-AI-Chatbot-From-Idea-to-Working-Code/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-11-15T14:37:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "b569f41ba20a588e",
      "title": "Software Development Monthly 10 / 2025",
      "description": "The Software Development Monthly is a monthly blog post that highlights interesting or useful blog posts which I read during the previous month. This blog post shares 19 interesting or useful blog posts which I read during October 2025. Read More The post Software Development Monthly 10 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/927423617/0/petrikainulainen~Software-Development-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-11-09T16:26:51+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "7da28f3e83236bfc",
      "title": "Clean Test Automation Monthly 10 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 14 interesting or useful blog posts which I read during October 2025. Read More The post Clean Test Automation Monthly 10 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 10 / 2024Clean Test Automation Monthly 10 / 2023&#160;",
      "url": "https://feeds.feedblitz.com/~/927068678/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-11-01T18:58:57+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "37eb21dc334330f8",
      "title": "Software Development Monthly 9 / 2025",
      "description": "The Software Development Monthly is a monthly blog post that highlights interesting or useful blog posts which I read during the previous month. This blog post shares 19 interesting or useful blog posts which I read during September 2025. Read More The post Software Development Monthly 9 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/925881437/0/petrikainulainen~Software-Development-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-10-07T09:00:40+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "10ba96a6a2102cd2",
      "title": "Clean Test Automation Monthly 9 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 21 interesting or useful blog posts which I read during September 2025. Read More The post Clean Test Automation Monthly 9 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 9 / 2024Clean Test Automation Monthly 9 / 2023&#160;",
      "url": "https://feeds.feedblitz.com/~/925562264/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-09-30T05:22:24+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "6038fbbc53ce0d9d",
      "title": "Software Development Monthly 8 / 2025",
      "description": "The Software Development Monthly is a monthly blog post that highlights interesting or useful blog posts which I read during the previous month. This blog post shares 15 interesting or useful blog posts which I read during August 2025. Read More The post Software Development Monthly 8 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/924471290/0/petrikainulainen~Software-Development-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-09-07T09:35:45+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "2ed790c05683054f",
      "title": "Clean Test Automation Monthly 8 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 15 interesting or useful blog posts which I read during August 2025. Read More The post Clean Test Automation Monthly 8 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 8 / 2024Clean Test Automation Monthly 8 / 2023&#160;",
      "url": "https://feeds.feedblitz.com/~/924129182/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-08-31T16:19:14+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "d931387571c33309",
      "title": "Clean Test Automation Monthly 7 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 11 interesting or useful blog posts which I read during July 2025. Read More The post Clean Test Automation Monthly 7 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 7 / 2023Clean Test Automation Monthly 7 / 2024&#160;",
      "url": "https://feeds.feedblitz.com/~/922500704/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-07-31T16:49:50+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "9bf24efaecbaeda0",
      "title": "Clean Test Automation Monthly 6 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 14 interesting or useful blog posts which I read during June 2025. Read More The post Clean Test Automation Monthly 6 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 6 / 2024Clean Test Automation Monthly 6 / 2023&#160;",
      "url": "https://feeds.feedblitz.com/~/920956694/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-06-30T15:33:47+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "a936d6afc1fee25c",
      "title": "Java News Roundup: Spring Framework 7.0, Spring Data, Spring AI, Payara Platform, OpenJDK, JobRunr",
      "description": "This week's Java roundup for November 10th, 2025, features news highlighting: OpenJDK JEPs targeted for JDK 26; the GA release of Spring Framework 7.0; point releases of Spring Data, Spring AI, JobRunr and Jox; the November 2025 edition of Payara Platform; the fifth release candidate of Maven 4.0; and a maintenance release of Micronaut. By Michael Redlich",
      "url": "https://www.infoq.com/news/2025/11/java-news-roundup-nov10-2025/?utm_campaign=infoq_content&utm_source=infoq&utm_medium=feed&utm_term=Java",
      "source": "InfoQ Java",
      "author": "Michael Redlich",
      "published": "2025-11-17T16:30:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "6318c7da47a718de",
      "title": "Kubernetes CNI Drivers",
      "description": "Ever wondered how we just create a pod in Kubernetes and it gets an IP address magically, can communicate with each other, and host nodes without issues? Networking is not that simple, so how does all this magic work? With this article, I attempt to unwrap the mystery and provide an understanding of the inner workings of CNI (Container Network Interface).  First, let’s start with the why.",
      "url": "https://feeds.dzone.com/link/18931/17210996/kubernetes-cni-drivers",
      "source": "DZone Microservices",
      "author": "Ramesh Sinha",
      "published": "2025-11-17T17:00:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "6283181ea40fe3ee",
      "title": "From Agent AI to Agentic AI: Building Self-Healing Kubernetes Clusters That Learn",
      "description": "In Part 1: AI-Driven Kubernetes Diagnostics, we built an AI agent that analyzes Kubernetes pod failures and suggests fixes. It works when you're at your desk, ready to approve each action. For the purposes of this article, here's a scenario.",
      "url": "https://feeds.dzone.com/link/18931/17210863/self-healing-kubernetes-clusters-agentic-ai",
      "source": "DZone Microservices",
      "author": "Shamsher Khan",
      "published": "2025-11-17T13:00:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "5de3c43cd5270358",
      "title": "Databricks vs Snowflake: Complete Architecture Mapping for Enterprise AI and Big Data",
      "description": "As data ecosystems continue to evolve in the multi-cloud environment, organizations are increasingly blending platforms to optimize for specific workloads. A common pain point I've experienced is when architecting enterprise data solutions: terminology can often be a barrier. How do core concepts in Databricks translate to Snowflake? It's not just about semantics; rather, it's about building resilient and governed architectures across platforms without reinventing the wheel. In this article, I'l",
      "url": "https://feeds.dzone.com/link/18931/17208852/big-data-and-ai-architecture-comparing-databricks",
      "source": "DZone Microservices",
      "author": "Ram Ghadiyaram",
      "published": "2025-11-13T20:00:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "7834d85f0a715170",
      "title": "Selenide IllegalArgumentException: Failed to create folders",
      "description": "The error \"java.lang.IllegalArgumentException: Failed to create folder\" in Selenide typically happens when Selenide tries to save screenshots, page sources, or logs, but it cannot create the required directories due to permission issues or incorrect paths. The post Selenide IllegalArgumentException: Failed to create folders appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/java/exception-handling/selenide-illegalargumentexception-failed-to-create-folders/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-02-17T10:42:41+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "298a11af14d34bd6",
      "title": "How to Fix MySQL Innodb_Force_Recovery Not Working Issue?",
      "description": "When InnoDB tables become corrupted, the InnoDB storage engine typically crashes the MySQL server to prevent further damage. In such situations, you can use the innodb_force_recovery option to force the server to start despite the corruption. However, you may face a situation where the innodb_force_recovery fails to start the server. This issue can occur for ... Read more The post How to Fix MySQL Innodb_Force_Recovery Not Working Issue? appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/sql/fix-mysql-innodb_force_recovery-not-working-issue/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-02-11T10:53:49+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "68725e70582339a4",
      "title": "JPackage : Create MSI/EXE Installer for Java App",
      "description": "The jpackage is a command-line tool introduced in Java 14 and helps create native installable packages (.exe, .msi, .dmg, .pkg, .deb, .rpm) for Windows, macOS, and Linux. Jpackage bundles Java applications along with a Java runtime (JRE) image, ensuring that end users do not need to install Java separately. The post JPackage : Create MSI/EXE Installer for Java App appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/devops/jpackage-plugin-example/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-02-06T06:54:41+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "1ead491ac5312dc5",
      "title": "How to Use DBCC CHECKDB to Check the Integrity Check in SQL DB",
      "description": "Database integrity refers to the accuracy, consistency, and reliability of the data stored within a database. It ensures that data remains uncorrupted, and adheres to defined rules. In SQL databases, integrity is supported through constraints like primary keys, foreign keys, unique constraints, and check constraints, alongside physical and logical data structure maintenance. Designed as a ... Read more The post How to Use DBCC CHECKDB to Check the Integrity Check in SQL DB appeared first on HowT",
      "url": "https://howtodoinjava.com/sql/db-integrity-checks-using-dbcc-checkdb/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-01-18T09:12:52+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "6009cceacdc60450",
      "title": "TypeScript Array of Objects",
      "description": "In TypeScript, an array of objects is a collection of items where each item is an object. Arrays of objects are commonly used to organize complex data structures, such as user information, products, or any other entity, into manageable collections. The post TypeScript Array of Objects appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/typescript/typescript-array-of-objects/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2024-12-16T07:50:33+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "624c47aa0a65e0bc",
      "title": "TypeScript Array of Vectors: Multi-dimensional Arrays",
      "description": "In TypeScript, an array of vectors is a collection of vectors, where each vector can represent an array of numbers or custom objects. This multi-dimensional array structure is handy in scenarios such as mathematical computations, graphics programming, or handling grouped data in a type-safe and organized manner. The post TypeScript Array of Vectors: Multi-dimensional Arrays appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/typescript/typescript-array-of-vectors/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2024-12-16T06:53:08+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "29d4cac21cf74dea",
      "title": "Java Generate PDF from HTML Template using OpenHtmlToPdf",
      "description": "OpenHTMLToPDF library generates PDF from HTML and CSS content taken from templates such as HTML file, Freemarker and Thymeleaf templates. The post Java Generate PDF from HTML Template using OpenHtmlToPdf appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/java/library/convert-html-template-to-pdf/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2024-12-09T07:37:47+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "1b6c32ae58738a54",
      "title": "Java Annotated Monthly – November 2025",
      "description": "This edition is packed with insightful, practical, and curiosity-fueling reads. From hands-on advice to thought-provoking pieces, we’ve gathered a nice selection of stories that will help you stay sharp and inspired in the tech world. We’re also happy to have Josh Long as our featured content author this month! Expect some top-notch insights and a [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/11/java-annotated-monthly-november-2025/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Irina Mariasova",
      "published": "2025-11-05T12:10:48+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "6e6bf207b43ba2fa",
      "title": "Universal Entry Point: A Single Entry Point for Context-Aware Coding Assistance",
      "description": "Modern IDEs are powerful tools with many useful features. When we talk about developer productivity, one thing that comes to mind is mastering the IDE – learning its features, like refactorings, navigation, or code generation, and remembering how to invoke them. However, discovering all the relevant features of your IDE, and knowing when and how [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/11/universal-entry-point-a-single-entry-point-for-context-aware-coding-assistance/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Marit van Dijk",
      "published": "2025-11-04T15:21:09+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "8d3d167637372382",
      "title": "IntelliJ Platform 2025.3: What Plugin Developers Should Know",
      "description": "As we approach the release of IntelliJ IDEA 2025.3, we would like to share key information about changes that may impact your plugin development process. This post addresses common questions from the developer community and provides guidance on maintaining compatibility with the latest IntelliJ Platform versions. No Immediate Upgrade Required If you built your plugin [&#8230;]",
      "url": "https://blog.jetbrains.com/platform/2025/11/intellij-platform-2025-3-what-plugin-developers-should-know/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Jakub Chrzanowski",
      "published": "2025-11-03T14:07:54+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "41d0731533e9d5a7",
      "title": "IntelliJ IDEA 2025.2.4 Is Out!",
      "description": "IntelliJ IDEA 2025.2.4 has arrived with several valuable fixes. You can update to this version from inside the IDE, using the&#160;Toolbox App, or using snaps if you are a Ubuntu user. You can also download it from our&#160;website. The latest update brings the following improvements: For a comprehensive overview of the fixes, see the release notes. [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/10/intellij-idea-2025-2-4/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Maria Kosukhina",
      "published": "2025-10-24T00:26:26+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "6580df7648786121",
      "title": "Java Annotated Monthly – October 2025",
      "description": "Welcome to Java Annotated Monthly! Wow, September really flew by! We&#8217;ve gathered all the top Java news and insights to help you catch up on anything you missed.&#160; First up, we’re diving headfirst into a big splash around Java 25 and all the updates it brings along. Then, as always, you’ll find plenty of tech [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/10/java-annotated-monthly-october-2025/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Irina Mariasova",
      "published": "2025-10-06T08:15:08+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "a63921c896b31aaa",
      "title": "IntelliJ IDEA 2025.2.3 Is Out!",
      "description": "We’ve just released the next minor update for IntelliJ IDEA 2025.2 – v2025.2.3. You can update to this version from inside the IDE, via the Toolbox App, or by using snaps for Ubuntu. You can also download it from our website. This release includes the following improvements: To find out more about the resolved issues, [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/10/intellij-idea-2025-2-3/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Julia Shashkova",
      "published": "2025-10-02T18:33:54+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "7d8b36662fc2f1b1",
      "title": "How Java Open-Source Projects Use IntelliJ IDEA: Real-World Examples – Part 2",
      "description": "In Part 1 of this series, we introduced some of the Java community’s most recognized open-source projects. Now, we’re back with more standouts: projects that speed up builds, strengthen testing, and simplify working with modern web stacks. And as always, IntelliJ IDEA helps maintainers move faster, confidently, and with a focus on quality. 🌿 jsoup [&#8230;]",
      "url": "https://blog.jetbrains.com/blog/2025/09/26/how-java-open-source-projects-use-intellij-idea-real-world-examples-part-2/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Lena Morozova",
      "published": "2025-09-26T07:08:04+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "d28370b7fb25a1dd",
      "title": "Beyond the Vector API - A Quest for a Lower Level API #JVMLS",
      "description": "Throughout the project, the Vector API balanced providing a cross-platform API with staying close to the metal, performance-wise. While the project succeeded in that goal, the Vector API had to give up some important functionality when it didn't fit the design. As a result, the API became unsuitable for implementing an important class of vectorized algorithms that depend on access to particular hardware functionality. With recent progress in Project Panama (on the Foreign Function & Memory API a",
      "url": "https://inside.java/2025/11/16/jvmls-vector-api/",
      "source": "Inside.java (Oracle)",
      "author": "[\"VladimirIvanov\"]",
      "published": "2025-11-16T00:00:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "d25579aad254b8c5",
      "title": "Deep Dive into Gatherers - JEP Cafe #24",
      "description": "This JEP Café takes you through everything you can do with Gatherers, added to JDK 24 and available in JDK 25, the version you are going to use for your business applications. Along with many examples, it shows you the basics of mapping and filtering, how you can create and manage an internal mutable state to limit your stream, and sort them. It shows you how you can properly interrupt a stream when you need, and how you can avoid resource leaking and race conditions in the use of the API. It al",
      "url": "https://inside.java/2025/11/14/jepcafe24/",
      "source": "Inside.java (Oracle)",
      "author": "[\"JosePaumard\"]",
      "published": "2025-11-14T00:00:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "781902ce42317703",
      "title": "The Inside Java Newsletter: The Latest on JavaOne 2026",
      "description": "The Inside Java Newsletter for October 2025 focuses exclusively on planning for JavaOne 2026. Subscribe for updates via the links in the newsletter and we’ll see you in March 2026! Visit learn.java, dev.java, and inside.java for multimedia content for developers, learners, educators, and customers. See the newsletter archives, subscribe, and send to a friend!",
      "url": "https://inside.java/2025/11/12/inside-java-newsletter/",
      "source": "Inside.java (Oracle)",
      "author": "[\"JimGrisanzio\"]",
      "published": "2025-11-12T00:00:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "5e8ce442833dcf07",
      "title": "Serialization 2 0: A Marshalling Update!",
      "description": "Almost three decades have passed since the creation of Java Serialization—a feature which is widely frowned upon—and application requirements for externalization of objects have changed significantly.This presentation explains in which way requirements and constraints have changed, and how recent enhancements of the Java Language together with a simpler and clearer division of responsibilities can lead to a dramatically simpler, and safer, model for programmatically reasoning about the structure",
      "url": "https://inside.java/2025/11/10/devoxxbelgium-serialization2-0-marshalling-update/",
      "source": "Inside.java (Oracle)",
      "author": "[\"ViktorKlang\"]",
      "published": "2025-11-10T00:00:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "df16e97c9f617044",
      "title": "Pulling the (Foreign) String",
      "description": "The Foreign Function & Memory (FFM) API comes equipped with methods to read, writes strings from/to memory segments, as well as to allocate memory segments from existing Java strings. In this document we'll explore ways in which we can enhance the FFM API to support more efficient interoperability between strings and memory segments...",
      "url": "https://inside.java/2025/11/08/ffm-string/",
      "source": "Inside.java (Oracle)",
      "author": "[\"MaurizioCimadamore\"]",
      "published": "2025-11-08T00:00:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "330653954b86c792",
      "title": "The only good kind of Javascript is a Java Script",
      "description": "I just spent a bit too long trying to figure out how to script my Java scripts. I wanted to go as far as giving them a shebang line, but if I created a file called hello.java and put the following in",
      "url": "https://joshlong.com/jl/blogpost/java-scripts-in-java-25.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-10-05T00:00:00+00:00",
      "niche": "spring",
      "score": 10,
      "keywords": []
    },
    {
      "id": "8067f460cfb036f8",
      "title": "Java Scripts and JBang.dev",
      "description": "Let me start by saying: I just think this is really cool. It's not official or anything. Just super cool and only amounts to a few dozen lines of Java code that you could write yourself.",
      "url": "https://joshlong.com/jl/blogpost/java-scripts-and-jbang-dev.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-06-24T00:00:00+00:00",
      "niche": "spring",
      "score": 10,
      "keywords": []
    },
    {
      "id": "e4a45f27fcd9cc76",
      "title": "One Stop Guide to Java Functional Interfaces",
      "description": "Introduction to Functional Programming Functional programming is a paradigm that focuses on the use of functions to create clear and concise code.",
      "url": "https://reflectoring.io/one-stop-guide-to-java-functional-interfaces/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-06-11T00:00:00+11:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "3bcd85fcaf645687",
      "title": "7 Best Courses to learn Agentic AI in 2026",
      "description": "Hello guys, Agentic AI is emerging as one of the most exciting frontiers in artificial intelligence. Unlike traditional models that simply follow prompts, agentic AI systems can plan, reason, and take autonomous actions to achieve complex goals. These AI agents are already transforming how we build software, automate tasks, and interact with intelligent systems — and in 2026, mastering this technology will be a major advantage for developers, researchers, and tech professionals. Java, Unix, Tibc",
      "url": "http://javarevisited.blogspot.com/2025/11/7-best-courses-to-learn-agentic-ai-in.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-11-15T22:45:00-08:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "541a74e39ac4ff9f",
      "title": "ByteByteGo 50% Discount Offer — Should You Join ByteByteGo for System Design and Coding Interview Prep in 2026?",
      "description": "Hello guys, I have a great news for you, especially if you are preparing for your next career move or looking for your next Job. ByteByteGo, the platform founded by Alex Xu, author of the popular System Design Interview — An Insider’s Guide, is currently offering a limited-time 50% OFF deal on its yearly subscription. If you’re preparing for software engineering interviews — especially system design or high-level architecture roles — now is the best time to join as not just they are offering 50%",
      "url": "http://javarevisited.blogspot.com/2025/11/bytebytego-50-discount-offer-should-you.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-11-14T22:41:00-08:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "451e1b111f4d6a68",
      "title": "Is Exponent Good Place to Prepare for System Design and Tech Interview? Review",
      "description": "Hello guys, Preparing for FAANG or top-tier tech interviews is never easy. Between data structures and algorithms, system design, and behavioral questions, you need a structured and reliable approach. That’s where Exponent stands out. The tryExponent.com isn’t just another interview prep platform — it’s a complete ecosystem for software engineers, product managers, data scientists, designers, and technical leaders preparing for some of the most competitive roles in tech. With their current 70% O",
      "url": "http://javarevisited.blogspot.com/2025/11/is-exponent-good-place-to-prepare-for.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-11-13T20:12:00-08:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "ccd8763dcc1cd55b",
      "title": "Is 101 Blockchains Academy’s Premium Plan Really Worth It? (50% OFF)",
      "description": "Hello guys, the blockchain and Web3 space has evolved rapidly over the past few years. With new roles emerging in AI, FinTech, Web3, and enterprise blockchain, professionals are constantly looking for reliable platforms that offer structured, career-focused learning. Among the many platforms out there, 101 Blockchains Academy has positioned itself as one of the top destinations for professionals aiming to gain credibility through certifications and industry-recognized credentials. Java, Unix, Ti",
      "url": "http://javarevisited.blogspot.com/2025/11/is-101-blockchains-academys-premium.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-11-12T04:46:00-08:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "256bc49a8e5a11b8",
      "title": "Should You Join Bugfree.ai for System Design Interview Preparation in 2026? Review",
      "description": "Hello guys, If you’re preparing for system design interviews — especially for FAANG or top-tier tech roles — you’ve likely encountered Bugfree.ai. In the past, I have tried various online platforms to learn System Design like ByteByteGo but one thing I missed is online interactive practice, something like LeetCode where I can solve problems, get it evaluated and also get points to move up the leader board. During my search, I have recently come across this amazing platform and its the platform b",
      "url": "http://javarevisited.blogspot.com/2025/11/should-you-join-bugfreeai-for-system.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-11-09T22:21:00-08:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "7203a1a7fb39203f",
      "title": "JEP targeted to JDK 26: 524: PEM Encodings of Cryptographic Objects (Second Preview)",
      "description": "The following JEP is targeted to JDK 26: 524: PEM Encodings of Cryptographic Objects (Second Preview)",
      "url": "https://inside.java/2025/11/17/jep524-target-jdk26/",
      "source": "Inside.java (Oracle)",
      "author": "[\"AnthonyScarpino\"]",
      "published": "2025-11-17T00:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "267ec2bf9f7b69ee",
      "title": "Consider using JSON arrays instead of JSON objects for serialisation",
      "description": "When implementing the awesome MULTISET operator in jOOQ, its implementation mostly relied on SQL/JSON support of various RDBMS. In short, while standard SQL supports nested collections via ARRAY or MULTISET operators like this: This is poorly supported in most RDBMS, so jOOQ emulates it using SQL/JSON as follows (or similar): Wait a second. A JSON &#8230; Continue reading Consider using JSON arrays instead of JSON objects for serialisation &#8594;",
      "url": "https://blog.jooq.org/consider-using-json-arrays-instead-of-json-objects-for-serialisation/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2025-08-11T12:43:10+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "0d68161f32ae0ecc",
      "title": "When SQL Meets Lambda Expressions",
      "description": "ARRAY types are a part of the ISO/IEC 9075 SQL standard. The standard specifies how to: But it is very unopinionated when it comes to function support. The ISO/IEC 9075-2:2023(E) 6.47 &#60;array value expression> specifies concatenation of arrays, whereas the 6.48 &#60;array value function> section lists a not extremely useful TRIM_ARRAY function, exclusively (using which &#8230; Continue reading When SQL Meets Lambda Expressions &#8594;",
      "url": "https://blog.jooq.org/when-sql-meets-lambda-expressions/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2025-03-27T13:04:44+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "85cf0a292b76b046",
      "title": "Think About SQL MERGE in Terms of a RIGHT JOIN",
      "description": "RIGHT JOIN is an esoteric feature in the SQL language, and hardly ever seen in the real world, because almost every RIGHT JOIN can just be expressed as an equivalent LEFT JOIN. The following two statements are equivalent: It&#8217;s not unreasonable to expect these two statements to produce the same execution plan on most RDBMS, &#8230; Continue reading Think About SQL MERGE in Terms of a RIGHT JOIN &#8594;",
      "url": "https://blog.jooq.org/think-about-sql-merge-in-terms-of-a-right-join/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2025-03-13T14:45:53+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "664e46b9880cd0b9",
      "title": "Resisting the Urge to Document Everything Everywhere",
      "description": "Every product manager knows this situation: This is such a common pattern, and while it&#8217;s perfectly understandable for such a user to request this, it is so terribly wrong to give in to this user&#8217;s request. Why is it wrong? The features are unrelated Most of the time, the two features X1 and X2 are &#8230; Continue reading Resisting the Urge to Document Everything Everywhere &#8594;",
      "url": "https://blog.jooq.org/resisting-the-urge-to-document-everything-everywhere/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2025-02-28T10:39:07+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "9b398769e8caf446",
      "title": "jOOQ 3.20 released with ClickHouse, Databricks, and much more DuckDB support, new modules, Oracle type hierarchies, more spatial support, decfloat and synonym support, hidden columns, Scala 3, Kotlin 2, and much more",
      "description": "New dialects: jOOQ 3.20 ships with 2 new experimental dialects: ClickHouse is a fast-moving SQL dialect with a historic vendor-specific syntax that is gradually migrated to a more standards compliant alternative, which is why our support is still experimental. A lot of behaviours differ from what one would expect elsewhere, including NULL handling, which is &#8230; Continue reading jOOQ 3.20 released with ClickHouse, Databricks, and much more DuckDB support, new modules, Oracle type hierarchies,",
      "url": "https://blog.jooq.org/jooq-3-20-released-with-clickhouse-databricks-and-much-more-duckdb-support-new-modules-oracle-type-hierarchies-more-spatial-support-decfloat-and-synonym-support-hidden-columns-scala-3-kotlin/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2025-02-20T10:27:54+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "b6a2846d45681045",
      "title": "Emulating SQL FILTER with Oracle JSON Aggregate Functions",
      "description": "A cool standard SQL:2003 feature is the aggregate FILTER clause, which is supported natively by at least these RDBMS: The following aggregate function computes the number of rows per group which satifsy the FILTER clause: This is useful for pivot style queries, where multiple aggregate values are computed in one go. For most basic types &#8230; Continue reading Emulating SQL FILTER with Oracle JSON Aggregate Functions &#8594;",
      "url": "https://blog.jooq.org/emulating-sql-filter-with-oracle-json-aggregate-functions/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2024-06-03T12:17:41+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "055027c5db6593aa",
      "title": "Getting Top 1 Values Per Group in Oracle",
      "description": "I&#8217;ve blogged about generic ways of getting top 1 or top n per category queries before on this blog. An Oracle specific version in that post used the arcane KEEP syntax: This is a bit difficult to read when you see it for the first time. Think of it as a complicated way to say &#8230; Continue reading Getting Top 1 Values Per Group in Oracle &#8594;",
      "url": "https://blog.jooq.org/getting-top-1-values-per-group-in-oracle/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2024-03-01T09:55:41+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "0a02af77d1d1c22d",
      "title": "An Efficient Way to Check for Existence of Multiple Values in SQL",
      "description": "In a previous blog post, we&#8217;ve advertised the use of SQL EXISTS rather than COUNT(*) to check for existence of a value in SQL. I.e. to check if in the Sakila database, actors called WAHLBERG have played in any films, instead of: Do this: (Depending on your dialect you may require a FROM DUAL clause, &#8230; Continue reading An Efficient Way to Check for Existence of Multiple Values in SQL &#8594;",
      "url": "https://blog.jooq.org/an-efficient-way-to-check-for-existence-of-multiple-values-in-sql/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2024-02-16T14:16:45+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "f5da49f9884ad216",
      "title": "A Hidden Benefit of Implicit Joins: Join Elimination",
      "description": "One of jOOQ&#8217;s key features so far has always been to render pretty much exactly the SQL that users expect, without any surprises &#8211; unless some emulation is required to make a query work, of course. This means that while join elimination is a powerful feature of many RDBMS, it isn&#8217;t part of jOOQ&#8217;s feature &#8230; Continue reading A Hidden Benefit of Implicit Joins: Join Elimination &#8594;",
      "url": "https://blog.jooq.org/a-hidden-benefit-of-implicit-joins-join-elimination/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2024-01-10T14:19:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "8b11778798181f4e",
      "title": "jOOQ 3.19’s new Explicit and Implicit to-many path joins",
      "description": "jOOQ 3.19 finally delivers on a set of features that will greatly simplify your queries further, after jOOQ 3.11 introduced implicit to-one joins: What are these features? Many ORMs (e.g. JPA, Doctrine, jOOQ 3.11 and others) support &#8220;path joins&#8221; (they may have different names for this concept). A path join is a join derived from &#8230; Continue reading jOOQ 3.19&#8217;s new Explicit and Implicit to-many path joins &#8594;",
      "url": "https://blog.jooq.org/jooq-3-19s-new-explicit-and-implicit-to-many-path-joins/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2023-12-28T14:35:14+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "30b6d12b9334d484",
      "title": "How to Install Java on Windows (Step-by-Step Guide)",
      "description": "Learn how to install Java 21 (Oracle and Temurin) on Windows with screenshots and easy-to-follow instructions. The post How to Install Java on Windows (Step-by-Step Guide) appeared first on Mkyong.com.",
      "url": "https://mkyong.com/java/how-to-install-java-on-windows-step-by-step-guide/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-07-25T06:45:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "5dc982c3dd276654",
      "title": "Micronaut + Flyway Database Schema Migrations",
      "description": "Learn how to integrate Flyway with Micronaut to manage database schema migrations effortlessly. This guide covers Flyway scripts, PostgreSQL, Docker, and full CRUD examples with tests. The post Micronaut + Flyway Database Schema Migrations appeared first on Mkyong.com.",
      "url": "https://mkyong.com/micronaut/micronaut-flyway-database-schema-migrations/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-04-01T02:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "6407335a6a427050",
      "title": "List all available features in the Micronaut CLI (mn)",
      "description": "In the Micronaut CLI mn, we can use mn create-app --list-features to list all available features. Table of Contents 1. List All Feature 2. Filter Features 3. Download Source Code 4. References P.S. Tested with Micronaut 4.7.6 1. List All Feature Terminal mn create-app --list-features This will output a categorized list of features like: Terminal ... Read more The post List all available features in the Micronaut CLI (mn) appeared first on Mkyong.com.",
      "url": "https://mkyong.com/micronaut/list-all-available-features-in-the-micronaut-cli-mn/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-21T02:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "c2c77ac662900012",
      "title": "Micronaut Logging using Logback",
      "description": "Discover how to efficiently implement logging in your Micronaut applications using default Logback framework. Logging to the console, standard files, and rolling files with practical examples. The post Micronaut Logging using Logback appeared first on Mkyong.com.",
      "url": "https://mkyong.com/micronaut/micronaut-logging-examples/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-18T03:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "3864961b61c64116",
      "title": "Return ZIP file in a Micronaut Controller",
      "description": "In this tutorial, we will create a Micronaut REST API that generates and returns a ZIP file for download. Table of contents 1. Create a Micronaut Controller 2. Unit Testing the Controller 3. Run the Application 4. Download Source Code 5. References Technologies used: Java 21 Micronaut 4.7.6 Maven 3.9.6 1. Create a Micronaut Controller ... Read more The post Return ZIP file in a Micronaut Controller appeared first on Mkyong.com.",
      "url": "https://mkyong.com/micronaut/return-zip-file-in-a-micronaut-controller/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-11T03:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "83032fc0a7b03bfb",
      "title": "Working Gzip and tar.gz file in Kotlin",
      "description": "This article shows how we can compress, update, and decompress multiple files and folders into a tar.gz file using Kotlin. Table of contents: 1. Gzip vs. Java Zip 2. Add Apache Commons Compress Dependency 3. Compressing Files and Folders into a tar.gz 3.1 file name is too long (&#62;100 bytes) 4. Decompressing a tar.gz File ... Read more The post Working Gzip and tar.gz file in Kotlin appeared first on Mkyong.com.",
      "url": "https://mkyong.com/kotlin/working-with-gzip-file-tar-gz-in-kotlin/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-10T02:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "bd3b73a053f04056",
      "title": "How to compress and decompress zip file in Kotlin",
      "description": "In this tutorial, we&#8217;ll explore how to create ZIP files, add multiple files and folders to a zip file, add files to an and decompress files using Kotlin. Table of contents: 1. Adding Multiple Files to a ZIP File 2. Adding Multiple Folders to a ZIP File 3. Adding Multiple Files or Directories to an ... Read more The post How to compress and decompress zip file in Kotlin appeared first on Mkyong.com.",
      "url": "https://mkyong.com/kotlin/how-to-compress-and-decompress-zip-file-in-kotlin/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-09T02:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "b7acead879fb50f3",
      "title": "Return Excel file in a Micronaut Controller",
      "description": "In this tutorial, we will learn how to return a Excel file .xlsx in a Micronaut controller using Apache POI. Table of contents 1. Add Apache POI Dependency 2. Create the Excel Service 3. Create the Controller to return Excel file 4. Run the Application 5. Testing the Excel Download Endpoint 6. Download Source Code ... Read more The post Return Excel file in a Micronaut Controller appeared first on Mkyong.com.",
      "url": "https://mkyong.com/micronaut/return-excel-file-in-a-micronaut-controller/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-07T03:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "3fd22ddf47a73916",
      "title": "Return PDF file in a Micronaut Controller",
      "description": "In this tutorial, we will create a Micronaut REST API that generates and returns a PDF file using OpenPDF. Table of contents 1. Add OpenPDF Dependency 2. Creating the PDF Controller 3. Testing the API 4. Writing Unit Tests 5. FAQs 6. Download Source Code 7. References Technologies used: Java 21 Micronaut 4.7.6 Maven 3.9.6 ... Read more The post Return PDF file in a Micronaut Controller appeared first on Mkyong.com.",
      "url": "https://mkyong.com/micronaut/return-pdf-file-in-a-micronaut-controller/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-06T03:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "77a17c7c08583ef3",
      "title": "Sorcery with WebAssembly, GraalVM, and Java!",
      "description": "Alternative title: How I like to write my JavaScripts: in Java via WebAssembly!",
      "url": "https://joshlong.com/jl/blogpost/my-first-java-script-script-with-graalvm-and-webassembly.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-03-28T00:00:00+00:00",
      "niche": "spring",
      "score": 8,
      "keywords": []
    },
    {
      "id": "714a7225fa3062da",
      "title": "ChatGPT's new \"Work with\" feature, MCP, and more",
      "description": "update: Sam Altman just announced official support for MCP!",
      "url": "https://joshlong.com/jl/blogpost/chatgpt-work-with-and-mcp-ai.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-03-25T00:00:00+00:00",
      "niche": "spring",
      "score": 8,
      "keywords": []
    },
    {
      "id": "4f565bbf2ccb82f8",
      "title": "Using Buildpacks on Java 24",
      "description": "Want to use Buildpacks with Java 24 and native images?",
      "url": "https://joshlong.com/jl/blogpost/java24-buildpacks.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-03-21T00:00:00+00:00",
      "niche": "spring",
      "score": 8,
      "keywords": []
    },
    {
      "id": "ca41348c19d72095",
      "title": "JEP targeted to JDK 26: 516: Ahead-of-Time Object Caching with Any GC",
      "description": "The following JEP is targeted to JDK 26: 516: Ahead-of-Time Object Caching with Any GC",
      "url": "https://inside.java/2025/11/13/jep516-target-jdk26/",
      "source": "Inside.java (Oracle)",
      "author": "[\"ErikOsterlund\"]",
      "published": "2025-11-13T00:00:00+00:00",
      "niche": "spring",
      "score": 7,
      "keywords": []
    },
    {
      "id": "a393853bff4b6201",
      "title": "Micronaut Logging using Log4j2",
      "description": "In this article, we show how to set up and use Log4j2 for logging in a Micronaut application. The post Micronaut Logging using Log4j2 appeared first on Mkyong.com.",
      "url": "https://mkyong.com/micronaut/micronaut-logging-using-log4j2/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-22T03:00:00+00:00",
      "niche": "spring",
      "score": 7,
      "keywords": []
    }
  ]
}