{
  "last_updated": "2025-10-14T18:39:40.496923+00:00",
  "total_articles": 56,
  "articles": [
    {
      "id": "5c5c60daccfcd377",
      "title": "Introducing Share Consumer Support (Kafka Queues) in Spring for Apache Kafka",
      "description": "Continuing our Road to GA series, this week we're exploring Share Groups in Apache Kafka 4.0.0 and their integration in Spring for Apache Kafka 4.0.0 - a feature that fundamentally expands how we can consume messages from Kafka topics. When we first start working with Kafka, the mental model is straightforward: topics hold messages, consumers read them, and processing happens in order within partitions. This partition-based model has served countless applications well, providing ordered processi",
      "url": "https://spring.io/blog/2025/10/14/introducing-spring-kafka-share-consumer",
      "source": "Spring Blog (Official)",
      "author": "sobychacko",
      "published": "2025-10-14T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "5145ee33a71cddb9",
      "title": "Spring Session Hazelcast: Now Led by Hazelcast Team",
      "description": "It gives me great pleasure to announce that the Spring Session Hazelcast project will now be led by the Hazelcast Team. [!NOTE] This announcement is in alignment with our announcement Spring Session MongoDB: Now Led by MongoDB Team. For ten years Spring Session has provided the infrastructure for transparently replacing session stores in a vendor independent manner. With that infrastructure in place, it is just a matter of implementing SessionRepository javadoc in order to support storing sessio",
      "url": "https://spring.io/blog/2025/10/14/spring-session-hazelcast-new-leadership",
      "source": "Spring Blog (Official)",
      "author": "rwinch",
      "published": "2025-10-14T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "59fb010bbe514e0b",
      "title": "Spring Session MongoDB: Now Led by MongoDB Team",
      "description": "It gives me great pleasure to announce that the Spring Session MongoDB project will now be led by the MongoDB Team. [!NOTE] This announcement is in alignment with our announcement Spring Session Hazelcast: Now Led by Hazelcast Team. For ten years Spring Session has provided the infrastructure for transparently replacing session stores in a vendor independent manner. With that infrastructure in place, it is just a matter of implementing SessionRepository javadoc in order to support storing sessio",
      "url": "https://spring.io/blog/2025/10/14/spring-session-mongodb-new-leadership",
      "source": "Spring Blog (Official)",
      "author": "rwinch",
      "published": "2025-10-14T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "e6e6243249c4e64c",
      "title": "This Week in Spring - October 14th, 2025",
      "description": "Hi, Spring fans! Welcome to another installment of This Week in Spring! I'm in Boston and New York city and Bulgaria and Poland this week, but I'm still hyped about last week's amazing Devoxx Belgium event! There are a ton of videos to look at, and I'll include just some of them here. So, without further ado, let's dive into it! the road to GA is long and amazing, and this newest post by Soby Chacko looks at the new shared consumer support in Spring for Apache Kafka good news everybody! Spring S",
      "url": "https://spring.io/blog/2025/10/14/this-week-in-spring-october-14th-2025",
      "source": "Spring Blog (Official)",
      "author": "joshlong",
      "published": "2025-10-14T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "9f95779817bfbf90",
      "title": "Building Effective Agents with Spring AI",
      "description": "Explore Antropic's publication on Effective AI Agents and implement of each pattern using agents with Spring AI The post Building Effective Agents with Spring AI first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/926217056/0/baeldung",
      "source": "Baeldung",
      "author": "Stelios Anastasakis",
      "published": "2025-10-14T01:39:02+00:00",
      "niche": "spring",
      "score": 44,
      "keywords": []
    },
    {
      "id": "add479209b1f0295",
      "title": "Spring Batch 6.0.0-M4 released",
      "description": "I am pleased to announce that Spring Batch 6.0.0-M4 is now available from Maven Central! The main changes in this milestone release are the following: Migration to nullability checks with jSpecify Improved domain model design For the complete list of changes, please check the release notes here. Null safety with JSpecify Spring Batch 6.0 APIs are now annotated with JSpecify annotations to provide better null-safety guarantees and improve code quality. This change helps developers catch potential",
      "url": "https://spring.io/blog/2025/10/09/spring-batch-6-0-0-m4-released",
      "source": "Spring Blog (Official)",
      "author": "fmbenhassine",
      "published": "2025-10-09T00:00:00+00:00",
      "niche": "spring",
      "score": 38,
      "keywords": []
    },
    {
      "id": "dcb4189c9604f936",
      "title": "Java Abstract Method with a Variable Number of Arguments Example",
      "description": "In this article, let us delve into understanding how to implement an abstract method with variable list of arguments in Java and how to make it type-safe and maintainable. We explore the limitations of using varargs and introduce a cleaner design using a typed context object approach for better readability and extensibility. 1. Introduction In &#8230;",
      "url": "https://www.javacodegeeks.com/java-abstract-method-with-a-variable-number-of-arguments-example.html",
      "source": "Java Code Geeks",
      "author": "Yatin Batra",
      "published": "2025-10-14T15:48:00+00:00",
      "niche": "spring",
      "score": 33,
      "keywords": []
    },
    {
      "id": "9b6cb73a875483f5",
      "title": "Testing gRPC Services in Java",
      "description": "gRPC is a high-performance RPC framework that uses protocol buffers for defining services and messages. For reliable systems, you should unit test your service logic. For gRPC services, it is common to test the service implementation with an InProcessServer (no network) and an InProcessChannel client. That lets you verify behavior end-to-end while keeping tests fast &#8230;",
      "url": "https://www.javacodegeeks.com/testing-grpc-services-in-java.html",
      "source": "Java Code Geeks",
      "author": "Yatin Batra",
      "published": "2025-10-14T13:36:35+00:00",
      "niche": "spring",
      "score": 33,
      "keywords": []
    },
    {
      "id": "aad302a28edd2d0a",
      "title": "Continuous Delivery for Django Apps with Kubernetes: Blue/Green & Canary Deployments",
      "description": "As web applications scale and user expectations for uptime grow, traditional deployment methods become insufficient. Continuous Delivery (CD) bridges this gap by enabling faster, safer, and more reliable releases. For Django developers, combining CD pipelines with Kubernetes deployment strategies—like Blue/Green and Canary releases—offers a powerful path to continuous evolution without service interruption. In this article, &#8230;",
      "url": "https://www.javacodegeeks.com/2025/10/continuous-delivery-for-django-apps-with-kubernetes-blue-green-canary-deployments.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2025-10-14T16:03:00+00:00",
      "niche": "spring",
      "score": 33,
      "keywords": []
    },
    {
      "id": "e23da48b449d7485",
      "title": "Combine (Concatenate) Two Data Frames With the Same Column Name in Java",
      "description": "Explore how to combine or concatenate two DataFrames with the same column name in Java using Apache Spark. The post Combine (Concatenate) Two Data Frames With the Same Column Name in Java first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/926166611/0/baeldung",
      "source": "Baeldung",
      "author": "baeldung",
      "published": "2025-10-12T22:16:55+00:00",
      "niche": "spring",
      "score": 32,
      "keywords": []
    },
    {
      "id": "7898d42c1bb1292f",
      "title": "How to Scroll an Element Into View in Selenium",
      "description": "Learn how to scroll to and work with off-screen elements in Java Selenium. The post How to Scroll an Element Into View in Selenium first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;  CommentsIn reply to fantaman. Thanks for the feedback, Fantaman. ... by Ulisses LimaI think this technique needs some different motivation, since ... by fantaman&#160;",
      "url": "https://feeds.feedblitz.com/~/926131535/0/baeldung",
      "source": "Baeldung",
      "author": "Maurice Maina",
      "published": "2025-10-12T01:53:58+00:00",
      "niche": "spring",
      "score": 32,
      "keywords": []
    },
    {
      "id": "992d1d0c0d62f911",
      "title": "Java Serialization with Non Serializable Parts",
      "description": "Learn how to use Java serialization when an object contains fields that were not designed to be serialized. The post Java Serialization with Non Serializable Parts first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/926131538/0/baeldung",
      "source": "Baeldung",
      "author": "Graham Cox",
      "published": "2025-10-12T01:47:04+00:00",
      "niche": "spring",
      "score": 32,
      "keywords": []
    },
    {
      "id": "115093bb38c4ae15",
      "title": "Linear and Affine Types for Memory-Bounded Model Serving",
      "description": "Modern AI systems increasingly rely on deploying large machine learning models efficiently at scale. Yet, one of the most pressing challenges in model serving—especially at the edge or in memory-constrained environments—is how to manage memory safely and predictably. This is where linear and affine types, concepts from type theory and modern programming languages such as &#8230;",
      "url": "https://www.javacodegeeks.com/2025/10/linear-and-affine-types-for-memory-bounded-model-serving.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2025-10-14T04:47:00+00:00",
      "niche": "spring",
      "score": 29,
      "keywords": []
    },
    {
      "id": "81481648b9445419",
      "title": "IoT Security Best Practices – Using Eclipse Projects to Secure Data at the Edge",
      "description": "As the Internet of Things (IoT) continues to expand, the edge has become the new frontier for data processing and security. Devices operating at the edge often handle sensitive data—sometimes in environments where network connectivity is unreliable or where central oversight is limited. This makes edge security both a necessity and a challenge. Fortunately, the &#8230;",
      "url": "https://www.javacodegeeks.com/2025/10/iot-security-best-practices-using-eclipse-projects-to-secure-data-at-the-edge.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2025-10-13T16:18:00+00:00",
      "niche": "spring",
      "score": 29,
      "keywords": []
    },
    {
      "id": "09037c3675c0329c",
      "title": "How To – Structured Logging with Spring Boot",
      "description": "Last Updated on November 14, 2024 by jt Support for Structured Logging is a new Spring Boot feature introduced with the Spring Boot 3.4.0 release. Structured Logging is fairly common to use in distributed environments where you are using some type of consolidated logging. Typically, you will use a JSON log format to allow for [&#8230;]Continue reading The post How To – Structured Logging with Spring Boot first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-structured-logging-with-spring-boot/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-11-11T17:58:27+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "b389034d1298c7dc",
      "title": "How to Convert a String to char in Java",
      "description": "Last Updated on October 28, 2024 by jt Converting a String to char is a common task in Java. Java provides several ways to achieve this. In this blog post, we’ll cover the primary methods and highlight when to use each one. String to char Using charAt() Method The most common way to convert a [&#8230;]Continue reading The post How to Convert a String to char in Java first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-convert-a-string-to-char-in-java/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-28T15:08:56+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "bfc73f15b55b0893",
      "title": "How to Use – Java if else statement",
      "description": "Last Updated on October 26, 2024 by jt The if else statement is a fundamental control structures in Java.. This structure evaluates conditions and executes code based on whether those conditions are true or false. Let’s look at how to use if, if else, and else if statements effectively. The Java if Statement An if [&#8230;]Continue reading The post How to Use – Java if else statement first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-use-java-if-else-statement/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-26T12:01:06+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "1898c7a2cfd791f1",
      "title": "How to Use the Java Substring Method",
      "description": "Last Updated on October 25, 2024 by jt The substring() method in Java is a tool for manipulating strings. It allows you to extract a portion of a string by specifying a start index, and optionally, an end index. Basic Usage of substring() The Java substring() method has two variations: In this example: Important Details [&#8230;]Continue reading The post How to Use the Java Substring Method first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-use-the-java-substring-method/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-25T13:27:36+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "e6ff7d376dd1b6b6",
      "title": "How To Convert int to String in Java",
      "description": "Last Updated on October 22, 2024 by jt Converting an int to a String is a common task in Java, especially when working with user interfaces, file output, or JSON formatting. Java provides several ways to perform this conversion, each with different use cases and characteristics. In this blog post, I will cover the most [&#8230;]Continue reading The post How To Convert int to String in Java first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-convert-int-to-string-in-java/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-22T17:16:03+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "fc6837ada1289eb3",
      "title": "How to Convert String to int in Java",
      "description": "Last Updated on October 22, 2024 by jt String to int conversions are a common task in Java, especially when dealing with user input or API calls. Java provides several ways to perform this conversion. This blog post will cover the most common methods for converting a String to an Integer and cover best practices [&#8230;]Continue reading The post How to Convert String to int in Java first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-convert-string-to-integer-in-java/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-22T13:40:16+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "92dd433b17e63923",
      "title": "How to The Jackson Object Mapper with JSON",
      "description": "Last Updated on October 22, 2024 by jt Introduction As a Java developer, a common task you&#8217;ll encounter is converting between Java objects and JSON. The Jackson library is a powerful and widely used tool for this purpose. Whether you&#8217;re building RESTful APIs, microservices, or simply handling JSON data in your application, Jackson&#8217;s ObjectMapper class [&#8230;]Continue reading The post How to The Jackson Object Mapper with JSON first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-the-jackson-object-mapper-with-json/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-20T16:40:39+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "d64890d08a5a5184",
      "title": "How To – The Java XOR Operator",
      "description": "This tutorial covers the Java XOR operator, represented by the ^ symbol, which operates on boolean and integer types. It explains how XOR functions as a logical operator for booleans, returning true for different values, and performs a bitwise operation for integers, illustrating with examples and truth tables. The post How To – The Java XOR Operator first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/the-java-xor-operator/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-18T19:20:45+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "dc447e3a43e1699d",
      "title": "How to Create Dynamic Output with the Java printf() Method",
      "description": "Last Updated on October 22, 2024 by jt The Java printf() output method is used to generate a formatted string. Data from the arguments is written and formatted placeholders. In this tutorial we will explore the functionality of the printf() method. The Java language was heavily inspired by the C programming language. As such, the [&#8230;]Continue reading The post How to Create Dynamic Output with the Java printf() Method first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/java-output-printf-method/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-16T19:16:02+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "337d41ea885f7452",
      "title": "How to Use Structured Outputs with Spring AI",
      "description": "Last Updated on October 20, 2024 by jt What are Structured Outputs? Using Structured Outputs is an important aspect when interacting with LLMs programmatically. LLMs, by their nature, generate unstructured output. The unstructured output does not work well with programming languages which need structure to understand the data. Through prompting techniques, you can direct the [&#8230;]Continue reading The post How to Use Structured Outputs with Spring AI first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/using-structured-outputs-with-spring-ai/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-14T17:50:44+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "40656eefd0081fbc",
      "title": "Why I Fired Google and Gave an AI Chatbot a Shot?",
      "description": "Like many developers, I used Google and Stack Overflow to solve problems, explore new tools, and learn new skills. I wasn't happy with these tools, but they were all I got. When the first AI tools were released, I was skeptical and pretty much ignored them. However, last year I decided to bite the bullet and got the Plus subscription of ChatGPT. In this post, I’ll describe why I decided to give an AI chatbot a shot. Read More The post Why I Fired Google and Gave an AI Chatbot a Shot? appeared fi",
      "url": "https://feeds.feedblitz.com/~/924349763/0/petrikainulainen~Why-I-Fired-Google-and-Gave-an-AI-Chatbot-a-Shot/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-09-04T15:49:16+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "d5c790cd3d095f3a",
      "title": "[FREE EBOOKS] The Profitable AI Advantage, OpenAI API Cookbook & Four More Best Selling Titles",
      "description": "Hello fellow geeks, Fresh offers await you on our Information Technology Research Library, please have a look! The Profitable AI Advantage : A business leader&#8217;s guide to designing and delivering AI roadmaps for measurable results ($35.98 Value) FREE for a Limited Time Artificial Intelligence has the power to dramatically enhance business performance&#8211;but knowing where to &#8230;",
      "url": "https://www.javacodegeeks.com/2025/10/free-ebooks-the-profitable-ai-advantage-openai-api-cookbook-four-more-best-selling-titles.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2025-10-11T10:30:30+00:00",
      "niche": "spring",
      "score": 25,
      "keywords": []
    },
    {
      "id": "6bda3c02c84c5f9d",
      "title": "How to Fix Cross-Origin Errors",
      "description": "Cross-Origin errors are among the most common challenges we face when building web applications that connect frontends and backends hosted on different origins. Browsers enforce strict security mechanisms that can block such requests, leading to the infamous CORS policy error. In this guide, we’ll explore the Same Origin Policy (SOP), the foundation of browser security, &#8230;",
      "url": "https://www.javacodegeeks.com/how-to-fix-cross-origin-errors.html",
      "source": "Java Code Geeks",
      "author": "Omozegie Aziegbe",
      "published": "2025-10-13T14:32:00+00:00",
      "niche": "spring",
      "score": 21,
      "keywords": []
    },
    {
      "id": "414d005b87f822e8",
      "title": "How to Retrieve Servlet Context in Java",
      "description": "In Java web applications, the ServletContext object provides a way to communicate with the servlet container and access application-level parameters and resources. It is shared across all servlets in the same web application and can be used to store global data. Let us delve into understanding the Java Servlet Context and its importance in building &#8230;",
      "url": "https://www.javacodegeeks.com/how-to-retrieve-servlet-context-in-java.html",
      "source": "Java Code Geeks",
      "author": "Yatin Batra",
      "published": "2025-10-13T06:54:00+00:00",
      "niche": "spring",
      "score": 21,
      "keywords": []
    },
    {
      "id": "39de71bd8cd79ba4",
      "title": "Eclipse IDE Power Tips: Boosting Productivity with Hidden Features",
      "description": "Integrated Development Environments (IDEs) like Eclipse are powerful—but many developers only scratch the surface of what they offer. Over years of working with Eclipse (especially for Java), I’ve discovered a set of “secret weapons” — lesser-known features, tweaks, and workflows — that consistently shave time off day-to-day work. In this article, I’ll walk you through &#8230;",
      "url": "https://www.javacodegeeks.com/2025/10/eclipse-ide-power-tips-boosting-productivity-with-hidden-features.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2025-10-13T06:07:00+00:00",
      "niche": "spring",
      "score": 21,
      "keywords": []
    },
    {
      "id": "1a2c715a937ef0ed",
      "title": "[DEALS] Sterling Stock Picker: Lifetime Subscription (85% off) & Other Deals Up To 98% Off – Offers End Soon!",
      "description": "Hello fellow geeks, Fresh offers await you on our Deals store, please have a look! Sterling Stock Picker: Lifetime Subscription (85% off) Ending soon // by Java Code Geeks Invest Smarter with an Award-Winning Stock Picker Software! Unlock Exclusive Stock Picks, AI-Driven Insights &#38; A Done-For-You Portfolio Builder Microsoft Visual Studio Professional 2022 + The &#8230;",
      "url": "https://www.javacodegeeks.com/2025/10/deals-sterling-stock-picker-lifetime-subscription-85-off-other-deals-up-to-98-off-offers-end-soon-3.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2025-10-12T10:30:30+00:00",
      "niche": "spring",
      "score": 21,
      "keywords": []
    },
    {
      "id": "442254711479f33b",
      "title": "Constructor vs initialize() Method in OpenJFX",
      "description": "Learn how a constructor differs from initialize() in JavaFX. The post Constructor vs initialize() Method in OpenJFX first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/926039783/0/baeldung",
      "source": "Baeldung",
      "author": "Haidar Ali",
      "published": "2025-10-10T01:36:19+00:00",
      "niche": "spring",
      "score": 16,
      "keywords": []
    },
    {
      "id": "3d918eeea1517d5d",
      "title": "Java Weekly, Issue 615",
      "description": "Spring Boot 4 is embracing Jackson 3 and using the reactive Context properly. A solid week. The post Java Weekly, Issue 615 first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/925941575/0/baeldung",
      "source": "Baeldung",
      "author": "baeldung",
      "published": "2025-10-08T09:07:10+00:00",
      "niche": "spring",
      "score": 16,
      "keywords": []
    },
    {
      "id": "e058c5aac50532aa",
      "title": "Generating HTTP Clients in Spring Boot from OpenAPI Spec",
      "description": "Learn how to auto-generate client code using OpenAPI Specification and the OpenAPI Maven plugin The post Generating HTTP Clients in Spring Boot from OpenAPI Spec first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/925869017/0/baeldung",
      "source": "Baeldung",
      "author": "Pedro Lopes",
      "published": "2025-10-07T01:55:23+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "c04601c82e6a3260",
      "title": "Getting the List of All Keys Under a JSONObject Using GSON",
      "description": "Build a simple recursive utility to extract all keys from a JsonObject using GSON The post Getting the List of All Keys Under a JSONObject Using GSON first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/925822952/0/baeldung",
      "source": "Baeldung",
      "author": "Neetika Khandelwal",
      "published": "2025-10-06T01:02:26+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "116390ea9f853573",
      "title": "Usually $499, Visual Studio Pro Is Now $10",
      "description": "Developers often juggle multiple tools to build and manage software. Visual Studio Professional 2022 reduces that need by consolidating coding, debugging, and collaboration in one environment. Normally $499, you can now get a&#160;Visual Studio Pro 2022 lifetime license&#160;for $9.97. With Visual Studio Pro, you can Build desktop, web, and mobile apps with one IDE Debug &#8230;",
      "url": "https://www.javacodegeeks.com/2025/10/usually-499-visual-studio-pro-is-now-10.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2025-10-11T07:40:00+00:00",
      "niche": "spring",
      "score": 13,
      "keywords": []
    },
    {
      "id": "cf21ff0fb4470d14",
      "title": "Hibernate Performance Tuning – 2025 Edition",
      "description": "The post Hibernate Performance Tuning &#8211; 2025 Edition appeared first on Thorben Janssen. Based on most discussions online and at conferences, there seem to be 2 kinds of projects that use Hibernate for their persistence layer: So, what&#8217;s the difference between these projects? Are the projects in the 2nd group more complex or have higher performance requirements? No, based on my consulting projects, that&#8217;s not the case. On... The post Hibernate Performance Tuning &#8211; 2025 Edi",
      "url": "https://thorben-janssen.com/hibernate-performance-tuning/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2025-01-15T09:15:54+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "e2a54fda8458da1b",
      "title": "Date and Time Mappings with Hibernate and JPA",
      "description": "The post Date and Time Mappings with Hibernate and JPA appeared first on Thorben Janssen. Databases support various data types to store date and time information. The most commonly used ones are: You can map all of them with JPA and Hibernate. But you need to decide to which Java type you want to map your database column. The Java language supports a bunch of classes to represent date and... The post Date and Time Mappings with Hibernate and JPA appeared first on Thorben Janssen.",
      "url": "https://thorben-janssen.com/hibernate-jpa-date-and-time/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-12-04T11:55:40+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "577a5c7ec21c998a",
      "title": "AI Glossary for Java Developers",
      "description": "The post AI Glossary for Java Developers appeared first on Thorben Janssen. Most Java developers encounter problems when learning how to integrate AI into their applications using SpringAI, Langchain4J, or some other library. AI introduces many new terms, acronyms, and techniques you must understand to build a good system. I ran into the same issue when I started learning about AI. In this article, I did my... The post AI Glossary for Java Developers appeared first on Thorben Janssen.",
      "url": "https://thorben-janssen.com/ai-glossary-for-java-developers/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-07-03T14:00:48+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "3c49da9852171ddc",
      "title": "How to define a repository with Jakarta Data and Hibernate",
      "description": "The post How to define a repository with Jakarta Data and Hibernate appeared first on Thorben Janssen. Repositories are a commonly used pattern for persistence layers. They abstract from the underlying data store or persistence framework and hide the technical details from your business code. Using Jakarta Data, you can easily define such a repository as an interface, and you&#8217;ll get an implementation of it based on Jakarta Persistence or Jakarta NoSQL.... The post How to define a repositor",
      "url": "https://thorben-janssen.com/jakarta-data-repository/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-06-26T06:51:10+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "37af0b4b5e585dd4",
      "title": "Getting Started with Jakarta Data and Hibernate",
      "description": "The post Getting Started with Jakarta Data and Hibernate appeared first on Thorben Janssen. Jakarta Data standardizes stateless repositories based on Jakarta Persistence and Jakarta NoSQL so that you can concentrate on your business code instead of handling the technical details of simple queries. In this article, I will briefly introduce the new specification and give you an overview of its stateless repositories. In future articles, we will dive... The post Getting Started with Jakarta Data an",
      "url": "https://thorben-janssen.com/getting-started-with-jakarta-data/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-06-19T07:50:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "42dc68c1b0d8b255",
      "title": "Should your tests manage transactions?",
      "description": "The post Should your tests manage transactions? appeared first on Thorben Janssen. During my Spring Data JPA workshops and talks, I often get asked if a test case should handle transactions, or not. And if it handles the transaction if it should commit it or roll it back. And as so often, the short answer is: it depends. The slightly longer answer is: it depends on the... The post Should your tests manage transactions? appeared first on Thorben Janssen.",
      "url": "https://thorben-janssen.com/should-your-tests-manage-transactions/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-06-12T08:00:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "05b7cbe720f0fecd",
      "title": "Databases and AI with Neo4J as an example with Michael Simons",
      "description": "The post Databases and AI with Neo4J as an example with Michael Simons appeared first on Thorben Janssen. When integrating AI into your application, you will most likely want to use a concept called RAG. This acronym stands for Retrieval Augmented Generation and is an absolute game changer. The idea is simple: By providing your own input data to your LLM, you can improve the quality of its response and let it include... The post Databases and AI with Neo4J as an example with Michael Simons appea",
      "url": "https://thorben-janssen.com/expertsession-databases-and-ai/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-06-11T08:01:47+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "861d5a54619586b6",
      "title": "Implement your primary key as a Record using an IdClass",
      "description": "The post Implement your primary key as a Record using an IdClass appeared first on Thorben Janssen. There are various reasons to implement your own primary&#160;key&#160;representation. Your primary key may consist of multiple attributes. Or you&#8217;re following domain-driven design principles and want to use a custom type to add semantic meaning to it. Implementing&#160;a record and mapping it&#160;as an IdClass seems evident in these situations.&#160;A record is efficient, easy to implement,",
      "url": "https://thorben-janssen.com/idclass-record/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-05-22T08:16:33+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "866cdfe759377f1c",
      "title": "Persist LocalDateTime, ZonedDateTime & Co with Hibernate",
      "description": "The post Persist LocalDateTime, ZonedDateTime & Co with Hibernate appeared first on Thorben Janssen. The Date and Time API, introduced in Java 8, finally replaced the old java.util.Date. It&#8217;s much easier to use and finally offers separate classes representing date, date with time, and only time information. That not only improves your business code but also makes it easier to use them as entity attributes. At least if you&#8217;re... The post Persist LocalDateTime, ZonedDateTime & Co with ",
      "url": "https://thorben-janssen.com/hibernate-5-date-and-time/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-05-20T10:25:09+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "0d7353bd7d647d6c",
      "title": "Book Review: DuckDB in Action",
      "description": "The post Book Review: DuckDB in Action appeared first on Thorben Janssen. What if I told you that there&#8217;s a tool that makes it incredibly easy to process datasets from various sources, analyze them using SQL, and export the result in different formats? And that it doesn&#8217;t require all the hassle you know from typical relational databases or a custom implementation. Sounds too good to be true,... The post Book Review: DuckDB in Action appeared first on Thorben Janssen.",
      "url": "https://thorben-janssen.com/book-review-duckdb-in-action/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-04-10T08:00:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "37eb21dc334330f8",
      "title": "Software Development Monthly 9 / 2025",
      "description": "The Software Development Monthly is a monthly blog post that highlights interesting or useful blog posts which I read during the previous month. This blog post shares 19 interesting or useful blog posts which I read during September 2025. Read More The post Software Development Monthly 9 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/925881437/0/petrikainulainen~Software-Development-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-10-07T09:00:40+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "10ba96a6a2102cd2",
      "title": "Clean Test Automation Monthly 9 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 21 interesting or useful blog posts which I read during September 2025. Read More The post Clean Test Automation Monthly 9 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 9 / 2024Clean Test Automation Monthly 9 / 2023&#160;",
      "url": "https://feeds.feedblitz.com/~/925562264/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-09-30T05:22:24+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "6038fbbc53ce0d9d",
      "title": "Software Development Monthly 8 / 2025",
      "description": "The Software Development Monthly is a monthly blog post that highlights interesting or useful blog posts which I read during the previous month. This blog post shares 15 interesting or useful blog posts which I read during August 2025. Read More The post Software Development Monthly 8 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/924471290/0/petrikainulainen~Software-Development-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-09-07T09:35:45+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "2ed790c05683054f",
      "title": "Clean Test Automation Monthly 8 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 15 interesting or useful blog posts which I read during August 2025. Read More The post Clean Test Automation Monthly 8 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 8 / 2024Clean Test Automation Monthly 8 / 2023&#160;",
      "url": "https://feeds.feedblitz.com/~/924129182/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-08-31T16:19:14+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "d931387571c33309",
      "title": "Clean Test Automation Monthly 7 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 11 interesting or useful blog posts which I read during July 2025. Read More The post Clean Test Automation Monthly 7 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 7 / 2023Clean Test Automation Monthly 7 / 2024&#160;",
      "url": "https://feeds.feedblitz.com/~/922500704/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-07-31T16:49:50+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "9bf24efaecbaeda0",
      "title": "Clean Test Automation Monthly 6 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 14 interesting or useful blog posts which I read during June 2025. Read More The post Clean Test Automation Monthly 6 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 6 / 2024Clean Test Automation Monthly 6 / 2023&#160;",
      "url": "https://feeds.feedblitz.com/~/920956694/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-06-30T15:33:47+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "ca2e5ff113ec106d",
      "title": "Clean Test Automation Monthly 5 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 23 interesting or useful blog posts which I read during May 2025. Read More The post Clean Test Automation Monthly 5 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 5 / 2024&#160;",
      "url": "https://feeds.feedblitz.com/~/919395038/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-05-31T09:31:40+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "a3d7393ff0ad4c84",
      "title": "Writing Unit Test With MockMvcTester: Returning an Object as JSON",
      "description": "This blog post describes how we can write unit tests for a Spring MVC REST API endpoint that returns an object as JSON. We will identify the tests we must write, learn to eliminate duplicate request building code from our test class, and write assertions for the HTTP response with MockMvcTester and AssertJ. Read More The post Writing Unit Test With MockMvcTester: Returning an Object as JSON appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesWriting Unit Tests With MockMvcTeste",
      "url": "https://feeds.feedblitz.com/~/918213629/0/petrikainulainen~Writing-Unit-Test-With-MockMvcTester-Returning-an-Object-as-JSON/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-05-13T15:02:20+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "f9f7816d7e2cc93f",
      "title": "Clean Test Automation Monthly 4 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 20 interesting or useful blog posts which I read during April 2025. Read More The post Clean Test Automation Monthly 4 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 4 / 2024&#160;",
      "url": "https://feeds.feedblitz.com/~/917591369/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-05-01T14:30:47+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "fef63aa2920549e5",
      "title": "Post Data Into Website Using Jsoup in Java",
      "description": "Learn how we can send a POST request using Jsoup. The post Post Data Into Website Using Jsoup in Java first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/925822955/0/baeldung",
      "source": "Baeldung",
      "author": "Rajat Garg",
      "published": "2025-10-06T00:57:37+00:00",
      "niche": "spring",
      "score": 10,
      "keywords": []
    },
    {
      "id": "666bfcda6ba94616",
      "title": "What Can an Object[] Array Hold in Java?",
      "description": "Learn what an Object[] Array can hold in Java. The post What Can an Object[] Array Hold in Java? first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/925822544/0/baeldung",
      "source": "Baeldung",
      "author": "Samuel Njoki",
      "published": "2025-10-06T00:52:33+00:00",
      "niche": "spring",
      "score": 10,
      "keywords": []
    }
  ]
}