{
  "last_updated": "2026-01-11T18:39:10.452613+00:00",
  "total_articles": 178,
  "articles": [
    {
      "id": "ff21f1fe6035f996",
      "title": "This Week in Spring - January 6th, 2026",
      "description": "Hi, Spring fans, to the first installment of This Week in Spring in the new year and, roughly, the fifteenth anniversary edition of this series! I've been writing these blogs since the first week of January of 2011, and I am proud to say that I haven't (so far) missed a single week! I've always published it on Tuesday (with some fuzziness around whose Tuesday, as I tend to bounce around the globe a fair bit). I want to thank, as I always do, Spring cofounder Keith Donald for this wonderful and s",
      "url": "https://spring.io/blog/2026/01/06/this-week-in-spring-january-06th-2026",
      "source": "Spring Blog (Official)",
      "author": "joshlong",
      "published": "2026-01-06T00:00:00+00:00",
      "niche": "spring",
      "score": 68,
      "keywords": []
    },
    {
      "id": "28bdac69ae76624d",
      "title": "Istio Spring Boot Library Released",
      "description": "This article explains how to use my Spring Boot Istio library to generate and create Istio resources on a Kubernetes cluster during application startup. The library is primarily intended for development purposes. It aims to make it easier for developers to quickly and easily launch their applications within the Istio mesh. Of course, you can [&#8230;] The post Istio Spring Boot Library Released appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2026/01/06/istio-spring-boot-library-released/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2026-01-06T09:31:45+00:00",
      "niche": "spring",
      "score": 68,
      "keywords": []
    },
    {
      "id": "a4a967ed7d5eebd0",
      "title": "Why Use the Returned Instance of Spring Data JPA Repository’s save() Call?",
      "description": "Learn why it is important to always use the instance returned by the save() method with unit tests to show what happens during both persisting and merging The post Why Use the Returned Instance of Spring Data JPA Repository’s save() Call? first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/939734255/0/baeldung~Why-Use-the-Returned-Instance-of-Spring-Data-JPA-Repositorys-save-Call",
      "source": "Baeldung",
      "author": "Kai Yuan",
      "published": "2026-01-06T11:42:46+00:00",
      "niche": "spring",
      "score": 68,
      "keywords": []
    },
    {
      "id": "477735238d986c22",
      "title": "How to Set Content-Length Header in ResponseEntity in Spring MVC",
      "description": "Setting the Content-Length header in Spring MVC's ResponseEntity is straightforward, but it should be done explicitly and only when required. The post How to Set Content-Length Header in ResponseEntity in Spring MVC first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/939925994/0/baeldung~How-to-Set-ContentLength-Header-in-ResponseEntity-in-Spring-MVC",
      "source": "Baeldung",
      "author": "Achraf Taitai",
      "published": "2026-01-10T03:09:53+00:00",
      "niche": "spring",
      "score": 68,
      "keywords": []
    },
    {
      "id": "fa78c304bb25ef84",
      "title": "Spring gRPC 1.0.1 Available Now",
      "description": "On behalf of the team and everyone who has contributed, I'm happy to announce that Spring gRPC 1.0.1 maintenance release is available from Maven Central. Please see the release notes for more details blog for upgrade instructions. We want to take this opportunity to again thank all our users and contributors. Project Page | GitHub | Issues",
      "url": "https://spring.io/blog/2026/01/07/spring-grpc-1",
      "source": "Spring Blog (Official)",
      "author": "onobc",
      "published": "2026-01-07T00:00:00+00:00",
      "niche": "spring",
      "score": 62,
      "keywords": []
    },
    {
      "id": "6d13b6936d8a97b7",
      "title": "A Bootiful Podcast: Spring Security lead Rob Winchon Spring Security 7",
      "description": "Hi, Spring fans! In this installment, I have the privilege of sitting down and talking to the legendary Rob Winch, lead of Spring Security, Spring Session, and the amazing Testjars project.",
      "url": "https://spring.io/blog/2026/01/08/a-bootiful-podcast-rob-winch",
      "source": "Spring Blog (Official)",
      "author": "joshlong",
      "published": "2026-01-08T00:00:00+00:00",
      "niche": "spring",
      "score": 58,
      "keywords": []
    },
    {
      "id": "4a358c04f277bdd3",
      "title": "Temporal Workflow Engine with Spring Boot",
      "description": "Temporal is a durable workflow engine designed for building reliable, fault-tolerant, and scalable distributed systems. Instead of managing complex business processes with fragile state machines or message queues, Temporal allows you to model long-running processes as code while automatically handling retries, state persistence, and failure recovery. When combined with Spring Boot, Temporal integrates seamlessly into &#8230;",
      "url": "https://www.javacodegeeks.com/temporal-workflow-engine-with-spring-boot.html",
      "source": "Java Code Geeks",
      "author": "Omozegie Aziegbe",
      "published": "2026-01-05T08:59:00+00:00",
      "niche": "spring",
      "score": 57,
      "keywords": []
    },
    {
      "id": "b7abfcf238a49ae6",
      "title": "Securing Verifiable Credentials With DPoP: A Spring Boot Implementation",
      "description": "In my previous article, I demonstrated how to implement OIDC4VCI (credential issuance) and OIDC4VP (credential presentation) using Spring Boot and an Android wallet. This follow-up focuses on a critical security enhancement now mandated by EUDI standards: DPoP (Demonstrating Proof-of-Possession). The Problem With Bearer Tokens Traditional Bearer tokens have an inherent weakness: anyone who obtains the token can use it. If an attacker intercepts or steals a Bearer token, they can impersonate the ",
      "url": "https://feeds.dzone.com/link/18931/17247556/securing-verifiable-credentials-with-dpop-spring-boot",
      "source": "DZone Microservices",
      "author": "Kyriakos Mandalas",
      "published": "2026-01-05T19:00:00+00:00",
      "niche": "spring",
      "score": 57,
      "keywords": []
    },
    {
      "id": "3b83d90de4636dc5",
      "title": "Implementing Idempotency in Distributed Spring Boot Applications Using MySQL",
      "description": "Why Idempotency Breaks in Real Systems  Modern distributed systems expose APIs that trigger state-changing operations such as payments, orders, the account acquisition process, or account updates. In such environments, the chance of duplicate transactions being initiated is quite high and unavoidable due to network retries, a Kafka rebalancer issuing multiple requests, load balancers, and other factors. Without proper safeguards, these duplicate transactions/requests can lead to data inconsisten",
      "url": "https://feeds.dzone.com/link/18931/17248790/implementing-idempotency-spring-boot-mysql",
      "source": "DZone Microservices",
      "author": "Balakumaran Sugumar",
      "published": "2026-01-07T18:00:00+00:00",
      "niche": "spring",
      "score": 57,
      "keywords": []
    },
    {
      "id": "2c26eb1bd006e8f3",
      "title": "Frontend Masters: SOLID Principles in React / React Native",
      "description": "The SOLID principles, originally formulated for object-oriented programming, have transcended their origins to become fundamental guidelines for writing maintainable, scalable code across paradigms. While React and React Native embrace functional programming patterns with hooks and components, these time-tested principles remain remarkably relevant. Understanding how to apply SOLID principles in modern React development can transform your &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/frontend-masters-solid-principles-in-react-react-native.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2026-01-08T07:21:00+00:00",
      "niche": "spring",
      "score": 57,
      "keywords": []
    },
    {
      "id": "9211278e0fa1d937",
      "title": "Don’t replace your PC-refresh it with Microsoft Office and Windows 11 Pro at $39.97 (MSRP $418.99)",
      "description": "TL;DR: Give your PC a complete refresh just in time for the new year with Microsoft Office 2021 and Windows 11 Pro, bundled together at $39.97 (MSRP $418.99). Keeping a development machine current doesn&#8217;t always require new hardware. In many cases, upgrading the software stack provides a huge productivity boost that doesn&#8217;t require you to &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/dont-replace-your-pc-refresh-it-with-microsoft-office-and-windows-11-pro-at-39-97-msrp-418-99.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2026-01-10T11:30:30+00:00",
      "niche": "spring",
      "score": 57,
      "keywords": []
    },
    {
      "id": "2238799671f9773b",
      "title": "Joining Tables Without Relation Using JPA Criteria",
      "description": "Explore how to construct a JPA criteria query to join tables without explicitly defining the JPA relationship. The post Joining Tables Without Relation Using JPA Criteria first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/939734258/0/baeldung~Joining-Tables-Without-Relation-Using-JPA-Criteria",
      "source": "Baeldung",
      "author": "Manfred Ng",
      "published": "2026-01-06T11:39:42+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "b711cc805279a576",
      "title": "Obtain Index of a Given LinkedHashSet Element Without Iteration",
      "description": "Learn how to address a rare case where we need to ensure element uniqueness when querying their indexes. The post Obtain Index of a Given LinkedHashSet Element Without Iteration first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/939926444/0/baeldung~Obtain-Index-of-a-Given-LinkedHashSet-Element-Without-Iteration",
      "source": "Baeldung",
      "author": "Eugene Kovko",
      "published": "2026-01-10T03:17:15+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "25d73b0eddd75e30",
      "title": "Fix the Java-MySQL Connection Exception: Public Key Retrieval is not allowed",
      "description": "Learn about the causes of the Public Key Retrieval is not allowed error when working with MySQL in a Java application and ways to fix or work around it. The post Fix the Java-MySQL Connection Exception: Public Key Retrieval is not allowed first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/939926447/0/baeldung~Fix-the-JavaMySQL-Connection-Exception-Public-Key-Retrieval-is-not-allowed",
      "source": "Baeldung",
      "author": "Ali Imran Nagori",
      "published": "2026-01-10T03:13:25+00:00",
      "niche": "spring",
      "score": 50,
      "keywords": []
    },
    {
      "id": "00010ecf36141b1a",
      "title": "Introduction to IoTDB",
      "description": "Explore the IoTDB time-series database. The post Introduction to IoTDB first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/939734999/0/baeldung~Introduction-to-IoTDB",
      "source": "Baeldung",
      "author": "Graham Cox",
      "published": "2026-01-06T11:52:36+00:00",
      "niche": "spring",
      "score": 46,
      "keywords": []
    },
    {
      "id": "e147566caa0a7b93",
      "title": "Java Weekly, Issue 628",
      "description": "Another quick one as we're getting 2026 started. Some very useful insights into architecture. The post Java Weekly, Issue 628 first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/939818480/0/baeldung~Java-Weekly-Issue",
      "source": "Baeldung",
      "author": "baeldung",
      "published": "2026-01-07T20:58:32+00:00",
      "niche": "spring",
      "score": 46,
      "keywords": []
    },
    {
      "id": "81ef0d6e3c5ba907",
      "title": "Setting the JVM Options for Kafka Tools",
      "description": "Learn how to set the JVM options for the command-line Kafka tools. The post Setting the JVM Options for Kafka Tools first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/939879863/0/baeldung~Setting-the-JVM-Options-for-Kafka-Tools",
      "source": "Baeldung",
      "author": "Burak Gökmen",
      "published": "2026-01-09T03:23:43+00:00",
      "niche": "spring",
      "score": 46,
      "keywords": []
    },
    {
      "id": "706df0002082260b",
      "title": "SQL Arrays with Spring's amazing `JdbcClient`",
      "description": "Happy new year! I just wanted to write a quick post about how to solve a problem that vexxed me for hours and I know I'll need again at some point: how to use a SQL array with Spring Framework's JdbcClient.",
      "url": "https://joshlong.com/jl/blogpost/sql-arrays-with-jdbcclient.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2026-01-06T00:00:00+00:00",
      "niche": "spring",
      "score": 44,
      "keywords": []
    },
    {
      "id": "9b77fdb52a02f597",
      "title": "Building a Hybrid Search Engine with JDBC and PostgreSQL",
      "description": "When building modern search functionality, developers often reach for specialized search engines like Elasticsearch or Solr. But what if you could build a sophisticated, production-grade search engine using just JDBC and PostgreSQL? This article explores a fascinating implementation that combines vector embeddings, full-text search, and fuzzy matching—all powered by PostgreSQL's rich ecosystem of extensions.",
      "url": "https://joshlong.com/jl/blogpost/building-a-search-engine-with-postgresql-and-jdbc.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2026-01-11T00:00:00+00:00",
      "niche": "spring",
      "score": 44,
      "keywords": []
    },
    {
      "id": "0ebfa5f4d3fb0719",
      "title": "Java News Roundup: Spring Shell, JReleaser, TornadoInsight, Apache Camel",
      "description": "This week's relatively quiet Java roundup for December 29th, 2025, features news highlighting: the GA release of Spring Shell 4.0; point releases of JReleaser 1.22.0 and Apache Camel 4.14.3; and TornadoInsight now compatible with the recent release of TornadoVM 2.0. By Michael Redlich",
      "url": "https://www.infoq.com/news/2026/01/java-news-roundup-dec29-2025/?utm_campaign=infoq_content&utm_source=infoq&utm_medium=feed&utm_term=Java",
      "source": "InfoQ Java",
      "author": "Michael Redlich",
      "published": "2026-01-05T02:30:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "17848a4435295c9d",
      "title": "Java and Event‑Driven Architectures: Kafka, Pulsar, and the Modern Streaming Landscape",
      "description": "Event‑driven architectures have become a defining approach for building systems that react in real time, scale horizontally, and remain resilient under unpredictable workloads. Java, with its mature ecosystem and long history in enterprise environments, continues to be one of the strongest foundations for these architectures. Whether you’re working with Apache Kafka, Apache Pulsar, or stream‑processing &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/java-and-event-driven-architectures-kafka-pulsar-and-the-modern-streaming-landscape.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2026-01-05T07:08:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "b3e9551c140b0c3e",
      "title": "JEP 525 Brings Timeout Handling and Joiner Refinements to Java’s Structured Concurrency",
      "description": "JEP 525, a highlight in the upcoming JDK 26, refines structured concurrency for clearer, safer task management. This iteration introduces a timeout callback for custom joiners, enhancing flexibility and error handling. With streamlined APIs and focus on practical usage, it empowers developers to efficiently manage concurrent tasks, paving the way for advanced Project Loom features. By A N M Bazlur Rahman",
      "url": "https://www.infoq.com/news/2026/01/timeout-joiner-refinements/?utm_campaign=infoq_content&utm_source=infoq&utm_medium=feed&utm_term=Java",
      "source": "InfoQ Java",
      "author": "A N M Bazlur Rahman",
      "published": "2026-01-05T15:10:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "376fda97a7e502f5",
      "title": "Mastering Event-Driven Java: Kafka, Pulsar, RabbitMQ, and Beyond",
      "description": "In today’s software landscape, responsiveness, scalability, and real-time data flow are no longer luxuries—they’re expectations. Event-driven architectures (EDA) offer a powerful way to meet these demands, and Java remains a top-tier language for building such systems. Whether you&#8217;re streaming millions of events per second or coordinating microservices, platforms like Kafka, Pulsar, and RabbitMQ provide the &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/mastering-event-driven-java-kafka-pulsar-rabbitmq-and-beyond.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2026-01-05T17:26:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "60f17c0da6c027ed",
      "title": "Implement Multi-Threading in Node.js With Worker Threads",
      "description": "Node.js is known for its single-threaded architecture powered by the event loop. While this design is excellent for I/O-driven applications, it struggles whenever CPU-heavy operations block the event loop and degrade performance. To overcome this limitation, Node.js offers the worker_threads module, which enables true parallel execution of computation-heavy tasks. This article provides an explanation of &#8230;",
      "url": "https://www.javacodegeeks.com/implement-multi-threading-in-node-js-with-worker-threads.html",
      "source": "Java Code Geeks",
      "author": "Omozegie Aziegbe",
      "published": "2026-01-05T16:04:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "16398558c06e9d26",
      "title": "Beyond Fuzzy Matching: Engineering a Multi-Signal ML Pipeline for CRM Deduplication",
      "description": "The CRM Problem We All Face Almost every CRM platform struggles with duplicate customer records because  the data is a messy mix flowing in from too many places — web forms, call centers, imports from ERP, partner feeds, and even legacy systems from multiple business units. The exact same company can pop up under slightly different names, with spelling variations, inconsistent addresses, or missing suite numbers. A simple single-rule fuzzy match isn't enough to connect these dots.  To truly fix ",
      "url": "https://feeds.dzone.com/link/18931/17247488/multi-signal-ml-pipeline-crm-deduplication",
      "source": "DZone Microservices",
      "author": "Punitha Ponnuraj",
      "published": "2026-01-05T17:00:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "fce9e0464e6f59a9",
      "title": "The Ethics and Philosophy of Data Governance in Modern Business",
      "description": "In an era where data is often called “the new oil,” the way organizations govern data has profound ethical and philosophical implications. Data governance is no longer just a technical or compliance issue—it’s a moral and strategic imperative. As businesses collect, analyze, and monetize data, they must also confront questions about fairness, transparency, accountability, and &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/the-ethics-and-philosophy-of-data-governance-in-modern-business.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2026-01-06T06:39:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "80a659dc9196d752",
      "title": "Unchain millions of AI credits each month for life for your whole team",
      "description": "TL;DR: Get a 1min.AI Advanced Business Plan lifetime subscription, including access to the top AI tools, millions of monthly credits, and 20 users. AI tooling is becoming a standard part of modern development workflows, but evaluating different models often requires juggling multiple subscriptions, APIs, and platform-specific dashboards. For developers who want one place to test, &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/unchain-millions-of-ai-credits-each-month-for-life-for-your-whole-team.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2026-01-06T11:30:30+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "28185e5db0e11b9e",
      "title": "Java Annotated Monthly – January 2026",
      "description": "Happy New Year and welcome to the first Java Annotated Monthly of 2026! We hope this year brings fresh ideas, smarter ways to stay productive, and innovation that lasts. JAM, as always, is your island of stability in the fast-moving tech world, bringing the coolest news and practical tips. This time, we are starting strong [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2026/01/java-annotated-monthly-january-2026/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Irina Mariasova",
      "published": "2026-01-06T12:12:05+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "900c58caa7431d60",
      "title": "A Practical Guide to Semantic Caching With Redis LangCache",
      "description": "Semantic cache is an advanced caching mechanism that differs from traditional caching, which relies on exact keyword matching; it stores and retrieves data based on semantic similarity. Redis LangCache is a fully hosted semantic caching service that helps cache LLM prompts and responses semantically, thereby reducing LLM usage costs. In this tutorial, let's learn how to quickly create a simple application and use LangCache for caching LLM queries. Also, see if we can combine fuzzy logic to impro",
      "url": "https://feeds.dzone.com/link/18931/17247941/semantic-caching-redis-langcache-guide",
      "source": "DZone Microservices",
      "author": "Josephine Eskaline Joyce",
      "published": "2026-01-06T13:00:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "ce4e1f4172393969",
      "title": "GraphQL vs Protobuf: Differences, Similarities, and When Each One Truly Shines",
      "description": "If you spend enough time building modern distributed systems, you eventually run into a familiar crossroads: should your services speak GraphQL, or should they speak Protobuf? It’s a bit like choosing between two very different communication styles. One is expressive, flexible, and conversational. The other is fast, efficient, and almost militaristically precise. And the truth &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/graphql-vs-protobuf-differences-similarities-and-when-each-one-truly-shines.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2026-01-06T16:51:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "e4cb4b2095e54d99",
      "title": "An In-Depth Comparison: VS Code vs IntelliJ for Java Development",
      "description": "Choosing the right IDE can significantly impact your productivity as a Java developer. While IntelliJ IDEA has long been the gold standard for Java development, Visual Studio Code has emerged as a lightweight alternative with powerful extensions. This comprehensive comparison will help you decide which tool best fits your needs. 1. Understanding the Contenders 1.1 &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/an-in-depth-comparison-vs-code-vs-intellij-for-java-development.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2026-01-07T06:07:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "1e6ea972948da78f",
      "title": "[FREE EBOOKS] The Cyber Security Handbook, Generative AI Foundations in Python & Four More Best Selling Titles",
      "description": "Hello fellow geeks, Fresh offers await you on our Information Technology Research Library, please have a look! The Cyber Security Handbook: Prepare, respond, and recover from cyber attacks using the IT Governance Cyber Resilience Framework ($44.99 Value) FREE for a Limited Time This book offers a deep dive into cybersecurity, equipping professionals with tools and &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/free-ebooks-the-cyber-security-handbook-generative-ai-foundations-in-python-four-more-best-selling-titles-2.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2026-01-07T11:30:30+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "cb32cbd1f1724cce",
      "title": "Unleash Peak Performance in Java Applications: Overview of Profile-Guided Optimization (PGO)",
      "description": "In the relentless pursuit of application performance, developers constantly seek methods to squeeze every ounce of efficiency from their code. While traditional optimization techniques like algorithm improvements and code refactoring remain essential, a powerful approach often flies under the radar: Profile-Guided Optimization (PGO). This advanced compilation technique leverages real-world runtime data to make smarter optimization &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/unleash-peak-performance-in-java-applications-overview-of-profile-guided-optimization-pgo.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2026-01-07T16:14:18+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "6c0bfdb49ad7b170",
      "title": "[DEALS] Internxt Cloud Storage: Lifetime Subscription (88% off) & Other Deals Up To 98% Off – Offers End Soon!",
      "description": "Hello fellow geeks, Fresh offers await you on our Deals store, please have a look! Internxt Cloud Storage: Lifetime Subscription (88% off) Ending soon // by Java Code Geeks Private, Open-Source &#38; Secure Cloud Storage! Take Back Control of Your Data Across All Your Devices Headway Premium: Lifetime Subscription (80% off) ChatGPT &#38; Automation E-Degree &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/deals-internxt-cloud-storage-lifetime-subscription-88-off-other-deals-up-to-98-off-offers-end-soon-2.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2026-01-08T11:30:30+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "1930939510ea71b1",
      "title": "Managing Changing Hardware/Peripherals in a Robust Point of Sale System",
      "description": "Retail point-of-sale systems today offer a wide range of options for peripherals and hardware. Their technical specifications play a major role in selection, and big retailers often choose multiple vendors to reduce a single point of failure. This gives them an advantage to negotiate price or support as well. Technically, these peripherals also require updating with new models and may have new feature sets. This necessitates the redevelopment of point-of-sale applications, increasing development",
      "url": "https://feeds.dzone.com/link/18931/17249288/managing-changing-hardwareperipherals-in-a-robust-pos",
      "source": "DZone Microservices",
      "author": "Vaibhav Rastogi",
      "published": "2026-01-08T12:00:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "a180eb72d2cd8984",
      "title": "Software Development Monthly 12 / 2025",
      "description": "The Software Development Monthly is a monthly blog post that highlights interesting or useful blog posts which I read during the previous month. This blog post shares 19 interesting or useful blog posts which I read during December 2025. Read More The post Software Development Monthly 12 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesSoftware Development Monthly 11 / 2025Software Development Monthly 10 / 2025Clean Test Automation Monthly 11 / 2025&#160;",
      "url": "https://feeds.feedblitz.com/~/939864599/0/petrikainulainen~Software-Development-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2026-01-08T17:51:42+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "1e560470594ec741",
      "title": "Performance Engineering for Java: JVM Tuning and Optimization",
      "description": "The Java Virtual Machine remains one of the most sophisticated pieces of runtime engineering in modern software development. While Java&#8217;s &#8220;write once, run anywhere&#8221; philosophy abstracts away much of the underlying complexity, understanding JVM internals and performance characteristics becomes crucial when building applications that need to handle significant load or maintain consistent response times. Performance &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/performance-engineering-for-java-jvm-tuning-and-optimization.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2026-01-08T16:30:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "1673e6201285d651",
      "title": "Telemetry-Driven AI Architecture: Closing the Loop from UX to Models",
      "description": "Most Android AI features die quietly after launch. You ship a smart recommendation, a ranking model, or an LLM-powered assistant. It works great on your test data, metrics look decent, and then… real users behave differently. Edge cases appear, traffic shifts, product changes. The model slowly drifts out of sync with reality.",
      "url": "https://feeds.dzone.com/link/18931/17249524/telemetry-driven-ai-architecture-closing-the-loop",
      "source": "DZone Microservices",
      "author": "Mohan Sankaran",
      "published": "2026-01-08T17:00:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "8c7f856b3a00fa43",
      "title": "Enterprise Kubernetes Failures: 20 Critical Misconfigurations Guardon Catches Before Outages",
      "description": "Kubernetes incidents in large organizations don’t come from exotic zero-days — they come from basic YAML mistakes made thousands of times a year by developers under pressure. While we commonly talk about 15–20 misconfigurations that appear in every enterprise, the truth is much deeper: Kubernetes is an ecosystem of complexity, and prevention requires more than static checks. Guardon, a lightweight, developer-first Kubernetes guardrail extension, helps organizations detect these issues early — bu",
      "url": "https://feeds.dzone.com/link/18931/17249466/20-kubernetes-misconfig-guardon-catches-before-outage",
      "source": "DZone Microservices",
      "author": "Sajal Nigam",
      "published": "2026-01-08T16:00:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "cb1dc1f1ceb4cb48",
      "title": "When Services Think for Themselves: Traditional Orchestration vs. Agentic AI Microservices",
      "description": "Understanding How Traditional Orchestration Manages Microservices From Netflix to Spotify and Walmart, industry stalwarts across the globe leverage microservices at scale to deliver rapid innovation across their services. Microservices architecture has brought a fundamental shift in the way modern cloud computing drives applications to scale, evolve, and deploy independently. The foundational pillars upon which this innovation rests include orchestration platforms such as Kubernetes and Docker S",
      "url": "https://feeds.dzone.com/link/18931/17249575/traditional-orchestration-vs-agentic-ai-microservices",
      "source": "DZone Microservices",
      "author": "Atish Kumar Dash",
      "published": "2026-01-08T19:00:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "e18dea07925fe6fc",
      "title": "How Much Does It Cost to Make an Ecommerce Website?",
      "description": "Building an ecommerce website represents one of the most significant investments you&#8217;ll make in your business, yet answering the seemingly simple question of &#8220;how much will it cost?&#8221; proves remarkably complex. The digital marketplace has evolved dramatically, and with the U.S. eCommerce market looking to surpass $6.8 trillion in 2025, the stakes for getting your &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/how-much-does-it-cost-to-make-an-ecommerce-website.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2026-01-09T06:37:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "937b39ee8b52106d",
      "title": "Mini book: The InfoQ Trends Reports 2025 eMag",
      "description": "This special edition of The InfoQ eMag, contains a comprehensive collection of our popular InfoQ Trends Reports from 2025, a year with both evolution and revolution within the landscapes of technology, software development trends. This collection does not just reflect the past year's technological trends. We aspire to use it as a guide for future exploration and innovation. By InfoQ",
      "url": "https://www.infoq.com/minibooks/2025-infoq-trends-reports-emag/?utm_campaign=infoq_content&utm_source=infoq&utm_medium=feed&utm_term=Java",
      "source": "InfoQ Java",
      "author": "InfoQ",
      "published": "2026-01-09T11:00:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "8dc05c0b3fb7242e",
      "title": "How to Collect Entity IDs from Java Collections",
      "description": "In many applications, we often work with collections of domain entities retrieved from a database, API, or in-memory source, and a common requirement is to extract only the IDs from those entities to send them to another service, perform batch updates or deletions, build lookup maps, validate relationships, or support logging and auditing. This article &#8230;",
      "url": "https://www.javacodegeeks.com/how-to-collect-entity-ids-from-java-collections.html",
      "source": "Java Code Geeks",
      "author": "Omozegie Aziegbe",
      "published": "2026-01-09T15:16:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "34d6e744b299ec1e",
      "title": "How to Convert JSONArray to int[] in Java",
      "description": "In Java-based applications—especially those interacting with REST APIs, microservices, configuration files, or message queues—JSON is one of the most widely used data exchange formats. Libraries such as org.json, Jackson, and Gson make it easy to parse JSON payloads into Java-friendly structures. A common requirement in such systems is converting a JSONArray into a primitive int[] &#8230;",
      "url": "https://www.javacodegeeks.com/how-to-convert-jsonarray-to-int-in-java.html",
      "source": "Java Code Geeks",
      "author": "Yatin Batra",
      "published": "2026-01-09T13:17:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "8309f9c58e7cdbee",
      "title": "Unknown Mistakes to Avoid in Software Development",
      "description": "Introduction Every software developer makes mistakes. The obvious ones receive plenty of attention in books, blog posts, and code reviews—using the wrong data structure, forgetting to validate inputs, or deploying to production without adequate testing. These well-documented errors have established solutions and best practices that most developers eventually learn through experience or mentorship. However, the &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/unknown-mistakes-to-avoid-in-software-development.html",
      "source": "Java Code Geeks",
      "author": "Eleftheria Drosopoulou",
      "published": "2026-01-09T17:53:00+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "0ba4d8696e074b57",
      "title": "How to Build and Deploy an AI Agent on Kubernetes With AWS Bedrock, FastAPI and Helm",
      "description": "The capabilities offered by AI are no longer limited to large, centralized platforms. Today, engineering teams are increasingly embracing lightweight, specialized AI agents that can be managed, scaled, and deployed just like microservices in a cloud-native environment — whether for summarizing large documents, translation, classification, or other analytical tasks. In this tutorial, you will create, deploy, and run an AI model that provides REST APIs for summarization and translation using AWS B",
      "url": "https://feeds.dzone.com/link/18931/17250178/how-to-build-and-deploy-an-ai-agent-on-kubernetes",
      "source": "DZone Microservices",
      "author": "Chandrasekhar Rao Katru",
      "published": "2026-01-09T15:00:14+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "c354a8ad01ebef9f",
      "title": "[FREE EBOOKS] Kali Linux Cookbook, The Cyber Security Handbook & Four More Best Selling Titles",
      "description": "Hello fellow geeks, Fresh offers await you on our Information Technology Research Library, please have a look! Kali Linux Cookbook: Boost your pentesting career with essential tools such as Nmap, Metasploit, and Wireshark , Third Edition ($35.99 Value) FREE for a Limited Time This hands-on guide will help you become a penetration testing expert by &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/free-ebooks-kali-linux-cookbook-the-cyber-security-handbook-four-more-best-selling-titles.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2026-01-10T11:30:30+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "f69716c40e449e82",
      "title": "[DEALS] FastestVPN PRO: Lifetime Subscription (15 Devices) (95% off) & Other Deals Up To 98% Off – Offers End Soon!",
      "description": "Hello fellow geeks, Fresh offers await you on our Deals store, please have a look! FastestVPN PRO: Lifetime Subscription (15 Devices) (95% off) Ending soon // by Java Code Geeks A Must-Have VPN Solution with Unhindered Speed, WireGuard Protocol, Password Manager &#38; More Microsoft Project 2021 Professional: Lifetime License for Windows (94% off) The 2025 &#8230;",
      "url": "https://www.javacodegeeks.com/2026/01/deals-fastestvpn-pro-lifetime-subscription-15-devices-95-off-other-deals-up-to-98-off-offers-end-soon.html",
      "source": "Java Code Geeks",
      "author": "Java Code Geeks",
      "published": "2026-01-11T11:30:30+00:00",
      "niche": "spring",
      "score": 42,
      "keywords": []
    },
    {
      "id": "aa143c2e3da43a6d",
      "title": "The Inside Java Newsletter: JavaOne Sessions and Keynotes!",
      "description": "The Inside Java Newsletter for December 2025 includes a warm year-end message from Sharat Chander to the Java community, plus a special limited-time discount code for JavaOne 2026 registration. The JavaOne 2026 keynotes and technical sessions are now announced, so check them out and register soon. This issue also highlights the latest Java content from the Java Platform Group teams. Visit learn.java, dev.java, and inside.java for videos, articles, and other resources for developers, learners, ed",
      "url": "https://inside.java/2026/01/05/inside-java-newsletter/",
      "source": "Inside.java (Oracle)",
      "author": "[\"JimGrisanzio\"]",
      "published": "2026-01-05T00:00:00+00:00",
      "niche": "spring",
      "score": 37,
      "keywords": []
    },
    {
      "id": "9d07942ce5df267d",
      "title": "Java’s Plans for 2026 - Inside Java Newscast #104",
      "description": "In 2026, Java keeps evolving: Project Valhalla is gunning for merging its value types preview in the second half of this year; Babylon wants to incubate code reflection; Loom will probably finalize the structured concurrency API; Leyden plans to ship AOT code compilation; and Amber hopes to present JEPs on constant patterns and pattern assignments. And those are just the most progressed features - more are in the pipeline and discussed in this episode of the Inside Java Newscast.",
      "url": "https://inside.java/2026/01/08/newscast-104/",
      "source": "Inside.java (Oracle)",
      "author": "[\"NicolaiParlog\"]",
      "published": "2026-01-08T00:00:00+00:00",
      "niche": "spring",
      "score": 37,
      "keywords": []
    },
    {
      "id": "66d49b2e3f1e3754",
      "title": "Run Into the New Year with Java’s Ahead-of-Time Cache Optimizations",
      "description": "As a new year begins, turn your focus to boosting your Java application performance by applying Leyden-related features added in recent JDK releases. This article guides you on how to use Ahead-of-Time cache optimizations in your application, thereby minimizing startup time and achieving faster peak performance.",
      "url": "https://inside.java/2026/01/09/run-aot-cache/",
      "source": "Inside.java (Oracle)",
      "author": "[\"Ana-MariaMihalceanu\"]",
      "published": "2026-01-09T00:00:00+00:00",
      "niche": "spring",
      "score": 37,
      "keywords": []
    },
    {
      "id": "2b3fe554f2b7a29d",
      "title": "The Static Dynamic JVM – A Many Layered Dive #JVMLS",
      "description": "Dive deep into the Java Virtual Machine and discover how it masterfully balances static analysis with dynamic execution. John Rose explores what makes the JVM both powerful and efficient, from theoretical computer science to real-world optimization techniques.",
      "url": "https://inside.java/2026/01/11/jvmls-static-dynamic-jvm/",
      "source": "Inside.java (Oracle)",
      "author": "[\"JohnRose\"]",
      "published": "2026-01-11T00:00:00+00:00",
      "niche": "spring",
      "score": 37,
      "keywords": []
    },
    {
      "id": "12a286fd70f06c87",
      "title": "16 Things Java Developers Should Learn in 2026",
      "description": "Hello guys, Java continues to be one of the most widely used languages in enterprise systems, cloud platforms, and large scale applications. But being a successful Java developer in 2026 requires much more than knowing the language and its standard libraries. Companies now expect engineers to understand architecture, scalability, cloud infrastructure, AI assisted development, and modern delivery practices. Java, Unix, Tibco RV and FIX Protocol Tutorial",
      "url": "http://javarevisited.blogspot.com/2026/01/16-things-java-developers-should-learn.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2026-01-07T07:05:00-08:00",
      "niche": "spring",
      "score": 33,
      "keywords": []
    },
    {
      "id": "a5e3c9a0c9b583b6",
      "title": "Is Codemia.io Worth it for FAANG System Design Interview in 2026?",
      "description": "If you’ve ever prepared for a FAANG interview — or any top-tier tech company interview — you already know one truth: cracking the system design round is brutally hard. Many candidates spend months solving LeetCode problems, mastering algorithms, and brushing up on data structures, only to get completely stumped when faced with an open-ended system design question like: Java, Unix, Tibco RV and FIX Protocol Tutorial",
      "url": "http://javarevisited.blogspot.com/2026/01/is-codemiaio-worth-it-for-faang-system.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2026-01-08T06:32:00-08:00",
      "niche": "spring",
      "score": 33,
      "keywords": []
    },
    {
      "id": "9b8ddbb64b8310b8",
      "title": "ByteByteGo, AlgoMonster, DesignGurus.io & Bugfree.ai - Discount Code and Offers",
      "description": "Hello guys, If you are looking for discount coupons, offers and sale for platforms which help you prepare for coding interview and system design then you have come to the right place. Earlier, I have shared the best Black Friday and Cyber Monday deals for developers, and now I am going to share bit more about the best Cyber Monday deals for coding interview preparation platforms. The four platforms that have genuinely transformed how I prepare for interviews and improve my coding skills are runn",
      "url": "http://javarevisited.blogspot.com/2026/01/bytebytego-algomonster-designgurusio.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2026-01-08T21:00:00-08:00",
      "niche": "spring",
      "score": 33,
      "keywords": []
    },
    {
      "id": "d32310af08151427",
      "title": "Is ByteByteGo worth it in 2026 for System Design Interview Prep?",
      "description": "Hello guys, when it comes to preparing for technical interviews, few challenges intimidate developers as much as system design. While coding interviews can be mastered with consistent practice and problem-solving drills, system design interviews require something far broader — architecture knowledge, scalability trade-offs, distributed systems intuition, and the ability to communicate clearly under pressure. This is exactly the gap ByteByteGo set out to solve. Founded by Alex Xu, the bestselling",
      "url": "http://javarevisited.blogspot.com/2026/01/is-bytebytego-worth-it-in-2026-for.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2026-01-10T02:27:00-08:00",
      "niche": "spring",
      "score": 33,
      "keywords": []
    },
    {
      "id": "58b5c0d9d4954544",
      "title": "Datacamp 50% OFF - Is it worth it to learn Python, AI and Machine Learning in 2026?",
      "description": "Hello guys, if you want to learn Data skills like Python, Data Science, Data Analysis and even artificial intelligence then you must have come across Datacamp, one of the leading platform for learning Data skills. I have tried several courses over the years on Datacamp and I love their curriculum where you learn by following byte sized lesson with lots of quizzes, revision and exercise. Java, Unix, Tibco RV and FIX Protocol Tutorial",
      "url": "http://javarevisited.blogspot.com/2026/01/datacamp-50-off-is-it-worth-it-to-learn.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2026-01-11T03:08:00-08:00",
      "niche": "spring",
      "score": 33,
      "keywords": []
    },
    {
      "id": "a1a5105910961394",
      "title": "The best way to clean up test data with Spring and Hibernate",
      "description": "Introduction In this article, I&#8217;m going to show you the best way to clean up test data when using Spring and Hibernate. While it&#8217;s very common to use the @DataJpaTest annotation when implementing integration tests, in this blog post, you will see why you are better off avoiding using this annotation. Why I don&#8217;t use @DataJpaTest As explained by the manual, Spring Boot provides the @DataJpaTest annotation for Spring Data JPA integration testing. Once the @DataJpaTest annotation ",
      "url": "https://vladmihalcea.com/clean-up-test-data-spring/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-11-11T08:05:24+00:00",
      "niche": "spring",
      "score": 32,
      "keywords": []
    },
    {
      "id": "05eb9bbc9d88bf8e",
      "title": "gRPC in Spring Boot",
      "description": "This article explains how to use the Spring gRPC project to enable built-in support for gRPC services in a Spring Boot application. The Spring gRPC project has just announced its 1.0 GA release. gRPC is a modern open-source Remote Procedure Call (RPC) framework that runs in any environment. By default, it uses Google’s Protocol Buffer [&#8230;] The post gRPC in Spring Boot appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/12/15/grpc-spring/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-12-15T08:28:11+00:00",
      "niche": "spring",
      "score": 32,
      "keywords": []
    },
    {
      "id": "72b78b7bee96ecd6",
      "title": "Spring Boot Built-in API Versioning",
      "description": "This article explains how to use Spring Boot built-in API versioning feature to expose different versions of REST endpoints. This is one of the most interesting updates introduced with Spring Boot 4. API versioning can be implemented using Spring Web&#8217;s standard REST API capabilities. If you&#8217;re interested in this approach, check out my somewhat outdated [&#8230;] The post Spring Boot Built-in API Versioning appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/12/01/spring-boot-built-in-api-versioning/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-12-01T10:59:38+00:00",
      "niche": "spring",
      "score": 32,
      "keywords": []
    },
    {
      "id": "86a740f98d3c0106",
      "title": "Arconia for Spring Boot Dev Services and Observability",
      "description": "This article explains how to use the Arconia framework to enhance the developer experience with Spring Boot. This project is a recent initiative under active development. However, it caught my attention because of one feature I love in Quarkus and found missing in Spring Boot. I am referring to a solution called Dev Services, which [&#8230;] The post Arconia for Spring Boot Dev Services and Observability appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/11/21/arconia-for-spring-boot-dev-services-and-observability/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-11-21T09:32:46+00:00",
      "niche": "spring",
      "score": 32,
      "keywords": []
    },
    {
      "id": "b87cc93c28463cbd",
      "title": "Offset and Keyset Pagination with Spring Data JPA",
      "description": "The post Offset and Keyset Pagination with Spring Data JPA appeared first on Thorben Janssen. Pagination is a common and easy approach to ensure that huge result sets don&#8217;t slow down your application. The idea is simple. Instead of fetching the entire result set, you only fetch the subset you want to show in the UI or process in your business code. When doing that, you can choose between 2... The post Offset and Keyset Pagination with Spring Data JPA appeared first on Thorben Janssen.",
      "url": "https://thorben-janssen.com/offset-and-keyset-pagination-with-spring-data-jpa/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2025-11-26T13:20:14+00:00",
      "niche": "spring",
      "score": 32,
      "keywords": []
    },
    {
      "id": "d8205bbbe027bc08",
      "title": "Spring AI: Mapping LLM Responses to Java Objects",
      "description": "The post Spring AI: Mapping LLM Responses to Java Objects appeared first on Thorben Janssen. Working with large language models often starts simple. You send a question and get a text response. That works fine if you show the answer to a user, but it becomes a problem when you want to process it in your business logic. Plain text is unstructured. Parsing it is an error-prone task, especially when... The post Spring AI: Mapping LLM Responses to Java Objects appeared first on Thorben Janssen.",
      "url": "https://thorben-janssen.com/spring-ai-mapping-llm-responses/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2025-11-19T09:42:05+00:00",
      "niche": "spring",
      "score": 32,
      "keywords": []
    },
    {
      "id": "941dac7057eb513e",
      "title": "A Bootiful Podcast: Apache Tomcat legend Mark Thomas (Happy new year!)",
      "description": "In this episode, I talk with Mark Thomas, the legendary and highly prolific committer to Apache Tomcat. Happy New Year!",
      "url": "https://spring.io/blog/2026/01/01/a-bootiful-podcast-mark-thomas",
      "source": "Spring Blog (Official)",
      "author": "joshlong",
      "published": "2026-01-01T00:00:00+00:00",
      "niche": "spring",
      "score": 28,
      "keywords": []
    },
    {
      "id": "09037c3675c0329c",
      "title": "How To – Structured Logging with Spring Boot",
      "description": "Last Updated on November 14, 2024 by jt Support for Structured Logging is a new Spring Boot feature introduced with the Spring Boot 3.4.0 release. Structured Logging is fairly common to use in distributed environments where you are using some type of consolidated logging. Typically, you will use a JSON log format to allow for [&#8230;]Continue reading The post How To – Structured Logging with Spring Boot first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-structured-logging-with-spring-boot/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-11-11T17:58:27+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "b389034d1298c7dc",
      "title": "How to Convert a String to char in Java",
      "description": "Last Updated on October 28, 2024 by jt Converting a String to char is a common task in Java. Java provides several ways to achieve this. In this blog post, we’ll cover the primary methods and highlight when to use each one. String to char Using charAt() Method The most common way to convert a [&#8230;]Continue reading The post How to Convert a String to char in Java first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-convert-a-string-to-char-in-java/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-28T15:08:56+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "bfc73f15b55b0893",
      "title": "How to Use – Java if else statement",
      "description": "Last Updated on October 26, 2024 by jt The if else statement is a fundamental control structures in Java.. This structure evaluates conditions and executes code based on whether those conditions are true or false. Let’s look at how to use if, if else, and else if statements effectively. The Java if Statement An if [&#8230;]Continue reading The post How to Use – Java if else statement first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-use-java-if-else-statement/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-26T12:01:06+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "1898c7a2cfd791f1",
      "title": "How to Use the Java Substring Method",
      "description": "Last Updated on October 25, 2024 by jt The substring() method in Java is a tool for manipulating strings. It allows you to extract a portion of a string by specifying a start index, and optionally, an end index. Basic Usage of substring() The Java substring() method has two variations: In this example: Important Details [&#8230;]Continue reading The post How to Use the Java Substring Method first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-use-the-java-substring-method/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-25T13:27:36+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "e6ff7d376dd1b6b6",
      "title": "How To Convert int to String in Java",
      "description": "Last Updated on October 22, 2024 by jt Converting an int to a String is a common task in Java, especially when working with user interfaces, file output, or JSON formatting. Java provides several ways to perform this conversion, each with different use cases and characteristics. In this blog post, I will cover the most [&#8230;]Continue reading The post How To Convert int to String in Java first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-convert-int-to-string-in-java/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-22T17:16:03+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "fc6837ada1289eb3",
      "title": "How to Convert String to int in Java",
      "description": "Last Updated on October 22, 2024 by jt String to int conversions are a common task in Java, especially when dealing with user input or API calls. Java provides several ways to perform this conversion. This blog post will cover the most common methods for converting a String to an Integer and cover best practices [&#8230;]Continue reading The post How to Convert String to int in Java first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-convert-string-to-integer-in-java/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-22T13:40:16+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "92dd433b17e63923",
      "title": "How to The Jackson Object Mapper with JSON",
      "description": "Last Updated on October 22, 2024 by jt Introduction As a Java developer, a common task you&#8217;ll encounter is converting between Java objects and JSON. The Jackson library is a powerful and widely used tool for this purpose. Whether you&#8217;re building RESTful APIs, microservices, or simply handling JSON data in your application, Jackson&#8217;s ObjectMapper class [&#8230;]Continue reading The post How to The Jackson Object Mapper with JSON first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/how-to-the-jackson-object-mapper-with-json/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-20T16:40:39+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "d64890d08a5a5184",
      "title": "How To – The Java XOR Operator",
      "description": "This tutorial covers the Java XOR operator, represented by the ^ symbol, which operates on boolean and integer types. It explains how XOR functions as a logical operator for booleans, returning true for different values, and performs a bitwise operation for integers, illustrating with examples and truth tables. The post How To – The Java XOR Operator first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/the-java-xor-operator/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-18T19:20:45+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "dc447e3a43e1699d",
      "title": "How to Create Dynamic Output with the Java printf() Method",
      "description": "Last Updated on October 22, 2024 by jt The Java printf() output method is used to generate a formatted string. Data from the arguments is written and formatted placeholders. In this tutorial we will explore the functionality of the printf() method. The Java language was heavily inspired by the C programming language. As such, the [&#8230;]Continue reading The post How to Create Dynamic Output with the Java printf() Method first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/java-output-printf-method/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-16T19:16:02+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "337d41ea885f7452",
      "title": "How to Use Structured Outputs with Spring AI",
      "description": "Last Updated on October 20, 2024 by jt What are Structured Outputs? Using Structured Outputs is an important aspect when interacting with LLMs programmatically. LLMs, by their nature, generate unstructured output. The unstructured output does not work well with programming languages which need structure to understand the data. Through prompting techniques, you can direct the [&#8230;]Continue reading The post How to Use Structured Outputs with Spring AI first appeared on Spring Framework Guru.",
      "url": "https://springframework.guru/using-structured-outputs-with-spring-ai/",
      "source": "Spring Framework Guru",
      "author": "jt",
      "published": "2024-10-14T17:50:44+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "9affd390d78c61ce",
      "title": "Getting Started with Spring Security and JWT",
      "description": "Spring Security provides a comprehensive set of security features for Java applications, covering authentication, authorization, session management, and protection against common security threats such as CSRF (Cross-Site Request Forgery).",
      "url": "https://reflectoring.io/spring-security-jwt/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-06-19T00:00:00+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "06b145cca57d92f7",
      "title": "Setting Up JUnit with Spring Boot Test",
      "description": "Whether you are building REST APIs, service-layer logic, or data-access layers, Spring Boot offers first-class support for JUnit and provides convenient annotations and utilities for writing clean, maintainable tests. The post Setting Up JUnit with Spring Boot Test appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/junit/junit-version-with-spring-boot/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-12-02T10:49:42+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "5c939834b9a06aa2",
      "title": "Spring AI Custom CallAdvisor & StreamAdvisor Example",
      "description": "Spring AI CallAdvisor and StreamAdvisor provide hooks to wrap around LLM invocations, both for synchronous and streaming scenarios. The post Spring AI Custom CallAdvisor & StreamAdvisor Example appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/spring-ai/spring-ai-calladvisor-streamadvisor-example/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-06-16T20:43:48+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "acee43e7d27854cd",
      "title": "Angular UI Testing using Selenium and Selenide",
      "description": "In-browser UI testing of Angular applications poses several challenges such as asynchronous operations and unpredictable loading screens with spinners or dimmers. Selenide has an implicit capability to wait for the loading screen to disappear. The post Angular UI Testing using Selenium and Selenide appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/java/angular-ui-testing-using-d-selenide/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-02-17T08:39:53+00:00",
      "niche": "spring",
      "score": 27,
      "keywords": []
    },
    {
      "id": "414fdef217f8eac5",
      "title": "I love Spring Security 7 so much",
      "description": "I love Spring Security so much.",
      "url": "https://joshlong.com/jl/blogpost/i-love-spring-security-7.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-12-17T00:00:00+00:00",
      "niche": "spring",
      "score": 26,
      "keywords": []
    },
    {
      "id": "efa5d2b87b0e1288",
      "title": "Offloading File Transfers with Amazon S3 Presigned URLs in Spring Boot",
      "description": "When building web applications that involve file uploads or downloads, a common approach is to have the files pass through an application server.",
      "url": "https://reflectoring.io/offloading-file-transfers-with-amazon-s3-presigned-urls-in-spring-boot/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-06-15T00:00:00+05:30",
      "niche": "spring",
      "score": 24,
      "keywords": []
    },
    {
      "id": "ce15f62abbd12e67",
      "title": "Reactive APIs Offered by Apache HttpClient",
      "description": "In this article, we are going to learn about reactive APIs offered by Apache HttpClient APIs. We are going to explore how to use reactive, full-duplex HTTP/1.",
      "url": "https://reflectoring.io/apache-http-client-reactive-apis/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-05-29T00:00:00+11:00",
      "niche": "spring",
      "score": 24,
      "keywords": []
    },
    {
      "id": "f07861b91f1165ec",
      "title": "How to Handle and Fix java.io.NotSerializableException",
      "description": "Learn ways to work around or correct java.io.NotSerializableException when dealing with Java runtime serialization. The post How to Handle and Fix java.io.NotSerializableException first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/939626195/0/baeldung~How-to-Handle-and-Fix-javaioNotSerializableException",
      "source": "Baeldung",
      "author": "Umara Mushtaq",
      "published": "2026-01-03T14:47:15+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "4a07baedbcf0ac60",
      "title": "A Guide to @ConcreteProxy in Hibernate",
      "description": "Learn how to use Hibernate's @ConcreteProxy annotation to lazy-load polymorphic associations to the correct types in inheritance hierarchies. The post A Guide to @ConcreteProxy in Hibernate first appeared on Baeldung.&#160;&#160;&#160;&#160;&#160;&#160;&#160;",
      "url": "https://feeds.feedblitz.com/~/939624533/0/baeldung~A-Guide-to-ConcreteProxy-in-Hibernate",
      "source": "Baeldung",
      "author": "Hardik Singh Behl",
      "published": "2026-01-03T14:44:40+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "b4440c52669296e5",
      "title": "The best way to replace the deprecated GenericGenerator",
      "description": "Introduction In this article, I&#8217;m going to show you the best way to replace the deprecated @GenericGenerator when upgrading your application to Hibernate 7. Hibernate @GenericGenerator annotation The @GenericGenerator annotation has been available since Hibernate 3.5, as an alternative to the &#60;generator&#62; XML element from HBM mappings. As illustrated by the Hibernate 6.5 @GenericGenerator Javadoc, this annotation was deprecated in favor of the @IdGeneratorType meta-annotation, which",
      "url": "https://vladmihalcea.com/replace-deprecated-genericgenerator/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-12-02T08:23:12+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "32e9382ba43ef9c4",
      "title": "Book Review – Just Use Postgres!",
      "description": "Introduction My friend, Denis Magda, wrote a wonderful book called Just Use Postgres!, and I&#8217;m glad that I got the chance to read it. Audience This book is useful for any software developer who&#8217;s either using PostgreSQL or plans on using it because it covers a lot of features that are very useful for modern applications. No matter your level of seniority, you are definitely going to learn from Denis&#8217; book. Content Just Use Postgres! has 402 pages, 3 parts, and 11 chapters. The ",
      "url": "https://vladmihalcea.com/book-review-just-use-postgres/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-11-24T09:00:34+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "b3725faf35c7a6b4",
      "title": "Book Review – Troubleshooting Java",
      "description": "Introduction My friend, Laurentiu Spilca, has been working on the second edition of his Troubleshooting Java book, and when I was asked to review it, I was more than happy to do it since the book features a lot of topics that I&#8217;m also very interested in, such as performance tuning and query optimization. Audience This book is useful for any Java developer because it teaches you how to get the best out of your IDE debugger, as well as showing you how to profile Java applications and fix ver",
      "url": "https://vladmihalcea.com/book-review-troubleshooting-java/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-10-15T08:28:01+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "ae80642099134389",
      "title": "Twelve years of blogging",
      "description": "Twelve years later! Twelve years ago today, I decided to create this blog on WordPress.com to share whatever I was finding interesting while working as a software architect. Prior to starting this blog, I didn&#8217;t have any writing experience, which you can clearly see in the first article I&#8217;ve ever published. However, practice makes perfect, and in time, I managed to learn how to express myself in writing, whether it was an article, a social media post, an answer on StackOverflow, or a",
      "url": "https://vladmihalcea.com/twelve-years-of-blogging/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-09-30T11:35:44+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "9dddbd8c7d517a3c",
      "title": "MySQL Query Optimization with Releem",
      "description": "Introduction In this article, I&#8217;m going to show you how to optimize the queries executed by a Spring application running on MySQL using Releem. For a short introduction about Releem, check out this previous article, in which I explained how to set up Releem to collect metrics from your MySQL database. Spring Petclinic application The application under test is going to be the well-known Spring Petclinic that we are going to run using the MySQL profile: After starting the application, we are",
      "url": "https://vladmihalcea.com/mysql-query-optimization-releem/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-05-12T18:46:00+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "4c1077e07b72434a",
      "title": "Foundations of AI and Machine Learning for Java Developers Course Review",
      "description": "Introduction In this article, I&#8217;m going to review the Foundations of AI and Machine Learning for Java Developers video course from my fellow Java Champion, Frank Greco. If you are new to AI and ML and want to get a great introduction to these topics, then you should definitely join watch the video lessons created by Frank Greco. And, thanks to LinkedIn Learning&#8217;s generosity, until June 20, you can enroll in this video course for free. Video Course Agenda The course provides one hour ",
      "url": "https://vladmihalcea.com/foundations-of-ai-and-ml-course-review/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-04-11T08:26:55+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "c1db60872cc56406",
      "title": "How to map the Oracle TIMESTAMP WITH TIME ZONE with JPA",
      "description": "Introduction In this article, I&#8217;m going to explain how to map the Oracle TIMESTAMP WITH TIME ZONE with JPA and Hibernate. While the DATE and TIMESTAMP column types are suitable for mapping the LocalDateTime, the TIMESTAMP WITH TIME ZONE column type allows us to map both the ZonedDateTime and OffsetDateTime. Oracle TIMESTAMP WITH TIME ZONE Traditionally, Oracle provided the DATE and TIMESTAMP column types to store timestamp values. The difference between the DATE and TIMESTAMP types is that",
      "url": "https://vladmihalcea.com/oracle-timestamp-with-time-zone-jpa/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-03-18T16:21:37+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "737f1ecd555218a0",
      "title": "MySQL Performance Tuning with Releem",
      "description": "Introduction If your application uses MySQL and you&#8217;re interested in getting the best out of it via performance tuning and monitoring, then Releem is a very nice tool that can assist you in your endeavor. I discovered Releem from Roman Agabekov&#8217;s posts on social media. Roman is the founder of this tool, and since his posts about MySQL performance tuning are very insightful, I decided to give it a try and see what it has to offer. Installing Releem Releem uses a client-server architec",
      "url": "https://vladmihalcea.com/mysql-performance-tuning-releem/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-02-10T18:04:50+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "7a9059b46a2a2d4e",
      "title": "Why you should use compact table columns",
      "description": "Introduction In this article, I&#8217;m going to explain you should use compact table columns when designing your database schema. By using compact table columns, you can cache more table records and index entries and, therefore, speed up your SQL queries. Database caching As I explained in this article, relational database systems cache the pages that are loaded from the disk in the Buffer Pool (e.g., shared buffers in PostgreSQL) so that the next time the same page is requested by an SQL query",
      "url": "https://vladmihalcea.com/compact-table-columns/",
      "source": "Vlad Mihalcea",
      "author": "vladmihalcea",
      "published": "2025-01-14T12:10:05+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "ec2e71754354783c",
      "title": "My newest keyboard: a Keychron K11 Max (Alice Layout) QMK/VIA Wireless Custom Mechanical Keyboard",
      "description": "I just got back from Malmö, Sweden, where I spoke at the amazing ØREDEV conference. I love that show! I'ves spoken there various times over the years, including waaaay back in 2013 where I had the pleasure of meeting XKCD creator Randall Munroe.",
      "url": "https://joshlong.com/jl/blogpost/my-new-keychron-ergo-keyboard.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-11-08T00:00:00+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "7b8b5e2364724498",
      "title": "Some Over Indulgent fun with ChatGPT's Image Rendering",
      "description": "ChatGPT just announced a new feature that allows you to upload a photo or other reference and then have it re-render that image in another style. And it will, quite handily, do so in the style of tons of different cartoons and comic book artists. What's interesting to me is that it won't render art in the style of still-living comic book artists, only those that have (sadly) passed on. It will however render things in the style of well-known anime studios whose body of work, and their style, in ",
      "url": "https://joshlong.com/jl/blogpost/chatgpt-studio-ghibli.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-04-04T00:00:00+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "479976cbb69445d9",
      "title": "Startup CPU Boost in Kubernetes with In-Place Pod Resize",
      "description": "This article explains how to use the In-Place Pod Resize feature in Kubernetes, combined with Kube Startup CPU Boost, to speed up Java application startup. The In-Place Update of Pod Resources feature was initially introduced in Kubernetes 1.27 as an alpha release. With version 1.35, Kubernetes has reached GA stability. One potential use case for [&#8230;] The post Startup CPU Boost in Kubernetes with In-Place Pod Resize appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/12/22/startup-cpu-boost-in-kubernetes-with-in-place-pod-resize/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-12-22T08:22:48+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "8596cb63931ed965",
      "title": "A Book: Hands-On Java with Kubernetes",
      "description": "My book about Java and Kubernetes has finally been published! The book “Hands-On Java with Kubernetes” is the result of several months of work and, in fact, a summary of my experiences over the last few years of research and development. In this post, I want to share my thoughts on this book, explain why [&#8230;] The post A Book: Hands-On Java with Kubernetes appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/12/08/a-book-hands-on-java-with-kubernetes/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-12-08T16:05:58+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "d2aacff00db8c65a",
      "title": "MCP with Quarkus LangChain4j",
      "description": "This article shows how to use Quarkus LangChain4j support for MCP (Model Context Protocol) on both the server and client sides. You will learn how to serve tools and prompts on the server side and discover them in the Quarkus MCP client-side application. The Model Context Protocol is a standard for managing contextual interactions with [&#8230;] The post MCP with Quarkus LangChain4j appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/11/24/mcp-with-quarkus-langchain4j/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-11-24T07:45:15+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "e9e51b7b8efde1a6",
      "title": "Quarkus with Buildpacks and OpenShift Builds",
      "description": "In this article, you will learn how to build Quarkus application images using Cloud Native Buildpacks and OpenShift Builds. Some time ago, I published a blog post about building with OpenShift Builds based on the Shipwright project. At that time, Cloud Native Buildpacks were not supported at the OpenShift Builds level. It was only supported [&#8230;] The post Quarkus with Buildpacks and OpenShift Builds appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/11/19/quarkus-with-buildpacks-and-openshift-builds/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-11-19T08:50:04+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "3b617b77083015bb",
      "title": "Running .NET Apps on OpenShift",
      "description": "This article will guide you on running a .NET application on OpenShift using the Source-to-Image (S2I) tool. While .NET is not my primary area of expertise, I have been working with it quite extensively lately. In this article, we will examine more complex application cases, which may initially present some challenges. If you are interested [&#8230;] The post Running .NET Apps on OpenShift appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/11/17/running-net-apps-on-openshift/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-11-17T09:27:34+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "e019c2da8930a7e1",
      "title": "AI Tool Calling with Quarkus LangChain4j",
      "description": "This article will show you how to use Quarkus LangChain4j AI support with the most popular chat models for the &#8220;tool calling&#8221; feature. Tool calling (sometimes referred to as function calling) is a typical pattern in AI applications that enables a model to interact with APIs or tools, extending its capabilities. The most popular AI [&#8230;] The post AI Tool Calling with Quarkus LangChain4j appeared first on Piotr&#039;s TechBlog.",
      "url": "https://piotrminkowski.com/2025/06/23/ai-tool-calling-with-quarkus-langchain4j/",
      "source": "Piotr's TechBlog",
      "author": "piotr.minkowski",
      "published": "2025-06-23T05:19:14+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "577a5c7ec21c998a",
      "title": "AI Glossary for Java Developers",
      "description": "The post AI Glossary for Java Developers appeared first on Thorben Janssen. AI introduces many new terms, acronyms, and techniques you must understand to build a good AI-based system. That makes it hard for many Java developers to learn how to integrate AI into their applications using SpringAI, Langchain4J, or some other library. I ran into the same issue when I started learning about AI. In this... The post AI Glossary for Java Developers appeared first on Thorben Janssen.",
      "url": "https://thorben-janssen.com/ai-glossary-for-java-developers/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2025-11-27T13:36:58+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "a2e6173c15564377",
      "title": "How to Customize Enum Mappings with @EnumeratedValue",
      "description": "The post How to Customize Enum Mappings with @EnumeratedValue appeared first on Thorben Janssen. Mapping enums with Jakarta Persistence looks simple at first. But the two traditional options, @Enumerated(EnumType.STRING) and @Enumerated(EnumType.ORDINAL), depend on internal enum details that can change over time. If you store the enum value as a String, you will have to migrate your data whenever you decide to rename a value. And if you store the... The post How to Customize Enum Mappings with @",
      "url": "https://thorben-janssen.com/custom-enum-mappings-with-enumeratedvalue/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2025-11-06T17:05:28+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "cf21ff0fb4470d14",
      "title": "Hibernate Performance Tuning – 2025 Edition",
      "description": "The post Hibernate Performance Tuning &#8211; 2025 Edition appeared first on Thorben Janssen. Based on most discussions online and at conferences, there seem to be 2 kinds of projects that use Hibernate for their persistence layer: So, what&#8217;s the difference between these projects? Are the projects in the 2nd group more complex or have higher performance requirements? No, based on my consulting projects, that&#8217;s not the case. On... The post Hibernate Performance Tuning &#8211; 2025 Edi",
      "url": "https://thorben-janssen.com/hibernate-performance-tuning/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2025-01-15T09:15:54+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "e2a54fda8458da1b",
      "title": "Date and Time Mappings with Hibernate and JPA",
      "description": "The post Date and Time Mappings with Hibernate and JPA appeared first on Thorben Janssen. Databases support various data types to store date and time information. The most commonly used ones are: You can map all of them with JPA and Hibernate. But you need to decide to which Java type you want to map your database column. The Java language supports a bunch of classes to represent date and... The post Date and Time Mappings with Hibernate and JPA appeared first on Thorben Janssen.",
      "url": "https://thorben-janssen.com/hibernate-jpa-date-and-time/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-12-04T11:55:40+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "3c49da9852171ddc",
      "title": "How to define a repository with Jakarta Data and Hibernate",
      "description": "The post How to define a repository with Jakarta Data and Hibernate appeared first on Thorben Janssen. Repositories are a commonly used pattern for persistence layers. They abstract from the underlying data store or persistence framework and hide the technical details from your business code. Using Jakarta Data, you can easily define such a repository as an interface, and you&#8217;ll get an implementation of it based on Jakarta Persistence or Jakarta NoSQL.... The post How to define a repositor",
      "url": "https://thorben-janssen.com/jakarta-data-repository/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-06-26T06:51:10+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "37af0b4b5e585dd4",
      "title": "Getting Started with Jakarta Data and Hibernate",
      "description": "The post Getting Started with Jakarta Data and Hibernate appeared first on Thorben Janssen. Jakarta Data standardizes stateless repositories based on Jakarta Persistence and Jakarta NoSQL so that you can concentrate on your business code instead of handling the technical details of simple queries. In this article, I will briefly introduce the new specification and give you an overview of its stateless repositories. In future articles, we will dive... The post Getting Started with Jakarta Data an",
      "url": "https://thorben-janssen.com/getting-started-with-jakarta-data/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-06-19T07:50:00+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "42dc68c1b0d8b255",
      "title": "Should your tests manage transactions?",
      "description": "The post Should your tests manage transactions? appeared first on Thorben Janssen. During my Spring Data JPA workshops and talks, I often get asked if a test case should handle transactions, or not. And if it handles the transaction if it should commit it or roll it back. And as so often, the short answer is: it depends. The slightly longer answer is: it depends on the... The post Should your tests manage transactions? appeared first on Thorben Janssen.",
      "url": "https://thorben-janssen.com/should-your-tests-manage-transactions/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-06-12T08:00:00+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "05b7cbe720f0fecd",
      "title": "Databases and AI with Neo4J as an example with Michael Simons",
      "description": "The post Databases and AI with Neo4J as an example with Michael Simons appeared first on Thorben Janssen. When integrating AI into your application, you will most likely want to use a concept called RAG. This acronym stands for Retrieval Augmented Generation and is an absolute game changer. The idea is simple: By providing your own input data to your LLM, you can improve the quality of its response and let it include... The post Databases and AI with Neo4J as an example with Michael Simons appea",
      "url": "https://thorben-janssen.com/expertsession-databases-and-ai/",
      "source": "Thorben Janssen",
      "author": "Thorben Janssen",
      "published": "2024-06-11T08:01:47+00:00",
      "niche": "spring",
      "score": 14,
      "keywords": []
    },
    {
      "id": "e722e3582008693e",
      "title": "Guide to JUnit 5 Functional Interfaces",
      "description": "In this article, we will get familiar with JUnit 5 functional interfaces. JUnit 5 significantly advanced from its predecessors. Features like functional interfaces can greatly simplify our work once we grasp their functionality.",
      "url": "https://reflectoring.io/junit5-functional-interfaces/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-07-12T00:00:00+11:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "d28b63165ee6fa0d",
      "title": "Creating and Publishing an NPM Package with Automated Versioning and Deployment",
      "description": "In this step-by-step guide, we&rsquo;ll create, publish, and manage an NPM package using TypeScript for better code readability and scalability. We&rsquo;ll write test cases with Jest and automate our NPM package versioning and publishing process using Changesets and GitHub Actions.",
      "url": "https://reflectoring.io/create-and-publish-npm-package/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-06-16T00:00:00+11:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "9cb2477beda6f2e2",
      "title": "Apache HttpClient Configuration",
      "description": "Configuring Apache HttpClient is essential for tailoring its behavior to meet specific requirements and optimize performance. From setting connection timeouts to defining proxy settings, configuration options allow developers to fine-tune the client&rsquo;s behavior according to the needs of their application.",
      "url": "https://reflectoring.io/apache-http-client-config/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-05-29T00:00:00+11:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "e9b1ae6851acc6d8",
      "title": "Async APIs Offered by Apache HttpClient",
      "description": "In this article, we are going to learn about the async APIs offered by Apache HttpClient. We are going to explore the different ways Apache HttpClient enables developers to send and receive data over the internet in asynchronous mode.",
      "url": "https://reflectoring.io/apache-http-client-async-apis/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-05-29T00:00:00+11:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "8a9576199b4aa560",
      "title": "Classic APIs Offered by Apache HttpClient",
      "description": "In this article, we are going to learn about the classic APIs offered by Apache HttpClient. We are going to explore the different ways Apache HttpClient helps us to send and receive data over the internet in classic (synchronous) mode.",
      "url": "https://reflectoring.io/apache-http-client-classic-apis/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-05-29T00:00:00+11:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "1f224610cc4f027c",
      "title": "Create a HTTP Client with Apache HttpClient",
      "description": "In this article series, we&rsquo;re going to explore Apache HTTPClient APIs. We&rsquo;ll get familiar with the different ways Apache HttpClient enables developers to send and receive data over the internet.",
      "url": "https://reflectoring.io/create-a-http-client-with-apache-http-client/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-05-29T00:00:00+11:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "d5c8dfa034d26e82",
      "title": "Clean Test Automation Monthly 12 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 13 interesting or useful blog posts which I read during December 2025. Read More The post Clean Test Automation Monthly 12 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 10 / 2025Clean Test Automation Monthly 9 / 2025Clean Test Automation Monthly 8 / 2025&#160",
      "url": "https://feeds.feedblitz.com/~/939504830/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-12-31T14:07:18+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "e46493a65bccb8cf",
      "title": "Software Development Monthly 11 / 2025",
      "description": "The Software Development Monthly is a monthly blog post that highlights interesting or useful blog posts which I read during the previous month. This blog post shares 15 interesting or useful blog posts which I read during November 2025. Read More The post Software Development Monthly 11 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesSoftware Development Monthly 12 / 2025Software Development Monthly 10 / 2025Software Development Monthly 8 / 2025&#160;",
      "url": "https://feeds.feedblitz.com/~/932688041/0/petrikainulainen~Software-Development-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-12-09T17:14:44+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "3d17336a2906ee21",
      "title": "Clean Test Automation Monthly 11 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 16 interesting or useful blog posts which I read during November 2025. Read More The post Clean Test Automation Monthly 11 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 8 / 2025Clean Test Automation Monthly 7 / 2025Software Development Monthly 12 / 2025&#160;",
      "url": "https://feeds.feedblitz.com/~/930759443/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-12-01T16:55:31+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "579682b50910e7f9",
      "title": "AI Assisted Engineering With an AI Chatbot - From Idea to Working Code",
      "description": "Sometimes I know exactly what I need, but I don't know how I can get it done. In the past, I would have spent hours reading the reference documentation or tried to find tutorials which explain how I can write the code (or configuration) I need. Nowadays, I just start a new discussion with an AI chatbot and let the conversation evolve into a working code (or configuration). This blog post highlights six concrete success stories from my short AI assisted engineering journey. Read More The post AI ",
      "url": "https://feeds.feedblitz.com/~/927768650/0/petrikainulainen~AI-Assisted-Engineering-With-an-AI-Chatbot-From-Idea-to-Working-Code/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-11-15T14:37:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "b569f41ba20a588e",
      "title": "Software Development Monthly 10 / 2025",
      "description": "The Software Development Monthly is a monthly blog post that highlights interesting or useful blog posts which I read during the previous month. This blog post shares 19 interesting or useful blog posts which I read during October 2025. Read More The post Software Development Monthly 10 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesSoftware Development Monthly 9 / 2025Software Development Monthly 12 / 2025Software Development Monthly 11 / 2025&#160;",
      "url": "https://feeds.feedblitz.com/~/927423617/0/petrikainulainen~Software-Development-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-11-09T16:26:51+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "7da28f3e83236bfc",
      "title": "Clean Test Automation Monthly 10 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 14 interesting or useful blog posts which I read during October 2025. Read More The post Clean Test Automation Monthly 10 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 9 / 2025Clean Test Automation Monthly 8 / 2025Clean Test Automation Monthly 4 / 2025&#160;",
      "url": "https://feeds.feedblitz.com/~/927068678/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-11-01T18:58:57+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "37eb21dc334330f8",
      "title": "Software Development Monthly 9 / 2025",
      "description": "The Software Development Monthly is a monthly blog post that highlights interesting or useful blog posts which I read during the previous month. This blog post shares 19 interesting or useful blog posts which I read during September 2025. Read More The post Software Development Monthly 9 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesSoftware Development Monthly 10 / 2025Software Development Monthly 12 / 2025Software Development Monthly 11 / 2025&#160;",
      "url": "https://feeds.feedblitz.com/~/925881437/0/petrikainulainen~Software-Development-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-10-07T09:00:40+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "10ba96a6a2102cd2",
      "title": "Clean Test Automation Monthly 9 / 2025",
      "description": "The Clean Test Automation Monthly is a monthly blog post that highlights interesting or useful test automation content which I read during the current month. This blog post shares 21 interesting or useful blog posts which I read during September 2025. Read More The post Clean Test Automation Monthly 9 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesClean Test Automation Monthly 10 / 2025Clean Test Automation Monthly 12 / 2025Clean Test Automation Monthly 11 / 2025&#1",
      "url": "https://feeds.feedblitz.com/~/925562264/0/petrikainulainen~Clean-Test-Automation-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-09-30T05:22:24+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "6038fbbc53ce0d9d",
      "title": "Software Development Monthly 8 / 2025",
      "description": "The Software Development Monthly is a monthly blog post that highlights interesting or useful blog posts which I read during the previous month. This blog post shares 15 interesting or useful blog posts which I read during August 2025. Read More The post Software Development Monthly 8 / 2025 appeared first on Petri Kainulainen. &#160;&#160;&#160;Related StoriesSoftware Development Monthly 11 / 2025Software Development Monthly 12 / 2025Clean Test Automation Monthly 11 / 2025&#160;",
      "url": "https://feeds.feedblitz.com/~/924471290/0/petrikainulainen~Software-Development-Monthly/",
      "source": "Petri Kainulainen",
      "author": "Petri Kainulainen",
      "published": "2025-09-07T09:35:45+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "f10dd556926dee6f",
      "title": "QCon AI New York 2025: AI Works, PRs Don't: How AI is Breaking the SDLC and What to Do about it",
      "description": "Michael Webster, Principal Engineer at CircleCI, presented “AI Works, Pull Requests Don’t: How AI Is Breaking the SDLC and What to Do about It” at QCon AI New York 2025. Webster discussed the impact of AI on the Software Development Lifecycle (SDLC) and Continuous Integration/Continuous Delivery (CI/CD) processes at CircleCI. By Michael Redlich",
      "url": "https://www.infoq.com/news/2025/12/ai-in-sdlc-webster/?utm_campaign=infoq_content&utm_source=infoq&utm_medium=feed&utm_term=Java",
      "source": "InfoQ Java",
      "author": "Michael Redlich",
      "published": "2025-12-30T23:30:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "e7e36525f413d793",
      "title": "Automating Monolith Migration for Resource-Constrained Edge Systems",
      "description": "We usually design microservices with a cloud-first mindset. If a container needs more RAM, we scale it up. If latency increases, we add a cache or a load balancer. But the world is shifting toward Software-Defined Vehicles (SDVs) and edge computing. In these environments, hardware is fixed, and latency can be a matter of life and death (e.g., autonomous braking systems). Migrating a legacy C/C++ monolith to microservices in this context is dangerous. The overhead of containerization (Docker) and",
      "url": "https://feeds.dzone.com/link/18931/17245206/automating-monolith-migration-for-resource-constra",
      "source": "DZone Microservices",
      "author": "Dippu Kumar Singh",
      "published": "2026-01-01T20:00:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "ac8ea12ee6645b48",
      "title": "JUnit @AutoClose Annotation with Examples",
      "description": "JUnit @AutoClose automatically close resources that implement AutoCloseable after each test, without requiring explicit cleanup code. If any exception occurs during closing the resource, the exception is suppressed. The post JUnit @AutoClose Annotation with Examples appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/junit/junit-autoclose-examples/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-12-02T11:23:01+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "32dd70f09a1f9763",
      "title": "JUnit 6 Nullability: @Nullable, @NotNull & @NullMarked",
      "description": "With the release of JUnit 6.0.0, the maintainers adopted JSpecify nullability annotations across all JUnit modules. It means that method parameters, return types, and other API elements in JUnit are now annotated to explicitly declare whether they accept or return null. The post JUnit 6 Nullability: @Nullable, @NotNull & @NullMarked appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/junit/junit-6-nullability/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-12-01T09:36:30+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "1cd17f094d6beb0f",
      "title": "JUnit 6 Gradle Dependency",
      "description": "Learn how to configure JUnit 6 with Gradle. This tutorial discusses the artifacts we need, how to set up our build.gradle, and how to execute the tests. The post JUnit 6 Gradle Dependency appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/junit/junit-6-gradle-dependency/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-12-01T08:50:04+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "74d529f271846e99",
      "title": "JUnit 6 Maven Dependency",
      "description": "Learn to configure JUnit 6 maven dependencies by including the mandatory junit-jupiter-engine along with optionals such as the API, params, and platform components. The post JUnit 6 Maven Dependency appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/junit/junit-6-maven-dependency/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-12-01T08:30:45+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "cbbcd67377a8aec8",
      "title": "JUnit 6 Tutorial with Examples",
      "description": "JUnit 6 is a modern, polished evolution of JUnit 5 that embraces Java 17+, improves extension handling, enhances performance, and adds new features like nullability annotations and native Kotlin coroutine support. The post JUnit 6 Tutorial with Examples appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/junit/junit-6-tutorial/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-12-01T08:04:43+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "7834d85f0a715170",
      "title": "Selenide IllegalArgumentException: Failed to create folders",
      "description": "The error \"java.lang.IllegalArgumentException: Failed to create folder\" in Selenide typically happens when Selenide tries to save screenshots, page sources, or logs, but it cannot create the required directories due to permission issues or incorrect paths. The post Selenide IllegalArgumentException: Failed to create folders appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/java/exception-handling/selenide-illegalargumentexception-failed-to-create-folders/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-02-17T10:42:41+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "298a11af14d34bd6",
      "title": "How to Fix MySQL Innodb_Force_Recovery Not Working Issue?",
      "description": "When InnoDB tables become corrupted, the InnoDB storage engine typically crashes the MySQL server to prevent further damage. In such situations, you can use the innodb_force_recovery option to force the server to start despite the corruption. However, you may face a situation where the innodb_force_recovery fails to start the server. This issue can occur for ... Read more The post How to Fix MySQL Innodb_Force_Recovery Not Working Issue? appeared first on HowToDoInJava.",
      "url": "https://howtodoinjava.com/sql/fix-mysql-innodb_force_recovery-not-working-issue/",
      "source": "HowToDoInJava",
      "author": "Lokesh Gupta",
      "published": "2025-02-11T10:53:49+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "f66061a9b1f9063b",
      "title": "Thread Dumps and Project Loom (Virtual Threads)",
      "description": "If you’ve been keeping up with Java virtual threads, you already know that this hot new feature significantly improves hardware utilization for parallel I/O-bound operations. Virtual threads map multiple concurrent I/O operations to a single OS thread without blocking. The novel aspect of this approach is that it requires minimal changes to the codebase, as [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/12/thread-dumps-and-project-loom-virtual-threads/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Igor Kulakov",
      "published": "2025-12-23T14:14:55+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "5fdccaab3228fe35",
      "title": "IntelliJ IDEA 2025.3.1 Is Out!",
      "description": "IntelliJ IDEA 2025.3.1 is out with a number of useful fixes. You can update to this version from inside the IDE, using the Toolbox App, or using snaps if you are a Ubuntu user. You can also download it from our website. The latest update brings the following improvements: For a comprehensive overview of the [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/12/intellij-idea-2025-3-1/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Maria Kosukhina",
      "published": "2025-12-18T15:47:09+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "3e5f01a387386ef2",
      "title": "The Ultimate Guide to Successfully Adopting Kotlin in a Java-Dominated Environment",
      "description": "Adopting Kotlin in a Java-centric company&#160; is not about flipping a switch or rewriting everything “the right way”. It’s about people, timing, risk, and trust. Over the last four weeks, we’ve published a series of blog posts by Urs Peter, covering all of these aspects of migrating to Kotlin. In this post, we’ll tie the [&#8230;]",
      "url": "https://blog.jetbrains.com/kotlin/2025/12/the-ultimate-guide-to-successfully-adopting-kotlin-in-a-java-dominated-environment/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Alyona Chernyaeva",
      "published": "2025-12-18T15:04:44+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "91c7f999b96b59ff",
      "title": "IntelliJ IDEA 2025.3 Is Out Now!",
      "description": "IntelliJ IDEA 2025.3 has arrived!&#160; This version brings significant updates designed to streamline your productivity and help you confidently adopt the latest innovations across the Java ecosystem. You can download this latest release from our website or update to it directly from inside the IDE, via the free Toolbox App, or using snap packages for [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/12/intellij-idea-2025-3/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Maria Kosukhina",
      "published": "2025-12-08T12:17:26+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "a3fe850d7077d13c",
      "title": "The Unified IntelliJ IDEA: More Free Features, a Better Experience, Smoother Flow",
      "description": "IntelliJ IDEA is now a unified product! As we announced back in July, starting from this release (2025.3), there is one IntelliJ IDEA, replacing the separate IntelliJ IDEA Community Edition and IntelliJ IDEA Ultimate to keep things simple and convenient. All the functionality of the Community Edition remains free for non-commercial and commercial use. We’re [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/12/intellij-idea-unified-release/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Julia Shashkova",
      "published": "2025-12-08T10:45:57+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "5048908edf40c257",
      "title": "Meet the Islands Theme – The New Default Look for JetBrains IDEs",
      "description": "The&#160;Islands&#160;theme&#160;is now the default look across JetBrains IDEs starting with version 2025.3.This update is more than a visual refresh. It’s our commitment to creating a soft, balanced environment designed to support focus and comfort throughout your workflow. We began introducing the new theme&#160;earlier this year, gathering feedback, conducting research, and testing it hands-on with developers [&#8230;]",
      "url": "https://blog.jetbrains.com/platform/2025/12/meet-the-islands-theme-the-new-default-look-for-jetbrains-ides/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Olga Berdnikova",
      "published": "2025-12-08T09:53:16+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "69807841b19861ac",
      "title": "What’s Fixed in IntelliJ IDEA 2025.3",
      "description": "Welcome to the overview of fixes and improvements in IntelliJ IDEA 2025.3. In this release, we have resolved over 800 bug reports and usability issues throughout the IDE, with the highlights including improvements to the developer experience, Spring support, build tools, version control, the terminal, and more. Below are the most impactful changes that will [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/12/what-s-fixed-in-intellij-idea-2025-3/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Dmitriy Smirnov",
      "published": "2025-12-08T09:10:19+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "c21013c9fd6dd82f",
      "title": "Java Annotated Monthly – December 2025",
      "description": "This month brings significant developments throughout the Java ecosystem. Java has begun announcing JEPs targeted for the upcoming release, while Spring has unveiled major updates with Spring Framework 7 and Spring Boot 4. As always, we&#8217;ve curated the most interesting articles, videos, and podcasts covering Java, Kotlin, Spring, AI, and other relevant topics in technology [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/12/java-annotated-monthly-december-2025/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Irina Mariasova",
      "published": "2025-12-05T10:30:15+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "007a7ea1fa3d6adb",
      "title": "The Deprecation of K1 Mode",
      "description": "As the next step in the evolution of K2 mode, with the IntelliJ IDEA 2025.3 release we are officially deprecating its predecessor, K1 mode. In this post, we’ll give some background about K2 mode and discuss its current state, including adoption numbers, performance test results, and feature parity and stability. As always, we recommend updating [&#8230;]",
      "url": "https://blog.jetbrains.com/idea/2025/12/the-deprecation-of-k1-mode/",
      "source": "JetBrains IntelliJ IDEA Blog",
      "author": "Maria Kosukhina",
      "published": "2025-12-04T09:41:37+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "56d135186f4d31da",
      "title": "Virtual Threads in the Real World: Fast, Robust Java Microservices with Helidon",
      "description": "In 2022, our project made a significant decision: re-write our Netty-based Helidon Web Server to be fully implemented using virtual threads. The result is Helidon 4: the first microservices framework designed from the ground up for virtual threads. We are thrilled with the results, and have learned a few things along the way. Come join us as we introduce you to the benefits of virtual threads, share our lessons learned, give a few tips-and-tricks, and highlight what to look forward to in Java 24",
      "url": "https://inside.java/2025/12/21/virtual-threads-robust-java-microservices/",
      "source": "Inside.java (Oracle)",
      "author": "",
      "published": "2025-12-21T00:00:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "b5affddc6fc03c5b",
      "title": "Java’s 2025 in Review - Inside Java Newscast #103",
      "description": "With 2025 coming to a close, let's summarize Java's year and look at the current state of the six big OpenJDK projects as well as a few other highlights: Project Babylon is still pretty young and hasn't shipped a feature or even drafted a JEP yet. Leyden, not much older, has already shipped a bunch of startup and warmup time improvements, though. Amber is currently taking a breather between its phases 1 and 2 and just like projects Panama and Loom only has a single, mature feature in the fire. A",
      "url": "https://inside.java/2025/12/18/newscast-103/",
      "source": "Inside.java (Oracle)",
      "author": "[\"NicolaiParlog\"]",
      "published": "2025-12-18T00:00:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "f72e75c16c1cd049",
      "title": "Valhalla? Python? Withers? Lombok? - Ask the Architects at JavaOne’25",
      "description": "Should Java get rid of semicolons and what are the next steps for projects Valhalla and Loom? How does Java hold up against Python and what's the hold-up with record withers? The Java architects Ron Pressler, Paul Sandoz, Brian Goetz, Mark Reinhold, Dan Heidinga, Viktor Klang, Gary Frost, Alex Buckley, and John Rose sat down at JavaOne 2025 to answer these and many more audience questions in the Ask The Architect session.",
      "url": "https://inside.java/2025/12/15/javaone-ask-java-architects/",
      "source": "Inside.java (Oracle)",
      "author": "[\"\"]",
      "published": "2025-12-15T00:00:00+00:00",
      "niche": "spring",
      "score": 12,
      "keywords": []
    },
    {
      "id": "aefb2621b1747314",
      "title": "A SQL query to re-create your PostgreSQL database tables' DDL",
      "description": "Hi! It's Christmas as I write this and in many parts of the world and to those of you who celebrate, let me wish you a very merry Christmas indeed!",
      "url": "https://joshlong.com/jl/blogpost/a-useful-postgresql-query-to-rebuild-all-your-tables-ddl.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-12-25T00:00:00+00:00",
      "niche": "spring",
      "score": 10,
      "keywords": []
    },
    {
      "id": "330653954b86c792",
      "title": "The only good kind of Javascript is a Java Script",
      "description": "I just spent a bit too long trying to figure out how to script my Java scripts. I wanted to go as far as giving them a shebang line, but if I created a file called hello.java and put the following in",
      "url": "https://joshlong.com/jl/blogpost/java-scripts-in-java-25.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-10-05T00:00:00+00:00",
      "niche": "spring",
      "score": 10,
      "keywords": []
    },
    {
      "id": "8067f460cfb036f8",
      "title": "Java Scripts and JBang.dev",
      "description": "Let me start by saying: I just think this is really cool. It's not official or anything. Just super cool and only amounts to a few dozen lines of Java code that you could write yourself.",
      "url": "https://joshlong.com/jl/blogpost/java-scripts-and-jbang-dev.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-06-24T00:00:00+00:00",
      "niche": "spring",
      "score": 10,
      "keywords": []
    },
    {
      "id": "e4a45f27fcd9cc76",
      "title": "One Stop Guide to Java Functional Interfaces",
      "description": "Introduction to Functional Programming Functional programming is a paradigm that focuses on the use of functions to create clear and concise code.",
      "url": "https://reflectoring.io/one-stop-guide-to-java-functional-interfaces/",
      "source": "Reflectoring",
      "author": "Inconnu",
      "published": "2024-06-11T00:00:00+11:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "bd44e352f1d3a13c",
      "title": "🎄 Coursera Plus Holiday & New Year Sale (50% OFF): The Smartest Way to Prepare for 2026",
      "description": "Hello guys, I have an exciting news to share with you. Coursera is offering 50% discount, which is quite rare. if you’re serious about upgrading your skills in AI, Machine Learning, Data Engineering, Cloud, and Generative AI, this is one of the best learning deals of the year. If you’re planning to seriously upgrade your skills in AI, Machine Learning, Data Engineering, Cloud, Generative AI, and more in 2026, this is hands down one of the best learning deals of the year. Right now, Coursera Plus",
      "url": "http://javarevisited.blogspot.com/2025/12/coursera-plus-holiday-new-year-sale-50.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-12-21T20:55:00-08:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "adfef6a3cd113a9c",
      "title": "AlgoMonster Holiday Sale: Get 60% Off Premium Membership in 2025 —Here's Why It's Worth It",
      "description": "Hello guys, the holiday season is the perfect time to invest in yourself. And if you're preparing for coding interviews at FAANG or top-tier tech companies, there's no better time than now. AlgoMonster is offering 60% OFF premium membership—the biggest discount of the year. This offer expires soon, so if you've been on the fence about getting serious with coding interview prep, now is the moment. After testing this platform extensively and helping dozens of engineers ace FAANG interviews, I can ",
      "url": "http://javarevisited.blogspot.com/2025/12/algomonster-holiday-sale-get-60-off.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-12-18T20:53:00-08:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "c7eb096df21158ad",
      "title": "Top 10 Web Development Courses Developers Can Join on Frontend Masters in 2026",
      "description": "Hello guys, If you’re serious about becoming a better web developer in 2026, Frontend Masters continues to be one of the best platforms for deep, practical learning. Whether you’re just getting started or looking to level up your skills in React, JavaScript, TypeScript, or even Go, the platform has something for every developer. As a web developer myself, I’ve tried tons of courses across platforms — but the Frontend Masters instructors and curriculum stand out in terms of depth, clarity, and re",
      "url": "http://javarevisited.blogspot.com/2025/12/top-10-web-development-courses.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-12-17T20:49:00-08:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "5bef802a4916f257",
      "title": "21 Best Christmas and New Year Deals for Developers in 2026",
      "description": "Hello guys, while Black Friday and Cyber Monday is over and if you are one of those who were not able to get those awesome black Friday deals then don’t worry, most of the deals are still active and there few new deals for Christmas Day and New Year which you can take. I just spent the last few hours hunting down the absolute best Christmas Day, End of Year, and New Year deals for us Software Engineers, and honestly, I’m blown away by some of these discounts still available. We’re talking 50–80%",
      "url": "http://javarevisited.blogspot.com/2025/12/21-best-christmas-and-new-year-deals.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-12-16T07:22:00-08:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "674ae527164d7e4c",
      "title": "Is Object-Oriented Design Interview: An Insider’s Guide Book Worth it in 2026?",
      "description": "Hello folks, If you’re gearing up for coding and design interviews in 2025, I’ve got something valuable to share. The Object-Oriented Design Interview: An Insider’s Guide by Alex Xu and ByteByteGo has just hit the shelves, and it’s already creating a buzz in the tech interview prep space. In this post, I’ll break down what’s inside this book, why it’s different, and why I believe it’s a must-read for software engineers preparing for interviews at top companies. Let’s dive in. Java, Unix, Tibco R",
      "url": "http://javarevisited.blogspot.com/2025/12/is-object-oriented-design-interview.html",
      "source": "Java Revisited",
      "author": "javin paul (noreply@blogger.com)",
      "published": "2025-12-15T05:25:00-08:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "11970e3a487dff8d",
      "title": "Episode 43 “Predictability or Innovation? Both!” with Georges Saab",
      "description": "Nicolai Parlog discusses these topics with Georges Saab, Senior Vice President of the Java Platform Group and Chair of the OpenJDK Governing Board...",
      "url": "https://inside.java/2025/12/26/podcast-043/",
      "source": "Inside.java (Oracle)",
      "author": "[\"GeorgesSaab\", \"NicolaiParlog\"]",
      "published": "2025-12-26T00:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "2186148a5af86828",
      "title": "Quality Outreach Heads-up - JDK 26: Jlink Compression Plugin Now Handles -c Option Correctly",
      "description": "This Heads-Up is part of the regular communication sent to the projects involved; it covers how jlink processes the compression level set through -c option.",
      "url": "https://inside.java/2025/12/16/quality-heads-up/",
      "source": "Inside.java (Oracle)",
      "author": "[\"Ana-MariaMihalceanu\"]",
      "published": "2025-12-16T00:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "4679e0bf754c2cee",
      "title": "Episode 42 “From Sumatra to Panama, from Babylon to Valhalla” with John Rose",
      "description": "Nicolai interviews John Rose, Senior Architect of the Java Virtual Machine, who brings over 30 years of experience advancing the Java platform...",
      "url": "https://inside.java/2025/12/10/podcast-042/",
      "source": "Inside.java (Oracle)",
      "author": "[\"JohnRose\", \"NicolaiParlog\"]",
      "published": "2025-12-10T00:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "267ec2bf9f7b69ee",
      "title": "Consider using JSON arrays instead of JSON objects for serialisation",
      "description": "When implementing the awesome MULTISET operator in jOOQ, its implementation mostly relied on SQL/JSON support of various RDBMS. In short, while standard SQL supports nested collections via ARRAY or MULTISET operators like this: This is poorly supported in most RDBMS, so jOOQ emulates it using SQL/JSON as follows (or similar): Wait a second. A JSON &#8230; Continue reading Consider using JSON arrays instead of JSON objects for serialisation &#8594;",
      "url": "https://blog.jooq.org/consider-using-json-arrays-instead-of-json-objects-for-serialisation/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2025-08-11T12:43:10+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "0d68161f32ae0ecc",
      "title": "When SQL Meets Lambda Expressions",
      "description": "ARRAY types are a part of the ISO/IEC 9075 SQL standard. The standard specifies how to: But it is very unopinionated when it comes to function support. The ISO/IEC 9075-2:2023(E) 6.47 &#60;array value expression> specifies concatenation of arrays, whereas the 6.48 &#60;array value function> section lists a not extremely useful TRIM_ARRAY function, exclusively (using which &#8230; Continue reading When SQL Meets Lambda Expressions &#8594;",
      "url": "https://blog.jooq.org/when-sql-meets-lambda-expressions/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2025-03-27T13:04:44+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "85cf0a292b76b046",
      "title": "Think About SQL MERGE in Terms of a RIGHT JOIN",
      "description": "RIGHT JOIN is an esoteric feature in the SQL language, and hardly ever seen in the real world, because almost every RIGHT JOIN can just be expressed as an equivalent LEFT JOIN. The following two statements are equivalent: It&#8217;s not unreasonable to expect these two statements to produce the same execution plan on most RDBMS, &#8230; Continue reading Think About SQL MERGE in Terms of a RIGHT JOIN &#8594;",
      "url": "https://blog.jooq.org/think-about-sql-merge-in-terms-of-a-right-join/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2025-03-13T14:45:53+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "664e46b9880cd0b9",
      "title": "Resisting the Urge to Document Everything Everywhere",
      "description": "Every product manager knows this situation: This is such a common pattern, and while it&#8217;s perfectly understandable for such a user to request this, it is so terribly wrong to give in to this user&#8217;s request. Why is it wrong? The features are unrelated Most of the time, the two features X1 and X2 are &#8230; Continue reading Resisting the Urge to Document Everything Everywhere &#8594;",
      "url": "https://blog.jooq.org/resisting-the-urge-to-document-everything-everywhere/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2025-02-28T10:39:07+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "9b398769e8caf446",
      "title": "jOOQ 3.20 released with ClickHouse, Databricks, and much more DuckDB support, new modules, Oracle type hierarchies, more spatial support, decfloat and synonym support, hidden columns, Scala 3, Kotlin 2, and much more",
      "description": "New dialects: jOOQ 3.20 ships with 2 new experimental dialects: ClickHouse is a fast-moving SQL dialect with a historic vendor-specific syntax that is gradually migrated to a more standards compliant alternative, which is why our support is still experimental. A lot of behaviours differ from what one would expect elsewhere, including NULL handling, which is &#8230; Continue reading jOOQ 3.20 released with ClickHouse, Databricks, and much more DuckDB support, new modules, Oracle type hierarchies,",
      "url": "https://blog.jooq.org/jooq-3-20-released-with-clickhouse-databricks-and-much-more-duckdb-support-new-modules-oracle-type-hierarchies-more-spatial-support-decfloat-and-synonym-support-hidden-columns-scala-3-kotlin/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2025-02-20T10:27:54+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "b6a2846d45681045",
      "title": "Emulating SQL FILTER with Oracle JSON Aggregate Functions",
      "description": "A cool standard SQL:2003 feature is the aggregate FILTER clause, which is supported natively by at least these RDBMS: The following aggregate function computes the number of rows per group which satifsy the FILTER clause: This is useful for pivot style queries, where multiple aggregate values are computed in one go. For most basic types &#8230; Continue reading Emulating SQL FILTER with Oracle JSON Aggregate Functions &#8594;",
      "url": "https://blog.jooq.org/emulating-sql-filter-with-oracle-json-aggregate-functions/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2024-06-03T12:17:41+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "055027c5db6593aa",
      "title": "Getting Top 1 Values Per Group in Oracle",
      "description": "I&#8217;ve blogged about generic ways of getting top 1 or top n per category queries before on this blog. An Oracle specific version in that post used the arcane KEEP syntax: This is a bit difficult to read when you see it for the first time. Think of it as a complicated way to say &#8230; Continue reading Getting Top 1 Values Per Group in Oracle &#8594;",
      "url": "https://blog.jooq.org/getting-top-1-values-per-group-in-oracle/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2024-03-01T09:55:41+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "0a02af77d1d1c22d",
      "title": "An Efficient Way to Check for Existence of Multiple Values in SQL",
      "description": "In a previous blog post, we&#8217;ve advertised the use of SQL EXISTS rather than COUNT(*) to check for existence of a value in SQL. I.e. to check if in the Sakila database, actors called WAHLBERG have played in any films, instead of: Do this: (Depending on your dialect you may require a FROM DUAL clause, &#8230; Continue reading An Efficient Way to Check for Existence of Multiple Values in SQL &#8594;",
      "url": "https://blog.jooq.org/an-efficient-way-to-check-for-existence-of-multiple-values-in-sql/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2024-02-16T14:16:45+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "f5da49f9884ad216",
      "title": "A Hidden Benefit of Implicit Joins: Join Elimination",
      "description": "One of jOOQ&#8217;s key features so far has always been to render pretty much exactly the SQL that users expect, without any surprises &#8211; unless some emulation is required to make a query work, of course. This means that while join elimination is a powerful feature of many RDBMS, it isn&#8217;t part of jOOQ&#8217;s feature &#8230; Continue reading A Hidden Benefit of Implicit Joins: Join Elimination &#8594;",
      "url": "https://blog.jooq.org/a-hidden-benefit-of-implicit-joins-join-elimination/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2024-01-10T14:19:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "8b11778798181f4e",
      "title": "jOOQ 3.19’s new Explicit and Implicit to-many path joins",
      "description": "jOOQ 3.19 finally delivers on a set of features that will greatly simplify your queries further, after jOOQ 3.11 introduced implicit to-one joins: What are these features? Many ORMs (e.g. JPA, Doctrine, jOOQ 3.11 and others) support &#8220;path joins&#8221; (they may have different names for this concept). A path join is a join derived from &#8230; Continue reading jOOQ 3.19&#8217;s new Explicit and Implicit to-many path joins &#8594;",
      "url": "https://blog.jooq.org/jooq-3-19s-new-explicit-and-implicit-to-many-path-joins/",
      "source": "JOOQ Blog",
      "author": "lukaseder",
      "published": "2023-12-28T14:35:14+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "30b6d12b9334d484",
      "title": "How to Install Java on Windows (Step-by-Step Guide)",
      "description": "Learn how to install Java 21 (Oracle and Temurin) on Windows with screenshots and easy-to-follow instructions. The post How to Install Java on Windows (Step-by-Step Guide) appeared first on Mkyong.com.",
      "url": "https://mkyong.com/java/how-to-install-java-on-windows-step-by-step-guide/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-07-25T06:45:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "5dc982c3dd276654",
      "title": "Micronaut + Flyway Database Schema Migrations",
      "description": "Learn how to integrate Flyway with Micronaut to manage database schema migrations effortlessly. This guide covers Flyway scripts, PostgreSQL, Docker, and full CRUD examples with tests. The post Micronaut + Flyway Database Schema Migrations appeared first on Mkyong.com.",
      "url": "https://mkyong.com/micronaut/micronaut-flyway-database-schema-migrations/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-04-01T02:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "6407335a6a427050",
      "title": "List all available features in the Micronaut CLI (mn)",
      "description": "In the Micronaut CLI mn, we can use mn create-app --list-features to list all available features. Table of Contents 1. List All Feature 2. Filter Features 3. Download Source Code 4. References P.S. Tested with Micronaut 4.7.6 1. List All Feature Terminal mn create-app --list-features This will output a categorized list of features like: Terminal ... Read more The post List all available features in the Micronaut CLI (mn) appeared first on Mkyong.com.",
      "url": "https://mkyong.com/micronaut/list-all-available-features-in-the-micronaut-cli-mn/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-21T02:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "c2c77ac662900012",
      "title": "Micronaut Logging using Logback",
      "description": "Discover how to efficiently implement logging in your Micronaut applications using default Logback framework. Logging to the console, standard files, and rolling files with practical examples. The post Micronaut Logging using Logback appeared first on Mkyong.com.",
      "url": "https://mkyong.com/micronaut/micronaut-logging-examples/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-18T03:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "3864961b61c64116",
      "title": "Return ZIP file in a Micronaut Controller",
      "description": "In this tutorial, we will create a Micronaut REST API that generates and returns a ZIP file for download. Table of contents 1. Create a Micronaut Controller 2. Unit Testing the Controller 3. Run the Application 4. Download Source Code 5. References Technologies used: Java 21 Micronaut 4.7.6 Maven 3.9.6 1. Create a Micronaut Controller ... Read more The post Return ZIP file in a Micronaut Controller appeared first on Mkyong.com.",
      "url": "https://mkyong.com/micronaut/return-zip-file-in-a-micronaut-controller/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-11T03:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "83032fc0a7b03bfb",
      "title": "Working Gzip and tar.gz file in Kotlin",
      "description": "This article shows how we can compress, update, and decompress multiple files and folders into a tar.gz file using Kotlin. Table of contents: 1. Gzip vs. Java Zip 2. Add Apache Commons Compress Dependency 3. Compressing Files and Folders into a tar.gz 3.1 file name is too long (&#62;100 bytes) 4. Decompressing a tar.gz File ... Read more The post Working Gzip and tar.gz file in Kotlin appeared first on Mkyong.com.",
      "url": "https://mkyong.com/kotlin/working-with-gzip-file-tar-gz-in-kotlin/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-10T02:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "bd3b73a053f04056",
      "title": "How to compress and decompress zip file in Kotlin",
      "description": "In this tutorial, we&#8217;ll explore how to create ZIP files, add multiple files and folders to a zip file, add files to an and decompress files using Kotlin. Table of contents: 1. Adding Multiple Files to a ZIP File 2. Adding Multiple Folders to a ZIP File 3. Adding Multiple Files or Directories to an ... Read more The post How to compress and decompress zip file in Kotlin appeared first on Mkyong.com.",
      "url": "https://mkyong.com/kotlin/how-to-compress-and-decompress-zip-file-in-kotlin/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-09T02:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "b7acead879fb50f3",
      "title": "Return Excel file in a Micronaut Controller",
      "description": "In this tutorial, we will learn how to return a Excel file .xlsx in a Micronaut controller using Apache POI. Table of contents 1. Add Apache POI Dependency 2. Create the Excel Service 3. Create the Controller to return Excel file 4. Run the Application 5. Testing the Excel Download Endpoint 6. Download Source Code ... Read more The post Return Excel file in a Micronaut Controller appeared first on Mkyong.com.",
      "url": "https://mkyong.com/micronaut/return-excel-file-in-a-micronaut-controller/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-07T03:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "3fd22ddf47a73916",
      "title": "Return PDF file in a Micronaut Controller",
      "description": "In this tutorial, we will create a Micronaut REST API that generates and returns a PDF file using OpenPDF. Table of contents 1. Add OpenPDF Dependency 2. Creating the PDF Controller 3. Testing the API 4. Writing Unit Tests 5. FAQs 6. Download Source Code 7. References Technologies used: Java 21 Micronaut 4.7.6 Maven 3.9.6 ... Read more The post Return PDF file in a Micronaut Controller appeared first on Mkyong.com.",
      "url": "https://mkyong.com/micronaut/return-pdf-file-in-a-micronaut-controller/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-06T03:00:00+00:00",
      "niche": "spring",
      "score": 9,
      "keywords": []
    },
    {
      "id": "77a17c7c08583ef3",
      "title": "Sorcery with WebAssembly, GraalVM, and Java!",
      "description": "Alternative title: How I like to write my JavaScripts: in Java via WebAssembly!",
      "url": "https://joshlong.com/jl/blogpost/my-first-java-script-script-with-graalvm-and-webassembly.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-03-28T00:00:00+00:00",
      "niche": "spring",
      "score": 8,
      "keywords": []
    },
    {
      "id": "714a7225fa3062da",
      "title": "ChatGPT's new \"Work with\" feature, MCP, and more",
      "description": "update: Sam Altman just announced official support for MCP!",
      "url": "https://joshlong.com/jl/blogpost/chatgpt-work-with-and-mcp-ai.html",
      "source": "Josh Long",
      "author": "Inconnu",
      "published": "2025-03-25T00:00:00+00:00",
      "niche": "spring",
      "score": 8,
      "keywords": []
    },
    {
      "id": "a393853bff4b6201",
      "title": "Micronaut Logging using Log4j2",
      "description": "In this article, we show how to set up and use Log4j2 for logging in a Micronaut application. The post Micronaut Logging using Log4j2 appeared first on Mkyong.com.",
      "url": "https://mkyong.com/micronaut/micronaut-logging-using-log4j2/",
      "source": "Mkyong",
      "author": "mkyong",
      "published": "2025-03-22T03:00:00+00:00",
      "niche": "spring",
      "score": 7,
      "keywords": []
    }
  ]
}